stm32duino/Arduino_Core_STM32/boards.txt
# NUCLEO_F446RE board
Nucleo_144.menu.pnum.NUCLEO_F446ZE=Nucleo F446ZE
Nucleo_144.menu.pnum.NUCLEO_F446ZE.node=NODE_F446ZE
Nucleo_144.menu.pnum.NUCLEO_F446ZE.upload.maximum_size=524288
Nucleo_144.menu.pnum.NUCLEO_F446ZE.upload.maximum_data_size=131072
Nucleo_144.menu.pnum.NUCLEO_F446ZE.build.mcu=cortex-m4
Nucleo_144.menu.pnum.NUCLEO_F446ZE.build.fpu=-mfpu=fpv4-sp-d16
Nucleo_144.menu.pnum.NUCLEO_F446ZE.build.float-abi=-mfloat-abi=hard
Nucleo_144.menu.pnum.NUCLEO_F446ZE.build.board=NUCLEO_F446ZE
Nucleo_144.menu.pnum.NUCLEO_F446ZE.build.series=STM32F4xx
Nucleo_144.menu.pnum.NUCLEO_F446ZE.build.product_line=STM32F446xx
Nucleo_144.menu.pnum.NUCLEO_F446ZE.build.variant=STM32F4xx/F446Z(C-E)(H-J-T)
Nucleo_144.menu.pnum.NUCLEO_F446ZE.openocd.target=stm32f4x
Nucleo_144.menu.pnum.NUCLEO_F446ZE.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F4xx/STM32F446.svd

# NUCLEO_F722ZE board
Nucleo_144.menu.pnum.NUCLEO_F722ZE=Nucleo F722ZE
Nucleo_144.menu.pnum.NUCLEO_F722ZE.node=NODE_F722ZE
Nucleo_144.menu.pnum.NUCLEO_F722ZE.upload.maximum_size=524288
Nucleo_144.menu.pnum.NUCLEO_F722ZE.upload.maximum_data_size=262144
Nucleo_144.menu.pnum.NUCLEO_F722ZE.build.mcu=cortex-m7
Nucleo_144.menu.pnum.NUCLEO_F722ZE.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
Nucleo_144.menu.pnum.NUCLEO_F722ZE.build.board=NUCLEO_F722ZE
Nucleo_144.menu.pnum.NUCLEO_F722ZE.build.series=STM32F7xx
Nucleo_144.menu.pnum.NUCLEO_F722ZE.build.product_line=STM32F722xx
Nucleo_144.menu.pnum.NUCLEO_F722ZE.build.variant=STM32F7xx/F722Z(C-E)T_F732ZET
Nucleo_144.menu.pnum.NUCLEO_F722ZE.build.variant_h=variant_NUCLEO_F722ZE.h
Nucleo_144.menu.pnum.NUCLEO_F722ZE.openocd.target=stm32f7x
Nucleo_144.menu.pnum.NUCLEO_F722ZE.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F7xx/STM32F722.svd

# NUCLEO_F746ZG board
Nucleo_144.menu.pnum.NUCLEO_F746ZG=Nucleo F746ZG
Nucleo_144.menu.pnum.NUCLEO_F746ZG.node=NODE_F746ZG
Nucleo_144.menu.pnum.NUCLEO_F746ZG.upload.maximum_size=1048576
Nucleo_144.menu.pnum.NUCLEO_F746ZG.upload.maximum_data_size=327680
Nucleo_144.menu.pnum.NUCLEO_F746ZG.build.mcu=cortex-m7
Nucleo_144.menu.pnum.NUCLEO_F746ZG.build.fpu=-mfpu=fpv4-sp-d16
Nucleo_144.menu.pnum.NUCLEO_F746ZG.build.float-abi=-mfloat-abi=hard
Nucleo_144.menu.pnum.NUCLEO_F746ZG.build.board=NUCLEO_F746ZG
Nucleo_144.menu.pnum.NUCLEO_F746ZG.build.series=STM32F7xx
Nucleo_144.menu.pnum.NUCLEO_F746ZG.build.product_line=STM32F746xx
Nucleo_144.menu.pnum.NUCLEO_F746ZG.build.variant=STM32F7xx/F745Z(E-G)T_F746Z(E-G)(T-Y)_F750Z8T_F756ZG(T-Y)
Nucleo_144.menu.pnum.NUCLEO_F746ZG.build.variant_h=variant_NUCLEO_F7x6ZG.h
Nucleo_144.menu.pnum.NUCLEO_F746ZG.openocd.target=stm32f7x
Nucleo_144.menu.pnum.NUCLEO_F746ZG.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F7xx/STM32F746.svd

# NUCLEO_F756ZG board
Nucleo_144.menu.pnum.NUCLEO_F756ZG=Nucleo F756ZG
Nucleo_144.menu.pnum.NUCLEO_F756ZG.node=NODE_F756ZG
Nucleo_144.menu.pnum.NUCLEO_F756ZG.upload.maximum_size=1048576
Nucleo_144.menu.pnum.NUCLEO_F756ZG.upload.maximum_data_size=327680
Nucleo_144.menu.pnum.NUCLEO_F756ZG.build.mcu=cortex-m7
Nucleo_144.menu.pnum.NUCLEO_F756ZG.build.fpu=-mfpu=fpv4-sp-d16
Nucleo_144.menu.pnum.NUCLEO_F756ZG.build.float-abi=-mfloat-abi=hard
Nucleo_144.menu.pnum.NUCLEO_F756ZG.build.board=NUCLEO_F756ZG
Nucleo_144.menu.pnum.NUCLEO_F756ZG.build.series=STM32F7xx
Nucleo_144.menu.pnum.NUCLEO_F756ZG.build.product_line=STM32F756xx
Nucleo_144.menu.pnum.NUCLEO_F756ZG.build.variant=STM32F7xx/F745Z(E-G)T_F746Z(E-G)(T-Y)_F750Z8T_F756ZG(T-Y)
Nucleo_144.menu.pnum.NUCLEO_F756ZG.build.variant_h=variant_NUCLEO_F7x6ZG.h
Nucleo_144.menu.pnum.NUCLEO_F756ZG.openocd.target=stm32f7x
Nucleo_144.menu.pnum.NUCLEO_F756ZG.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F7xx/STM32F756.svd

# NUCLEO_F767ZI board
Nucleo_144.menu.pnum.NUCLEO_F767ZI=Nucleo F767ZI
Nucleo_144.menu.pnum.NUCLEO_F767ZI.node=NODE_F767ZI
Nucleo_144.menu.pnum.NUCLEO_F767ZI.upload.maximum_size=2097152
Nucleo_144.menu.pnum.NUCLEO_F767ZI.upload.maximum_data_size=524288
Nucleo_144.menu.pnum.NUCLEO_F767ZI.build.mcu=cortex-m7
Nucleo_144.menu.pnum.NUCLEO_F767ZI.build.fpu=-mfpu=fpv4-sp-d16
Nucleo_144.menu.pnum.NUCLEO_F767ZI.build.float-abi=-mfloat-abi=hard
Nucleo_144.menu.pnum.NUCLEO_F767ZI.build.board=NUCLEO_F767ZI
Nucleo_144.menu.pnum.NUCLEO_F767ZI.build.series=STM32F7xx
Nucleo_144.menu.pnum.NUCLEO_F767ZI.build.product_line=STM32F767xx
Nucleo_144.menu.pnum.NUCLEO_F767ZI.build.variant=STM32F7xx/F765Z(G-I)T_F767Z(G-I)T_F777ZIT
Nucleo_144.menu.pnum.NUCLEO_F767ZI.openocd.target=stm32f7x
Nucleo_144.menu.pnum.NUCLEO_F767ZI.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F7xx/STM32F767.svd

# NUCLEO H563ZI
Nucleo_144.menu.pnum.NUCLEO_H563ZI=Nucleo H563ZI
Nucleo_144.menu.pnum.NUCLEO_H563ZI.node=NOD_H563ZI
Nucleo_144.menu.pnum.NUCLEO_H563ZI.upload.maximum_size=2097152
Nucleo_144.menu.pnum.NUCLEO_H563ZI.upload.maximum_data_size=655360
Nucleo_144.menu.pnum.NUCLEO_H563ZI.build.mcu=cortex-m33
Nucleo_144.menu.pnum.NUCLEO_H563ZI.build.fpu=-mfpu=fpv4-sp-d16
Nucleo_144.menu.pnum.NUCLEO_H563ZI.build.float-abi=-mfloat-abi=hard
Nucleo_144.menu.pnum.NUCLEO_H563ZI.build.board=NUCLEO_H563ZI
Nucleo_144.menu.pnum.NUCLEO_H563ZI.build.series=STM32H5xx
Nucleo_144.menu.pnum.NUCLEO_H563ZI.build.product_line=STM32H563xx
Nucleo_144.menu.pnum.NUCLEO_H563ZI.build.variant=STM32H5xx/H563Z(G-I)T_H573ZIT
Nucleo_144.menu.pnum.NUCLEO_H563ZI.openocd.target=stm32h5x
Nucleo_144.menu.pnum.NUCLEO_H563ZI.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32H5xx/STM32H563.svd

# NUCLEO H723ZG board
Nucleo_144.menu.pnum.NUCLEO_H723ZG=Nucleo H723ZG
Nucleo_144.menu.pnum.NUCLEO_H723ZG.node=NODE_H723ZG
Nucleo_144.menu.pnum.NUCLEO_H723ZG.upload.maximum_size=1048576
Nucleo_144.menu.pnum.NUCLEO_H723ZG.upload.maximum_data_size=327680
Nucleo_144.menu.pnum.NUCLEO_H723ZG.build.mcu=cortex-m7
Nucleo_144.menu.pnum.NUCLEO_H723ZG.build.fpu=-mfpu=fpv4-sp-d16
Nucleo_144.menu.pnum.NUCLEO_H723ZG.build.float-abi=-mfloat-abi=hard
Nucleo_144.menu.pnum.NUCLEO_H723ZG.build.board=NUCLEO_H723ZG
Nucleo_144.menu.pnum.NUCLEO_H723ZG.build.series=STM32H7xx
Nucleo_144.menu.pnum.NUCLEO_H723ZG.build.product_line=STM32H723xx
Nucleo_144.menu.pnum.NUCLEO_H723ZG.build.variant=STM32H7xx/H723Z(E-G)T_H730ZBT_H733ZGT
Nucleo_144.menu.pnum.NUCLEO_H723ZG.openocd.target=stm32h7x
Nucleo_144.menu.pnum.NUCLEO_H723ZG.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32H7xx/STM32H723.svd

# NUCLEO_H743ZI board
Nucleo_144.menu.pnum.NUCLEO_H743ZI=Nucleo H743ZI
Nucleo_144.menu.pnum.NUCLEO_H743ZI.node=NODE_H743ZI
Nucleo_144.menu.pnum.NUCLEO_H743ZI.upload.maximum_size=2097152
Nucleo_144.menu.pnum.NUCLEO_H743ZI.upload.maximum_data_size=524288
Nucleo_144.menu.pnum.NUCLEO_H743ZI.build.mcu=cortex-m7
Nucleo_144.menu.pnum.NUCLEO_H743ZI.build.fpu=-mfpu=fpv4-sp-d16
Nucleo_144.menu.pnum.NUCLEO_H743ZI.build.float-abi=-mfloat-abi=hard
Nucleo_144.menu.pnum.NUCLEO_H743ZI.build.board=NUCLEO_H743ZI
Nucleo_144.menu.pnum.NUCLEO_H743ZI.build.series=STM32H7xx
Nucleo_144.menu.pnum.NUCLEO_H743ZI.build.product_line=STM32H743xx
Nucleo_144.menu.pnum.NUCLEO_H743ZI.build.variant=STM32H7xx/H742Z(G-I)T_H743Z(G-I)T_H747A(G-I)I_H747I(G-I)T_H750ZBT_H753ZIT_H757AII_H757IIT
Nucleo_144.menu.pnum.NUCLEO_H743ZI.openocd.target=stm32h7x
Nucleo_144.menu.pnum.NUCLEO_H743ZI.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32H7xx/STM32H743.svd

