stm32duino/Arduino_Core_STM32/boards.txt
# NUCLEO_U385RG_Q board
Nucleo_64.menu.pnum.NUCLEO_U385RG_Q=Nucleo U385RG-Q
Nucleo_64.menu.pnum.NUCLEO_U385RG_Q.node=NOD_U385RG
Nucleo_64.menu.pnum.NUCLEO_U385RG_Q.upload.maximum_size=1048576
Nucleo_64.menu.pnum.NUCLEO_U385RG_Q.upload.maximum_data_size=262144
Nucleo_64.menu.pnum.NUCLEO_U385RG_Q.build.mcu=cortex-m33
Nucleo_64.menu.pnum.NUCLEO_U385RG_Q.build.fpu=-mfpu=fpv4-sp-d16
Nucleo_64.menu.pnum.NUCLEO_U385RG_Q.build.float-abi=-mfloat-abi=hard
Nucleo_64.menu.pnum.NUCLEO_U385RG_Q.build.board=NUCLEO_U385RG_Q
Nucleo_64.menu.pnum.NUCLEO_U385RG_Q.build.series=STM32U3xx
Nucleo_64.menu.pnum.NUCLEO_U385RG_Q.build.product_line=STM32U385xx
Nucleo_64.menu.pnum.NUCLEO_U385RG_Q.build.variant=STM32U3xx/U375R(E-G)TxQ_U385RGTxQ
#Nucleo_64.menu.pnum.NUCLEO_U385RG_Q.openocd.target=stm32u3x
#Nucleo_64.menu.pnum.NUCLEO_U385RG_Q.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32U3xx/STM32U385.svd

# NUCLEO_WB09KE board
Nucleo_64.menu.pnum.NUCLEO_WB09KE=Nucleo WB09KE
Nucleo_64.menu.pnum.NUCLEO_WB09KE.node="NOD_WB09KE"
Nucleo_64.menu.pnum.NUCLEO_WB09KE.upload.maximum_size=524288
Nucleo_64.menu.pnum.NUCLEO_WB09KE.upload.maximum_data_size=65536
Nucleo_64.menu.pnum.NUCLEO_WB09KE.build.mcu=cortex-m0plus
Nucleo_64.menu.pnum.NUCLEO_WB09KE.build.board=NUCLEO_WB09KE
Nucleo_64.menu.pnum.NUCLEO_WB09KE.build.series=STM32WB0x
Nucleo_64.menu.pnum.NUCLEO_WB09KE.build.product_line=STM32WB09
Nucleo_64.menu.pnum.NUCLEO_WB09KE.build.variant=STM32WB0x/WB05KZV_WB05TZF_WB09KEV_WB09TEF
Nucleo_64.menu.pnum.NUCLEO_WB09KE.build.st_extra_flags=-D{build.product_line} {build.xSerial} -D__CORTEX_SC=0
Nucleo_64.menu.pnum.NUCLEO_WB09KE.openocd.target=stm32wb0x
Nucleo_64.menu.pnum.NUCLEO_WB09KE.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32WB0x/STM32WB09.svd
Nucleo_64.menu.pnum.NUCLEO_WB09KE.upload.address=0x10040000
Nucleo_64.menu.pnum.NUCLEO_WB09KE.upload.mode=hwRstPulse
Nucleo_64.menu.pnum.NUCLEO_WB09KE.upload.start=0x10000000

# NUCLEO_WB15CC
Nucleo_64.menu.pnum.NUCLEO_WB15CC=Nucleo WB15CC
Nucleo_64.menu.pnum.NUCLEO_WB15CC.node="NOD_WB15CC"
Nucleo_64.menu.pnum.NUCLEO_WB15CC.upload.maximum_size=131072
Nucleo_64.menu.pnum.NUCLEO_WB15CC.upload.maximum_data_size=12288
Nucleo_64.menu.pnum.NUCLEO_WB15CC.build.mcu=cortex-m4
Nucleo_64.menu.pnum.NUCLEO_WB15CC.build.fpu=-mfpu=fpv4-sp-d16
Nucleo_64.menu.pnum.NUCLEO_WB15CC.build.float-abi=-mfloat-abi=hard
Nucleo_64.menu.pnum.NUCLEO_WB15CC.build.board=NUCLEO_WB15CC
Nucleo_64.menu.pnum.NUCLEO_WB15CC.build.series=STM32WBxx
Nucleo_64.menu.pnum.NUCLEO_WB15CC.build.product_line=STM32WB15xx
Nucleo_64.menu.pnum.NUCLEO_WB15CC.build.variant=STM32WBxx/WB15CCU
Nucleo_64.menu.pnum.NUCLEO_WB15CC.openocd.target=stm32wbx
Nucleo_64.menu.pnum.NUCLEO_WB15CC.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32WBxx/STM32WB15_CM4.svd

# P_NUCLEO_WB55RG board
Nucleo_64.menu.pnum.P_NUCLEO_WB55RG=P-Nucleo WB55RG
Nucleo_64.menu.pnum.P_NUCLEO_WB55RG.node="NODE_WB55RG,NOD_WB55RG"
Nucleo_64.menu.pnum.P_NUCLEO_WB55RG.upload.maximum_size=524288
Nucleo_64.menu.pnum.P_NUCLEO_WB55RG.upload.maximum_data_size=196608
Nucleo_64.menu.pnum.P_NUCLEO_WB55RG.build.mcu=cortex-m4
Nucleo_64.menu.pnum.P_NUCLEO_WB55RG.build.fpu=-mfpu=fpv4-sp-d16
Nucleo_64.menu.pnum.P_NUCLEO_WB55RG.build.float-abi=-mfloat-abi=hard
Nucleo_64.menu.pnum.P_NUCLEO_WB55RG.build.board=P_NUCLEO_WB55RG
Nucleo_64.menu.pnum.P_NUCLEO_WB55RG.build.series=STM32WBxx
Nucleo_64.menu.pnum.P_NUCLEO_WB55RG.build.product_line=STM32WB55xx
Nucleo_64.menu.pnum.P_NUCLEO_WB55RG.build.variant=STM32WBxx/WB55R(C-E-G)V
Nucleo_64.menu.pnum.P_NUCLEO_WB55RG.openocd.target=stm32wbx
Nucleo_64.menu.pnum.P_NUCLEO_WB55RG.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32WBxx/STM32WB55_CM4.svd

# P_NUCLEO_WB55 USB Dongle
Nucleo_64.menu.pnum.P_NUCLEO_WB55_USB_DONGLE=P-Nucleo WB55 USB Dongle
Nucleo_64.menu.pnum.P_NUCLEO_WB55_USB_DONGLE.node="No_mass_storage_for_this_board_Use_STLink_upload_method"
Nucleo_64.menu.pnum.P_NUCLEO_WB55_USB_DONGLE.upload.maximum_size=524288
Nucleo_64.menu.pnum.P_NUCLEO_WB55_USB_DONGLE.upload.maximum_data_size=196608
Nucleo_64.menu.pnum.P_NUCLEO_WB55_USB_DONGLE.build.mcu=cortex-m4
Nucleo_64.menu.pnum.P_NUCLEO_WB55_USB_DONGLE.build.fpu=-mfpu=fpv4-sp-d16
Nucleo_64.menu.pnum.P_NUCLEO_WB55_USB_DONGLE.build.float-abi=-mfloat-abi=hard
Nucleo_64.menu.pnum.P_NUCLEO_WB55_USB_DONGLE.build.board=P_NUCLEO_WB55_USB_DONGLE
Nucleo_64.menu.pnum.P_NUCLEO_WB55_USB_DONGLE.build.series=STM32WBxx
Nucleo_64.menu.pnum.P_NUCLEO_WB55_USB_DONGLE.build.product_line=STM32WB55xx
Nucleo_64.menu.pnum.P_NUCLEO_WB55_USB_DONGLE.build.variant=STM32WBxx/WB35C(C-E)UxA_WB55C(C-E-G)U
Nucleo_64.menu.pnum.P_NUCLEO_WB55_USB_DONGLE.openocd.target=stm32wbx
Nucleo_64.menu.pnum.P_NUCLEO_WB55_USB_DONGLE.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32WBxx/STM32WB55_CM4.svd

# NUCLEO WBA55CG
Nucleo_64.menu.pnum.NUCLEO_WBA55CG=Nucleo WBA55CG
Nucleo_64.menu.pnum.NUCLEO_WBA55CG.node="NOD_WBA52CG,NOD_WBA55CG"
Nucleo_64.menu.pnum.NUCLEO_WBA55CG.upload.maximum_size=1048576
Nucleo_64.menu.pnum.NUCLEO_WBA55CG.upload.maximum_data_size=131072
Nucleo_64.menu.pnum.NUCLEO_WBA55CG.build.mcu=cortex-m33
Nucleo_64.menu.pnum.NUCLEO_WBA55CG.build.fpu=-mfpu=fpv4-sp-d16
Nucleo_64.menu.pnum.NUCLEO_WBA55CG.build.float-abi=-mfloat-abi=hard
Nucleo_64.menu.pnum.NUCLEO_WBA55CG.build.board=NUCLEO_WBA55CG
Nucleo_64.menu.pnum.NUCLEO_WBA55CG.build.series=STM32WBAxx
Nucleo_64.menu.pnum.NUCLEO_WBA55CG.build.product_line=STM32WBA55xx
Nucleo_64.menu.pnum.NUCLEO_WBA55CG.build.variant=STM32WBAxx/WBA55C(E-G)U
Nucleo_64.menu.pnum.NUCLEO_WBA55CG.openocd.target=stm32wbax
Nucleo_64.menu.pnum.NUCLEO_WBA55CG.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32WBAxx/STM32WBA55.svd

# NUCLEO_WL55JC1 board
Nucleo_64.menu.pnum.NUCLEO_WL55JC1=Nucleo WL55JC1
Nucleo_64.menu.pnum.NUCLEO_WL55JC1.node="NOD_WL55JC"
Nucleo_64.menu.pnum.NUCLEO_WL55JC1.upload.maximum_size=262144
Nucleo_64.menu.pnum.NUCLEO_WL55JC1.upload.maximum_data_size=65536
Nucleo_64.menu.pnum.NUCLEO_WL55JC1.build.mcu=cortex-m4
Nucleo_64.menu.pnum.NUCLEO_WL55JC1.build.board=NUCLEO_WL55JC1
Nucleo_64.menu.pnum.NUCLEO_WL55JC1.build.series=STM32WLxx
Nucleo_64.menu.pnum.NUCLEO_WL55JC1.build.product_line=STM32WLE5xx
Nucleo_64.menu.pnum.NUCLEO_WL55JC1.build.variant=STM32WLxx/WL54JCI_WL55JCI_WLE4J(8-B-C)I_WLE5J(8-B-C)I
Nucleo_64.menu.pnum.NUCLEO_WL55JC1.build.st_extra_flags=-D{build.product_line} -DUSE_CM4_STARTUP_FILE {build.xSerial}
Nucleo_64.menu.pnum.NUCLEO_WL55JC1.openocd.target=stm32wlx
Nucleo_64.menu.pnum.NUCLEO_WL55JC1.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32WLxx/STM32WLE5_CM4.svd

# Upload menu
Nucleo_64.menu.upload_method.MassStorage=Mass Storage
Nucleo_64.menu.upload_method.MassStorage.upload.protocol=
Nucleo_64.menu.upload_method.MassStorage.upload.tool=massStorageCopy

Nucleo_64.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
Nucleo_64.menu.upload_method.swdMethod.upload.protocol=swd
Nucleo_64.menu.upload_method.swdMethod.upload.options=-a {upload.address} -m {upload.mode} -s {upload.start}
Nucleo_64.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

