stm32duino/Arduino_Core_STM32/boards.txt
Nucleo_64.menu.upload_method.jlinkMethod=STM32CubeProgrammer (J-Link)
Nucleo_64.menu.upload_method.jlinkMethod.upload.protocol=jlink
Nucleo_64.menu.upload_method.jlinkMethod.upload.options=
Nucleo_64.menu.upload_method.jlinkMethod.upload.tool=stm32CubeProg

Nucleo_64.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
Nucleo_64.menu.upload_method.serialMethod.upload.protocol=serial
Nucleo_64.menu.upload_method.serialMethod.upload.options=-c {serial.port.file}
Nucleo_64.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

Nucleo_64.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
Nucleo_64.menu.upload_method.dfuMethod.upload.protocol=dfu
Nucleo_64.menu.upload_method.dfuMethod.upload.options=-v {upload.vid} -p {upload.pid}
Nucleo_64.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

Nucleo_64.menu.upload_method.bmpMethod=BMP (Black Magic Probe)
Nucleo_64.menu.upload_method.bmpMethod.upload.protocol=gdb_bmp
Nucleo_64.menu.upload_method.bmpMethod.upload.tool=bmp_upload

Nucleo_64.menu.upload_method.OpenOCDSTLink=OpenOCD STLink (SWD)
Nucleo_64.menu.upload_method.OpenOCDSTLink.upload.protocol=stlink
Nucleo_64.menu.upload_method.OpenOCDSTLink.upload.tool=openocd_upload

Nucleo_64.menu.upload_method.OpenOCDDapLink=OpenOCD DapLink (SWD)
Nucleo_64.menu.upload_method.OpenOCDDapLink.upload.protocol=cmsis-dap
Nucleo_64.menu.upload_method.OpenOCDDapLink.upload.tool=openocd_upload

################################################################################
# Nucleo 32 boards

Nucleo_32.name=Nucleo-32

Nucleo_32.build.core=arduino
Nucleo_32.build.board=Nucleo_32
Nucleo_32.build.variant_h=variant_{build.board}.h
Nucleo_32.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
Nucleo_32.build.flash_offset=0x0
Nucleo_32.upload.maximum_size=0
Nucleo_32.upload.maximum_data_size=0
Nucleo_32.vid.0=0x0483
Nucleo_32.pid.0=0x5740
# STlink V1/V2.1/V3
Nucleo_32.vid.1=0x0483
Nucleo_32.pid.1=0x3744
Nucleo_32.vid.2=0x0483
Nucleo_32.pid.2=0x3748
Nucleo_32.vid.3=0x0483
Nucleo_32.pid.3=0x374b
Nucleo_32.vid.4=0x0483
Nucleo_32.pid.4=0x374e
Nucleo_32.vid.5=0x0483
Nucleo_32.pid.5=0x374f
Nucleo_32.vid.6=0x0483
Nucleo_32.pid.6=0x3752
Nucleo_32.vid.7=0x0483
Nucleo_32.pid.7=0x3753

# NUCLEO_F031K6 board
Nucleo_32.menu.pnum.NUCLEO_F031K6=Nucleo F031K6
Nucleo_32.menu.pnum.NUCLEO_F031K6.node=NODE_F031K6
Nucleo_32.menu.pnum.NUCLEO_F031K6.upload.maximum_size=32768
Nucleo_32.menu.pnum.NUCLEO_F031K6.upload.maximum_data_size=4096
Nucleo_32.menu.pnum.NUCLEO_F031K6.build.mcu=cortex-m0
Nucleo_32.menu.pnum.NUCLEO_F031K6.build.board=NUCLEO_F031K6
Nucleo_32.menu.pnum.NUCLEO_F031K6.build.series=STM32F0xx
Nucleo_32.menu.pnum.NUCLEO_F031K6.build.product_line=STM32F031x6
Nucleo_32.menu.pnum.NUCLEO_F031K6.build.variant=STM32F0xx/F031K6T
Nucleo_32.menu.pnum.NUCLEO_F031K6.openocd.target=stm32f0x
Nucleo_32.menu.pnum.NUCLEO_F031K6.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F0xx/STM32F0x1.svd

# NUCLEO_F042K6 board
Nucleo_32.menu.pnum.NUCLEO_F042K6=Nucleo F042K6
Nucleo_32.menu.pnum.NUCLEO_F042K6.node=NODE_F042K6
Nucleo_32.menu.pnum.NUCLEO_F042K6.upload.maximum_size=32768
Nucleo_32.menu.pnum.NUCLEO_F042K6.upload.maximum_data_size=6144
Nucleo_32.menu.pnum.NUCLEO_F042K6.build.mcu=cortex-m0
Nucleo_32.menu.pnum.NUCLEO_F042K6.build.board=NUCLEO_F042K6
Nucleo_32.menu.pnum.NUCLEO_F042K6.build.series=STM32F0xx
Nucleo_32.menu.pnum.NUCLEO_F042K6.build.product_line=STM32F042x6
Nucleo_32.menu.pnum.NUCLEO_F042K6.build.variant=STM32F0xx/F042K(4-6)T
Nucleo_32.menu.pnum.NUCLEO_F042K6.openocd.target=stm32f0x
Nucleo_32.menu.pnum.NUCLEO_F042K6.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F0xx/STM32F0x2.svd

# NUCLEO_F303K8 board
Nucleo_32.menu.pnum.NUCLEO_F303K8=Nucleo F303K8
Nucleo_32.menu.pnum.NUCLEO_F303K8.node=NODE_F303K8
Nucleo_32.menu.pnum.NUCLEO_F303K8.upload.maximum_size=65536
Nucleo_32.menu.pnum.NUCLEO_F303K8.upload.maximum_data_size=12288
Nucleo_32.menu.pnum.NUCLEO_F303K8.build.mcu=cortex-m4
Nucleo_32.menu.pnum.NUCLEO_F303K8.build.fpu=-mfpu=fpv4-sp-d16
Nucleo_32.menu.pnum.NUCLEO_F303K8.build.float-abi=-mfloat-abi=hard
Nucleo_32.menu.pnum.NUCLEO_F303K8.build.board=NUCLEO_F303K8
Nucleo_32.menu.pnum.NUCLEO_F303K8.build.series=STM32F3xx
Nucleo_32.menu.pnum.NUCLEO_F303K8.build.product_line=STM32F303x8
Nucleo_32.menu.pnum.NUCLEO_F303K8.build.variant=STM32F3xx/F303K(6-8)T_F334K(4-6-8)T
Nucleo_32.menu.pnum.NUCLEO_F303K8.openocd.target=stm32f3x
Nucleo_32.menu.pnum.NUCLEO_F303K8.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F3xx/STM32F303.svd

# NUCLEO_G031K8 board
Nucleo_32.menu.pnum.NUCLEO_G031K8=Nucleo G031K8
Nucleo_32.menu.pnum.NUCLEO_G031K8.node="NODE_G031K8,NOD_G031K8"
Nucleo_32.menu.pnum.NUCLEO_G031K8.upload.maximum_size=65536
Nucleo_32.menu.pnum.NUCLEO_G031K8.upload.maximum_data_size=8192
Nucleo_32.menu.pnum.NUCLEO_G031K8.build.mcu=cortex-m0plus
Nucleo_32.menu.pnum.NUCLEO_G031K8.build.board=NUCLEO_G031K8
Nucleo_32.menu.pnum.NUCLEO_G031K8.build.series=STM32G0xx
Nucleo_32.menu.pnum.NUCLEO_G031K8.build.product_line=STM32G031xx
Nucleo_32.menu.pnum.NUCLEO_G031K8.build.variant=STM32G0xx/G031K(4-6-8)(T-U)_G041K(6-8)(T-U)
Nucleo_32.menu.pnum.NUCLEO_G031K8.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} -D__CORTEX_SC=0
Nucleo_32.menu.pnum.NUCLEO_G031K8.openocd.target=stm32g0x
Nucleo_32.menu.pnum.NUCLEO_G031K8.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G031.svd

# NUCLEO_G431KB board
Nucleo_32.menu.pnum.NUCLEO_G431KB=Nucleo G431KB
Nucleo_32.menu.pnum.NUCLEO_G431KB.node="NODE_G431KB,NOD_G431KB"
Nucleo_32.menu.pnum.NUCLEO_G431KB.upload.maximum_size=131072
Nucleo_32.menu.pnum.NUCLEO_G431KB.upload.maximum_data_size=32768
Nucleo_32.menu.pnum.NUCLEO_G431KB.build.mcu=cortex-m4
Nucleo_32.menu.pnum.NUCLEO_G431KB.build.fpu=-mfpu=fpv4-sp-d16
Nucleo_32.menu.pnum.NUCLEO_G431KB.build.float-abi=-mfloat-abi=hard
Nucleo_32.menu.pnum.NUCLEO_G431KB.build.board=NUCLEO_G431KB
Nucleo_32.menu.pnum.NUCLEO_G431KB.build.series=STM32G4xx
Nucleo_32.menu.pnum.NUCLEO_G431KB.build.product_line=STM32G431xx
Nucleo_32.menu.pnum.NUCLEO_G431KB.build.variant=STM32G4xx/G431K(6-8-B)(T-U)_G441KB(T-U)
Nucleo_32.menu.pnum.NUCLEO_G431KB.openocd.target=stm32g4x
Nucleo_32.menu.pnum.NUCLEO_G431KB.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G431.svd

# NUCLEO_L031K6 board
Nucleo_32.menu.pnum.NUCLEO_L031K6=Nucleo L031K6
Nucleo_32.menu.pnum.NUCLEO_L031K6.node=NODE_L031K6
Nucleo_32.menu.pnum.NUCLEO_L031K6.upload.maximum_size=32768
Nucleo_32.menu.pnum.NUCLEO_L031K6.upload.maximum_data_size=8192
Nucleo_32.menu.pnum.NUCLEO_L031K6.build.mcu=cortex-m0plus
Nucleo_32.menu.pnum.NUCLEO_L031K6.build.board=NUCLEO_L031K6
Nucleo_32.menu.pnum.NUCLEO_L031K6.build.series=STM32L0xx
Nucleo_32.menu.pnum.NUCLEO_L031K6.build.product_line=STM32L031xx
Nucleo_32.menu.pnum.NUCLEO_L031K6.build.variant=STM32L0xx/L031K(4-6)T_L041K6T
Nucleo_32.menu.pnum.NUCLEO_L031K6.openocd.target=stm32l0
Nucleo_32.menu.pnum.NUCLEO_L031K6.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L0x1.svd

# NUCLEO_L412KB board
Nucleo_32.menu.pnum.NUCLEO_L412KB=Nucleo L412KB
Nucleo_32.menu.pnum.NUCLEO_L412KB.node=NODE_L412KB
Nucleo_32.menu.pnum.NUCLEO_L412KB.upload.maximum_size=131072
Nucleo_32.menu.pnum.NUCLEO_L412KB.upload.maximum_data_size=40960
Nucleo_32.menu.pnum.NUCLEO_L412KB.build.mcu=cortex-m4
Nucleo_32.menu.pnum.NUCLEO_L412KB.build.fpu=-mfpu=fpv4-sp-d16
Nucleo_32.menu.pnum.NUCLEO_L412KB.build.float-abi=-mfloat-abi=hard
Nucleo_32.menu.pnum.NUCLEO_L412KB.build.board=NUCLEO_L412KB
Nucleo_32.menu.pnum.NUCLEO_L412KB.build.series=STM32L4xx
Nucleo_32.menu.pnum.NUCLEO_L412KB.build.product_line=STM32L412xx
Nucleo_32.menu.pnum.NUCLEO_L412KB.build.variant=STM32L4xx/L412K(8-B)(T-U)_L422KB(T-U)
Nucleo_32.menu.pnum.NUCLEO_L412KB.openocd.target=stm32l4x
Nucleo_32.menu.pnum.NUCLEO_L412KB.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L412.svd

# NUCLEO_L432KC board
Nucleo_32.menu.pnum.NUCLEO_L432KC=Nucleo L432KC
Nucleo_32.menu.pnum.NUCLEO_L432KC.node=NODE_L432KC
Nucleo_32.menu.pnum.NUCLEO_L432KC.upload.maximum_size=262144
Nucleo_32.menu.pnum.NUCLEO_L432KC.upload.maximum_data_size=65536
Nucleo_32.menu.pnum.NUCLEO_L432KC.build.mcu=cortex-m4
Nucleo_32.menu.pnum.NUCLEO_L432KC.build.fpu=-mfpu=fpv4-sp-d16
Nucleo_32.menu.pnum.NUCLEO_L432KC.build.float-abi=-mfloat-abi=hard
Nucleo_32.menu.pnum.NUCLEO_L432KC.build.board=NUCLEO_L432KC
Nucleo_32.menu.pnum.NUCLEO_L432KC.build.series=STM32L4xx
Nucleo_32.menu.pnum.NUCLEO_L432KC.build.product_line=STM32L432xx
Nucleo_32.menu.pnum.NUCLEO_L432KC.build.variant=STM32L4xx/L432K(B-C)U_L442KCU
Nucleo_32.menu.pnum.NUCLEO_L432KC.openocd.target=stm32l4x
Nucleo_32.menu.pnum.NUCLEO_L432KC.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L432.svd

# Upload menu
Nucleo_32.menu.upload_method.MassStorage=Mass Storage
Nucleo_32.menu.upload_method.MassStorage.upload.protocol=
Nucleo_32.menu.upload_method.MassStorage.upload.tool=massStorageCopy

Nucleo_32.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
Nucleo_32.menu.upload_method.swdMethod.upload.protocol=swd
Nucleo_32.menu.upload_method.swdMethod.upload.options=
Nucleo_32.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

