stm32duino/Arduino_Core_STM32/boards.txt
Nucleo_32.menu.upload_method.jlinkMethod=STM32CubeProgrammer (J-Link)
Nucleo_32.menu.upload_method.jlinkMethod.upload.protocol=jlink
Nucleo_32.menu.upload_method.jlinkMethod.upload.options=
Nucleo_32.menu.upload_method.jlinkMethod.upload.tool=stm32CubeProg

Nucleo_32.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
Nucleo_32.menu.upload_method.serialMethod.upload.protocol=serial
Nucleo_32.menu.upload_method.serialMethod.upload.options=-c {serial.port.file}
Nucleo_32.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

Nucleo_32.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
Nucleo_32.menu.upload_method.dfuMethod.upload.protocol=dfu
Nucleo_32.menu.upload_method.dfuMethod.upload.options=-v {upload.vid} -p {upload.pid}
Nucleo_32.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

Nucleo_32.menu.upload_method.bmpMethod=BMP (Black Magic Probe)
Nucleo_32.menu.upload_method.bmpMethod.upload.protocol=gdb_bmp
Nucleo_32.menu.upload_method.bmpMethod.upload.tool=bmp_upload

Nucleo_32.menu.upload_method.OpenOCDSTLink=OpenOCD STLink (SWD)
Nucleo_32.menu.upload_method.OpenOCDSTLink.upload.protocol=stlink
Nucleo_32.menu.upload_method.OpenOCDSTLink.upload.tool=openocd_upload

Nucleo_32.menu.upload_method.OpenOCDDapLink=OpenOCD DapLink (SWD)
Nucleo_32.menu.upload_method.OpenOCDDapLink.upload.protocol=cmsis-dap
Nucleo_32.menu.upload_method.OpenOCDDapLink.upload.tool=openocd_upload

################################################################################
# Discovery boards

Disco.name=Discovery

Disco.build.core=arduino
Disco.build.board=Disco
Disco.build.variant_h=variant_{build.board}.h
Disco.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
Disco.build.flash_offset=0x0
Disco.upload.maximum_size=0
Disco.upload.maximum_data_size=0
Disco.vid.0=0x0483
Disco.pid.0=0x5740
# STlink V1/V2.1/V3
Disco.vid.1=0x0483
Disco.pid.1=0x3744
Disco.vid.2=0x0483
Disco.pid.2=0x3748
Disco.vid.3=0x0483
Disco.pid.3=0x374b
Disco.vid.4=0x0483
Disco.pid.4=0x374e
Disco.vid.5=0x0483
Disco.pid.5=0x374f
Disco.vid.6=0x0483
Disco.pid.6=0x3752
Disco.vid.7=0x0483
Disco.pid.7=0x3753

# B_G431B_ESC1 board
Disco.menu.pnum.B_G431B_ESC1=B-G431B-ESC1
Disco.menu.pnum.B_G431B_ESC1.node="NODE_G431CB,NOD_G431CB,DIS_G431CB"
Disco.menu.pnum.B_G431B_ESC1.upload.maximum_size=131072
Disco.menu.pnum.B_G431B_ESC1.upload.maximum_data_size=32768
Disco.menu.pnum.B_G431B_ESC1.build.mcu=cortex-m4
Disco.menu.pnum.B_G431B_ESC1.build.fpu=-mfpu=fpv4-sp-d16
Disco.menu.pnum.B_G431B_ESC1.build.float-abi=-mfloat-abi=hard
Disco.menu.pnum.B_G431B_ESC1.build.board=B_G431B_ESC1
Disco.menu.pnum.B_G431B_ESC1.build.series=STM32G4xx
Disco.menu.pnum.B_G431B_ESC1.build.product_line=STM32G431xx
Disco.menu.pnum.B_G431B_ESC1.build.variant=STM32G4xx/G431C(6-8-B)U_G441CBU
Disco.menu.pnum.B_G431B_ESC1.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
Disco.menu.pnum.B_G431B_ESC1.openocd.target=stm32g4x
Disco.menu.pnum.B_G431B_ESC1.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G431.svd

# B-L072Z-LRWAN1 board
Disco.menu.pnum.B_L072Z_LRWAN1=B-L072Z-LRWAN1
Disco.menu.pnum.B_L072Z_LRWAN1.node="DIS_L072Z,NODE_L072CZ"
Disco.menu.pnum.B_L072Z_LRWAN1.upload.maximum_size=196608
Disco.menu.pnum.B_L072Z_LRWAN1.upload.maximum_data_size=20480
Disco.menu.pnum.B_L072Z_LRWAN1.build.mcu=cortex-m0plus
Disco.menu.pnum.B_L072Z_LRWAN1.build.board=B_L072Z_LRWAN1
Disco.menu.pnum.B_L072Z_LRWAN1.build.series=STM32L0xx
Disco.menu.pnum.B_L072Z_LRWAN1.build.product_line=STM32L072xx
Disco.menu.pnum.B_L072Z_LRWAN1.build.variant=STM32L0xx/L072CBY_L072CZ(E-Y)_L073CZY_L082CZY
Disco.menu.pnum.B_L072Z_LRWAN1.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
Disco.menu.pnum.B_L072Z_LRWAN1.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} -D__CORTEX_SC=0
Disco.menu.pnum.B_L072Z_LRWAN1.openocd.target=stm32l0
Disco.menu.pnum.B_L072Z_LRWAN1.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L0x2.svd

# B-L475E-IOT01A board
Disco.menu.pnum.B_L475E_IOT01A=B-L475E-IOT01A
Disco.menu.pnum.B_L475E_IOT01A.node=DIS_L4IOT
Disco.menu.pnum.B_L475E_IOT01A.upload.maximum_size=1048576
Disco.menu.pnum.B_L475E_IOT01A.upload.maximum_data_size=98304
Disco.menu.pnum.B_L475E_IOT01A.build.mcu=cortex-m4
Disco.menu.pnum.B_L475E_IOT01A.build.fpu=-mfpu=fpv4-sp-d16
Disco.menu.pnum.B_L475E_IOT01A.build.float-abi=-mfloat-abi=hard
Disco.menu.pnum.B_L475E_IOT01A.build.board=B_L475E_IOT01A
Disco.menu.pnum.B_L475E_IOT01A.build.series=STM32L4xx
Disco.menu.pnum.B_L475E_IOT01A.build.product_line=STM32L475xx
Disco.menu.pnum.B_L475E_IOT01A.build.variant=STM32L4xx/L475V(C-E-G)T_L476V(C-E-G)T_L486VGT
Disco.menu.pnum.B_L475E_IOT01A.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
Disco.menu.pnum.B_L475E_IOT01A.openocd.target=stm32l4x
Disco.menu.pnum.B_L475E_IOT01A.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L475.svd

# B_L4S5I_IOT01A board
Disco.menu.pnum.B_L4S5I_IOT01A=B-L4S5I-IOT01A
Disco.menu.pnum.B_L4S5I_IOT01A.node="DIS_L4IOT,DIS_L4S5VI"
Disco.menu.pnum.B_L4S5I_IOT01A.upload.maximum_size=2097152
Disco.menu.pnum.B_L4S5I_IOT01A.upload.maximum_data_size=655360
Disco.menu.pnum.B_L4S5I_IOT01A.build.mcu=cortex-m4
Disco.menu.pnum.B_L4S5I_IOT01A.build.fpu=-mfpu=fpv4-sp-d16
Disco.menu.pnum.B_L4S5I_IOT01A.build.float-abi=-mfloat-abi=hard
Disco.menu.pnum.B_L4S5I_IOT01A.build.board=B_L4S5I_IOT01A
Disco.menu.pnum.B_L4S5I_IOT01A.build.series=STM32L4xx
Disco.menu.pnum.B_L4S5I_IOT01A.build.product_line=STM32L4S5xx
Disco.menu.pnum.B_L4S5I_IOT01A.build.variant=STM32L4xx/L4R5V(G-I)T_L4R7VIT_L4S5VIT_L4S7VIT
Disco.menu.pnum.B_L4S5I_IOT01A.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
Disco.menu.pnum.B_L4S5I_IOT01A.openocd.target=stm32l4x
Disco.menu.pnum.B_L4S5I_IOT01A.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L4S5.svd

# B_U585I_IOT02A board
Disco.menu.pnum.B_U585I_IOT02A=B-U585I-IOT02A
Disco.menu.pnum.B_U585I_IOT02A.node="NOD_U585AI,DIS_U585AI"
Disco.menu.pnum.B_U585I_IOT02A.upload.maximum_size=2097152
Disco.menu.pnum.B_U585I_IOT02A.upload.maximum_data_size=262144
Disco.menu.pnum.B_U585I_IOT02A.build.mcu=cortex-m33
Disco.menu.pnum.B_U585I_IOT02A.build.fpu=-mfpu=fpv4-sp-d16
Disco.menu.pnum.B_U585I_IOT02A.build.float-abi=-mfloat-abi=hard
Disco.menu.pnum.B_U585I_IOT02A.build.board=B_U585I_IOT02A
Disco.menu.pnum.B_U585I_IOT02A.build.series=STM32U5xx
Disco.menu.pnum.B_U585I_IOT02A.build.product_line=STM32U585xx
Disco.menu.pnum.B_U585I_IOT02A.build.variant=STM32U5xx/U575A(G-I)IxQ_U585AIIxQ
Disco.menu.pnum.B_U585I_IOT02A.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
Disco.menu.pnum.B_U585I_IOT02A.openocd.target=stm32u5x
Disco.menu.pnum.B_U585I_IOT02A.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32U5xx/STM32U585.svd

