stm32duino/Arduino_Core_STM32/boards.txt
# STM32H573I-DK
Disco.menu.pnum.STM32H573I_DK=STM32H573I-DK
Disco.menu.pnum.STM32H573I_DK.node=DIS_H573II
Disco.menu.pnum.STM32H573I_DK.upload.maximum_size=2097152
Disco.menu.pnum.STM32H573I_DK.upload.maximum_data_size=655360
Disco.menu.pnum.STM32H573I_DK.build.mcu=cortex-m33
Disco.menu.pnum.STM32H573I_DK.build.fpu=-mfpu=fpv4-sp-d16
Disco.menu.pnum.STM32H573I_DK.build.float-abi=-mfloat-abi=hard
Disco.menu.pnum.STM32H573I_DK.build.board=STM32H573I_DK
Disco.menu.pnum.STM32H573I_DK.build.series=STM32H5xx
Disco.menu.pnum.STM32H573I_DK.build.product_line=STM32H573xx
Disco.menu.pnum.STM32H573I_DK.build.variant=STM32H5xx/H563IIKxQ_H573IIKxQ
Disco.menu.pnum.STM32H573I_DK.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
Disco.menu.pnum.STM32H573I_DK.openocd.target=stm32h5x
Disco.menu.pnum.STM32H573I_DK.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32H5xx/STM32H573.svd

# STM32H747I-DISCO
Disco.menu.pnum.STM32H747I_DISCO=STM32H747I-DISCO
Disco.menu.pnum.STM32H747I_DISCO.node=DIS_H747XI
Disco.menu.pnum.STM32H747I_DISCO.upload.maximum_size=2097152
Disco.menu.pnum.STM32H747I_DISCO.upload.maximum_data_size=524288
Disco.menu.pnum.STM32H747I_DISCO.build.mcu=cortex-m7
Disco.menu.pnum.STM32H747I_DISCO.build.fpu=-mfpu=fpv4-sp-d16
Disco.menu.pnum.STM32H747I_DISCO.build.float-abi=-mfloat-abi=hard
Disco.menu.pnum.STM32H747I_DISCO.build.board=STM32H747I_DISCO
Disco.menu.pnum.STM32H747I_DISCO.build.series=STM32H7xx
Disco.menu.pnum.STM32H747I_DISCO.build.product_line=STM32H747xx
Disco.menu.pnum.STM32H747I_DISCO.build.variant=STM32H7xx/H742X(G-I)H_H743X(G-I)H_H745X(G-I)H_H747X(G-I)H_H750XBH_H753XIH_H755XIH_H757XIH
Disco.menu.pnum.STM32H747I_DISCO.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} -DCORE_CM7
Disco.menu.pnum.STM32H747I_DISCO.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
Disco.menu.pnum.STM32H747I_DISCO.openocd.target=stm32h7x
Disco.menu.pnum.STM32H747I_DISCO.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32H7xx/STM32H747_CM7.svd

# STM32L562E-DK
Disco.menu.pnum.STM32L562E_DK=STM32L562E-DK
Disco.menu.pnum.STM32L562E_DK.node=DIS_L562QE
Disco.menu.pnum.STM32L562E_DK.upload.maximum_size=524288
Disco.menu.pnum.STM32L562E_DK.upload.maximum_data_size=196608
Disco.menu.pnum.STM32L562E_DK.build.mcu=cortex-m33
Disco.menu.pnum.STM32L562E_DK.build.fpu=-mfpu=fpv4-sp-d16
Disco.menu.pnum.STM32L562E_DK.build.float-abi=-mfloat-abi=hard
Disco.menu.pnum.STM32L562E_DK.build.board=STM32L562E_DK
Disco.menu.pnum.STM32L562E_DK.build.series=STM32L5xx
Disco.menu.pnum.STM32L562E_DK.build.product_line=STM32L562xx
Disco.menu.pnum.STM32L562E_DK.build.variant=STM32L5xx/L552Q(C-E)IxQ_L562QEIxQ
Disco.menu.pnum.STM32L562E_DK.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
Disco.menu.pnum.STM32L562E_DK.openocd.target=stm32l5x
Disco.menu.pnum.STM32L562E_DK.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L5xx/STM32L562.svd

# STM32WB5MM-DK board
Disco.menu.pnum.STM32WB5MM_DK=STM32WB5MM-DK
Disco.menu.pnum.STM32WB5MM_DK.node="DIS_WB5MMG"
Disco.menu.pnum.STM32WB5MM_DK.upload.maximum_size=827392
Disco.menu.pnum.STM32WB5MM_DK.upload.maximum_data_size=196608
Disco.menu.pnum.STM32WB5MM_DK.build.mcu=cortex-m4
Disco.menu.pnum.STM32WB5MM_DK.build.fpu=-mfpu=fpv4-sp-d16
Disco.menu.pnum.STM32WB5MM_DK.build.float-abi=-mfloat-abi=hard
Disco.menu.pnum.STM32WB5MM_DK.build.board=STM32WB5MM_DK
Disco.menu.pnum.STM32WB5MM_DK.build.series=STM32WBxx
Disco.menu.pnum.STM32WB5MM_DK.build.product_line=STM32WB5Mxx
Disco.menu.pnum.STM32WB5MM_DK.build.variant=STM32WBxx/WB5MMGH
Disco.menu.pnum.STM32WB5MM_DK.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
Disco.menu.pnum.STM32WB5MM_DK.openocd.target=stm32wbx
Disco.menu.pnum.STM32WB5MM_DK.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32WBxx/STM32WB55_CM4.svd

# Upload menu
Disco.menu.upload_method.MassStorage=Mass Storage
Disco.menu.upload_method.MassStorage.upload.protocol=
Disco.menu.upload_method.MassStorage.upload.tool=massStorageCopy

Disco.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
Disco.menu.upload_method.swdMethod.upload.protocol=swd
Disco.menu.upload_method.swdMethod.upload.options=
Disco.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

Disco.menu.upload_method.jlinkMethod=STM32CubeProgrammer (J-Link)
Disco.menu.upload_method.jlinkMethod.upload.protocol=jlink
Disco.menu.upload_method.jlinkMethod.upload.options=
Disco.menu.upload_method.jlinkMethod.upload.tool=stm32CubeProg

Disco.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
Disco.menu.upload_method.serialMethod.upload.protocol=serial
Disco.menu.upload_method.serialMethod.upload.options=-c {serial.port.file}
Disco.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

Disco.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
Disco.menu.upload_method.dfuMethod.upload.protocol=dfu
Disco.menu.upload_method.dfuMethod.upload.options=-v {upload.vid} -p {upload.pid}
Disco.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

Disco.menu.upload_method.bmpMethod=BMP (Black Magic Probe)
Disco.menu.upload_method.bmpMethod.upload.protocol=gdb_bmp
Disco.menu.upload_method.bmpMethod.upload.tool=bmp_upload

Disco.menu.upload_method.OpenOCDSTLink=OpenOCD STLink (SWD)
Disco.menu.upload_method.OpenOCDSTLink.upload.protocol=stlink
Disco.menu.upload_method.OpenOCDSTLink.upload.tool=openocd_upload

Disco.menu.upload_method.OpenOCDDapLink=OpenOCD DapLink (SWD)
Disco.menu.upload_method.OpenOCDDapLink.upload.protocol=cmsis-dap
Disco.menu.upload_method.OpenOCDDapLink.upload.tool=openocd_upload

################################################################################
# Eval boards

Eval.name=Eval

Eval.build.core=arduino
Eval.build.board=Eval
Eval.build.variant_h=variant_{build.board}.h
Eval.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
Eval.build.flash_offset=0x0
Eval.upload.maximum_size=0
Eval.upload.maximum_data_size=0
Eval.vid.0=0x0483
Eval.pid.0=0x5740
# STlink V1/V2.1/V3
Eval.vid.1=0x0483
Eval.pid.1=0x3744
Eval.vid.2=0x0483
Eval.pid.2=0x3748
Eval.vid.3=0x0483
Eval.pid.3=0x374b
Eval.vid.4=0x0483
Eval.pid.4=0x374e
Eval.vid.5=0x0483
Eval.pid.5=0x374f
Eval.vid.6=0x0483
Eval.pid.6=0x3752
Eval.vid.7=0x0483
Eval.pid.7=0x3753

# STEVAL_MKSBOX1V1 board
Eval.menu.pnum.STEVAL_MKSBOX1V1=SensorTile.box
Eval.menu.pnum.STEVAL_MKSBOX1V1.upload.maximum_size=2097152
Eval.menu.pnum.STEVAL_MKSBOX1V1.upload.maximum_data_size=655360
Eval.menu.pnum.STEVAL_MKSBOX1V1.build.mcu=cortex-m4
Eval.menu.pnum.STEVAL_MKSBOX1V1.build.fpu=-mfpu=fpv4-sp-d16
Eval.menu.pnum.STEVAL_MKSBOX1V1.build.float-abi=-mfloat-abi=hard
Eval.menu.pnum.STEVAL_MKSBOX1V1.build.board=STEVAL_MKSBOX1V1
Eval.menu.pnum.STEVAL_MKSBOX1V1.build.series=STM32L4xx
Eval.menu.pnum.STEVAL_MKSBOX1V1.build.product_line=STM32L4R9xx
Eval.menu.pnum.STEVAL_MKSBOX1V1.build.variant=STM32L4xx/L4R9Z(G-I)J_L4S9ZIJ
Eval.menu.pnum.STEVAL_MKSBOX1V1.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
Eval.menu.pnum.STEVAL_MKSBOX1V1.openocd.target=stm32l4x
Eval.menu.pnum.STEVAL_MKSBOX1V1.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L4R9.svd

# STEVAL_MKBOXPRO board
Eval.menu.pnum.STEVAL_MKBOXPRO=SensorTile.box Pro
Eval.menu.pnum.STEVAL_MKBOXPRO.upload.maximum_size=2097152
Eval.menu.pnum.STEVAL_MKBOXPRO.upload.maximum_data_size=262144
Eval.menu.pnum.STEVAL_MKBOXPRO.build.mcu=cortex-m33
Eval.menu.pnum.STEVAL_MKBOXPRO.build.fpu=-mfpu=fpv4-sp-d16
Eval.menu.pnum.STEVAL_MKBOXPRO.build.float-abi=-mfloat-abi=hard
Eval.menu.pnum.STEVAL_MKBOXPRO.build.board=STEVAL_MKBOXPRO
Eval.menu.pnum.STEVAL_MKBOXPRO.build.series=STM32U5xx
Eval.menu.pnum.STEVAL_MKBOXPRO.build.product_line=STM32U585xx
Eval.menu.pnum.STEVAL_MKBOXPRO.build.variant=STM32U5xx/U575A(G-I)IxQ_U585AIIxQ
Eval.menu.pnum.STEVAL_MKBOXPRO.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
Eval.menu.pnum.STEVAL_MKBOXPRO.openocd.target=stm32u5x
Eval.menu.pnum.STEVAL_MKBOXPRO.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32U5xx/STM32U585.svd

# Upload menu
Eval.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
Eval.menu.upload_method.swdMethod.upload.protocol=swd
Eval.menu.upload_method.swdMethod.upload.options=
Eval.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

Eval.menu.upload_method.jlinkMethod=STM32CubeProgrammer (J-Link)
Eval.menu.upload_method.jlinkMethod.upload.protocol=jlink
Eval.menu.upload_method.jlinkMethod.upload.options=
Eval.menu.upload_method.jlinkMethod.upload.tool=stm32CubeProg

Eval.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
Eval.menu.upload_method.dfuMethod.upload.protocol=dfu
Eval.menu.upload_method.dfuMethod.upload.options=-v {upload.vid} -p {upload.pid}
Eval.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

Eval.menu.upload_method.bmpMethod=BMP (Black Magic Probe)
Eval.menu.upload_method.bmpMethod.upload.protocol=gdb_bmp
Eval.menu.upload_method.bmpMethod.upload.tool=bmp_upload

Eval.menu.upload_method.OpenOCDSTLink=OpenOCD STLink (SWD)
Eval.menu.upload_method.OpenOCDSTLink.upload.protocol=stlink
Eval.menu.upload_method.OpenOCDSTLink.upload.tool=openocd_upload

Eval.menu.upload_method.OpenOCDDapLink=OpenOCD DapLink (SWD)
Eval.menu.upload_method.OpenOCDDapLink.upload.protocol=cmsis-dap
Eval.menu.upload_method.OpenOCDDapLink.upload.tool=openocd_upload

################################################################################
# STM32MP1 microprocessor series (MPU + MCU)

STM32MP1.name=STM32MP1 series coprocessor
STM32MP1.build.flash_offset=0x0
STM32MP1.upload.maximum_size=0
STM32MP1.upload.maximum_data_size=0

STM32MP1.build.core=arduino
STM32MP1.build.board=STM32MP1
STM32MP1.build.mcu=cortex-m4
STM32MP1.build.fpu=-mfpu=fpv4-sp-d16
STM32MP1.build.float-abi=-mfloat-abi=hard
STM32MP1.build.series=STM32MP1xx
STM32MP1.build.st_extra_flags=-DCORE_CM4 -D{build.product_line} {build.enable_virtio} {build.xSerial}

# STM32MP157A-DK1 board
STM32MP1.menu.pnum.STM32MP157A_DK1=STM32MP157A-DK1
STM32MP1.menu.pnum.STM32MP157A_DK1.upload.maximum_size=131072
STM32MP1.menu.pnum.STM32MP157A_DK1.upload.maximum_data_size=131072
STM32MP1.menu.pnum.STM32MP157A_DK1.build.board=STM32MP157A_DK1
STM32MP1.menu.pnum.STM32MP157A_DK1.build.product_line=STM32MP157Axx
STM32MP1.menu.pnum.STM32MP157A_DK1.build.variant=STM32MP1xx/MP153AAC_MP153CAC_MP153DAC_MP153FAC_MP157AAC_MP157CAC_MP157DAC_MP157FAC
STM32MP1.menu.pnum.STM32MP157A_DK1.build.variant_h=variant_STM32MP157_DK.h
STM32MP1.menu.pnum.STM32MP157A_DK1.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS

# STM32MP157C-DK2 board
STM32MP1.menu.pnum.STM32MP157C_DK2=STM32MP157C-DK2
STM32MP1.menu.pnum.STM32MP157C_DK2.upload.maximum_size=131072
STM32MP1.menu.pnum.STM32MP157C_DK2.upload.maximum_data_size=131072
STM32MP1.menu.pnum.STM32MP157C_DK2.build.board=STM32MP157C_DK2
STM32MP1.menu.pnum.STM32MP157C_DK2.build.product_line=STM32MP157Cxx
STM32MP1.menu.pnum.STM32MP157C_DK2.build.variant=STM32MP1xx/MP153AAC_MP153CAC_MP153DAC_MP153FAC_MP157AAC_MP157CAC_MP157DAC_MP157FAC
STM32MP1.menu.pnum.STM32MP157C_DK2.build.variant_h=variant_STM32MP157_DK.h
STM32MP1.menu.pnum.STM32MP157C_DK2.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS

# Upload menu
STM32MP1.menu.upload_method.MassStorage=Generate run_arduino.sh (You need to copy this manually)
STM32MP1.menu.upload_method.MassStorage.upload.protocol=
STM32MP1.menu.upload_method.MassStorage.upload.tool=remoteproc_gen

###############################
# Generic C0
GenC0.name=Generic STM32C0 series

GenC0.build.core=arduino
GenC0.build.board=GenC0
GenC0.build.mcu=cortex-m0plus
GenC0.build.series=STM32C0xx
GenC0.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} -D__CORTEX_SC=0
GenC0.build.flash_offset=0x0
GenC0.upload.maximum_size=0
GenC0.upload.maximum_data_size=0
GenC0.openocd.target=stm32c0x

# Generic C011D6Yx
GenC0.menu.pnum.GENERIC_C011D6YX=Generic C011D6Yx
GenC0.menu.pnum.GENERIC_C011D6YX.upload.maximum_size=32768
GenC0.menu.pnum.GENERIC_C011D6YX.upload.maximum_data_size=6144
GenC0.menu.pnum.GENERIC_C011D6YX.build.board=GENERIC_C011D6YX
GenC0.menu.pnum.GENERIC_C011D6YX.build.product_line=STM32C011xx
GenC0.menu.pnum.GENERIC_C011D6YX.build.variant=STM32C0xx/C011D6Y_C011F(4-6)(P-U)
GenC0.menu.pnum.GENERIC_C011D6YX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32C0xx/STM32C011.svd

# Generic C011F4Px
GenC0.menu.pnum.GENERIC_C011F4PX=Generic C011F4Px
GenC0.menu.pnum.GENERIC_C011F4PX.upload.maximum_size=16384
GenC0.menu.pnum.GENERIC_C011F4PX.upload.maximum_data_size=6144
GenC0.menu.pnum.GENERIC_C011F4PX.build.board=GENERIC_C011F4PX
GenC0.menu.pnum.GENERIC_C011F4PX.build.product_line=STM32C011xx
GenC0.menu.pnum.GENERIC_C011F4PX.build.variant=STM32C0xx/C011D6Y_C011F(4-6)(P-U)
GenC0.menu.pnum.GENERIC_C011F4PX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32C0xx/STM32C011.svd

# Generic C011F6Px
GenC0.menu.pnum.GENERIC_C011F6PX=Generic C011F6Px
GenC0.menu.pnum.GENERIC_C011F6PX.upload.maximum_size=32768
GenC0.menu.pnum.GENERIC_C011F6PX.upload.maximum_data_size=6144
GenC0.menu.pnum.GENERIC_C011F6PX.build.board=GENERIC_C011F6PX
GenC0.menu.pnum.GENERIC_C011F6PX.build.product_line=STM32C011xx
GenC0.menu.pnum.GENERIC_C011F6PX.build.variant=STM32C0xx/C011D6Y_C011F(4-6)(P-U)
GenC0.menu.pnum.GENERIC_C011F6PX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32C0xx/STM32C011.svd

