stm32duino/Arduino_Core_STM32/boards.txt
# Generic C092CBTx
GenC0.menu.pnum.GENERIC_C092CBTX=Generic C092CBTx
GenC0.menu.pnum.GENERIC_C092CBTX.upload.maximum_size=131072
GenC0.menu.pnum.GENERIC_C092CBTX.upload.maximum_data_size=30720
GenC0.menu.pnum.GENERIC_C092CBTX.build.board=GENERIC_C092CBTX
GenC0.menu.pnum.GENERIC_C092CBTX.build.product_line=STM32C092xx
GenC0.menu.pnum.GENERIC_C092CBTX.build.variant=STM32C0xx/C092C(B-C)(T-U)
GenC0.menu.pnum.GENERIC_C092CBTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32C0xx/STM32C092.svd

# Generic C092CBUx
GenC0.menu.pnum.GENERIC_C092CBUX=Generic C092CBUx
GenC0.menu.pnum.GENERIC_C092CBUX.upload.maximum_size=131072
GenC0.menu.pnum.GENERIC_C092CBUX.upload.maximum_data_size=30720
GenC0.menu.pnum.GENERIC_C092CBUX.build.board=GENERIC_C092CBUX
GenC0.menu.pnum.GENERIC_C092CBUX.build.product_line=STM32C092xx
GenC0.menu.pnum.GENERIC_C092CBUX.build.variant=STM32C0xx/C092C(B-C)(T-U)
GenC0.menu.pnum.GENERIC_C092CBUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32C0xx/STM32C092.svd

# Generic C092CCTx
GenC0.menu.pnum.GENERIC_C092CCTX=Generic C092CCTx
GenC0.menu.pnum.GENERIC_C092CCTX.upload.maximum_size=262144
GenC0.menu.pnum.GENERIC_C092CCTX.upload.maximum_data_size=30720
GenC0.menu.pnum.GENERIC_C092CCTX.build.board=GENERIC_C092CCTX
GenC0.menu.pnum.GENERIC_C092CCTX.build.product_line=STM32C092xx
GenC0.menu.pnum.GENERIC_C092CCTX.build.variant=STM32C0xx/C092C(B-C)(T-U)
GenC0.menu.pnum.GENERIC_C092CCTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32C0xx/STM32C092.svd

# Generic C092CCUx
GenC0.menu.pnum.GENERIC_C092CCUX=Generic C092CCUx
GenC0.menu.pnum.GENERIC_C092CCUX.upload.maximum_size=262144
GenC0.menu.pnum.GENERIC_C092CCUX.upload.maximum_data_size=30720
GenC0.menu.pnum.GENERIC_C092CCUX.build.board=GENERIC_C092CCUX
GenC0.menu.pnum.GENERIC_C092CCUX.build.product_line=STM32C092xx
GenC0.menu.pnum.GENERIC_C092CCUX.build.variant=STM32C0xx/C092C(B-C)(T-U)
GenC0.menu.pnum.GENERIC_C092CCUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32C0xx/STM32C092.svd

# Generic C092RBTx
GenC0.menu.pnum.GENERIC_C092RBTX=Generic C092RBTx
GenC0.menu.pnum.GENERIC_C092RBTX.upload.maximum_size=131072
GenC0.menu.pnum.GENERIC_C092RBTX.upload.maximum_data_size=30720
GenC0.menu.pnum.GENERIC_C092RBTX.build.board=GENERIC_C092RBTX
GenC0.menu.pnum.GENERIC_C092RBTX.build.product_line=STM32C092xx
GenC0.menu.pnum.GENERIC_C092RBTX.build.variant=STM32C0xx/C092RBT_C092RC(I-T)
GenC0.menu.pnum.GENERIC_C092RBTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32C0xx/STM32C092.svd

# Generic C092RCIx
GenC0.menu.pnum.GENERIC_C092RCIX=Generic C092RCIx
GenC0.menu.pnum.GENERIC_C092RCIX.upload.maximum_size=262144
GenC0.menu.pnum.GENERIC_C092RCIX.upload.maximum_data_size=30720
GenC0.menu.pnum.GENERIC_C092RCIX.build.board=GENERIC_C092RCIX
GenC0.menu.pnum.GENERIC_C092RCIX.build.product_line=STM32C092xx
GenC0.menu.pnum.GENERIC_C092RCIX.build.variant=STM32C0xx/C092RBT_C092RC(I-T)
GenC0.menu.pnum.GENERIC_C092RCIX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32C0xx/STM32C092.svd

# Generic C092RCTx
GenC0.menu.pnum.GENERIC_C092RCTX=Generic C092RCTx
GenC0.menu.pnum.GENERIC_C092RCTX.upload.maximum_size=262144
GenC0.menu.pnum.GENERIC_C092RCTX.upload.maximum_data_size=30720
GenC0.menu.pnum.GENERIC_C092RCTX.build.board=GENERIC_C092RCTX
GenC0.menu.pnum.GENERIC_C092RCTX.build.product_line=STM32C092xx
GenC0.menu.pnum.GENERIC_C092RCTX.build.variant=STM32C0xx/C092RBT_C092RC(I-T)
GenC0.menu.pnum.GENERIC_C092RCTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32C0xx/STM32C092.svd

# Upload menu
GenC0.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenC0.menu.upload_method.swdMethod.upload.protocol=swd
GenC0.menu.upload_method.swdMethod.upload.options=
GenC0.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenC0.menu.upload_method.jlinkMethod=STM32CubeProgrammer (J-Link)
GenC0.menu.upload_method.jlinkMethod.upload.protocol=jlink
GenC0.menu.upload_method.jlinkMethod.upload.options=
GenC0.menu.upload_method.jlinkMethod.upload.tool=stm32CubeProg

GenC0.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenC0.menu.upload_method.serialMethod.upload.protocol=serial
GenC0.menu.upload_method.serialMethod.upload.options=-c {serial.port.file}
GenC0.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenC0.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenC0.menu.upload_method.dfuMethod.upload.protocol=dfu
GenC0.menu.upload_method.dfuMethod.upload.options=-v {upload.vid} -p {upload.pid}
GenC0.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

GenC0.menu.upload_method.bmpMethod=BMP (Black Magic Probe)
GenC0.menu.upload_method.bmpMethod.upload.protocol=gdb_bmp
GenC0.menu.upload_method.bmpMethod.upload.tool=bmp_upload

GenC0.menu.upload_method.OpenOCDSTLink=OpenOCD STLink (SWD)
GenC0.menu.upload_method.OpenOCDSTLink.upload.protocol=stlink
GenC0.menu.upload_method.OpenOCDSTLink.upload.tool=openocd_upload

GenC0.menu.upload_method.OpenOCDDapLink=OpenOCD DapLink (SWD)
GenC0.menu.upload_method.OpenOCDDapLink.upload.protocol=cmsis-dap
GenC0.menu.upload_method.OpenOCDDapLink.upload.tool=openocd_upload

###############################
# Generic F0
GenF0.name=Generic STM32F0 series

GenF0.build.core=arduino
GenF0.build.board=GenF0
GenF0.build.mcu=cortex-m0
GenF0.build.series=STM32F0xx
GenF0.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
GenF0.build.flash_offset=0x0
GenF0.upload.maximum_size=0
GenF0.upload.maximum_data_size=0
GenF0.openocd.target=stm32f0x
GenF0.vid.0=0x0483
GenF0.pid.0=0x5740

# DEMO_F030F4 board
GenF0.menu.pnum.DEMO_F030F4=STM32F030F4 Demo board (HSE 8Mhz)
GenF0.menu.pnum.DEMO_F030F4.upload.maximum_size=16384
GenF0.menu.pnum.DEMO_F030F4.upload.maximum_data_size=4096
GenF0.menu.pnum.DEMO_F030F4.build.board=DEMO_F030F4
GenF0.menu.pnum.DEMO_F030F4.build.product_line=STM32F030x6
GenF0.menu.pnum.DEMO_F030F4.build.variant=STM32F0xx/F030F4P
GenF0.menu.pnum.DEMO_F030F4.build.variant_h=variant_{build.board}.h
GenF0.menu.pnum.DEMO_F030F4.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F0xx/STM32F0x0.svd

