stm32duino/Arduino_Core_STM32/boards.txt
# DEMO_F030F4_16M board
GenF0.menu.pnum.DEMO_F030F4_16M=STM32F030F4 Demo board (HSE 16Mhz)
GenF0.menu.pnum.DEMO_F030F4_16M.upload.maximum_size=16384
GenF0.menu.pnum.DEMO_F030F4_16M.upload.maximum_data_size=4096
GenF0.menu.pnum.DEMO_F030F4_16M.build.board=DEMO_F030F4_16M
GenF0.menu.pnum.DEMO_F030F4_16M.build.product_line=STM32F030x6
GenF0.menu.pnum.DEMO_F030F4_16M.build.variant=STM32F0xx/F030F4P
GenF0.menu.pnum.DEMO_F030F4_16M.build.variant_h=variant_DEMO_F030F4.h
GenF0.menu.pnum.DEMO_F030F4_16M.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F0xx/STM32F0x0.svd

# DEMO_F030F4_HSI board
GenF0.menu.pnum.DEMO_F030F4_HSI=STM32F030F4 Demo board (HSI internal RC oscillator)
GenF0.menu.pnum.DEMO_F030F4_HSI.upload.maximum_size=16384
GenF0.menu.pnum.DEMO_F030F4_HSI.upload.maximum_data_size=4096
GenF0.menu.pnum.DEMO_F030F4_HSI.build.board=DEMO_F030F4_HSI
GenF0.menu.pnum.DEMO_F030F4_HSI.build.product_line=STM32F030x6
GenF0.menu.pnum.DEMO_F030F4_HSI.build.variant=STM32F0xx/F030F4P
GenF0.menu.pnum.DEMO_F030F4_HSI.build.variant_h=variant_DEMO_F030F4.h
GenF0.menu.pnum.DEMO_F030F4_HSI.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F0xx/STM32F0x0.svd

# Generic F030C6Tx
GenF0.menu.pnum.GENERIC_F030C6TX=Generic F030C6Tx
GenF0.menu.pnum.GENERIC_F030C6TX.upload.maximum_size=32768
GenF0.menu.pnum.GENERIC_F030C6TX.upload.maximum_data_size=4096
GenF0.menu.pnum.GENERIC_F030C6TX.build.board=GENERIC_F030C6TX
GenF0.menu.pnum.GENERIC_F030C6TX.build.product_line=STM32F030x6
GenF0.menu.pnum.GENERIC_F030C6TX.build.variant=STM32F0xx/F030C6T
GenF0.menu.pnum.GENERIC_F030C6TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F0xx/STM32F0x0.svd

# Generic F030C8Tx
GenF0.menu.pnum.GENERIC_F030C8TX=Generic F030C8Tx
GenF0.menu.pnum.GENERIC_F030C8TX.upload.maximum_size=65536
GenF0.menu.pnum.GENERIC_F030C8TX.upload.maximum_data_size=8192
GenF0.menu.pnum.GENERIC_F030C8TX.build.board=GENERIC_F030C8TX
GenF0.menu.pnum.GENERIC_F030C8TX.build.product_line=STM32F030x8
GenF0.menu.pnum.GENERIC_F030C8TX.build.variant=STM32F0xx/F030C8T
GenF0.menu.pnum.GENERIC_F030C8TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F0xx/STM32F0x0.svd

# Generic F030F4Px
GenF0.menu.pnum.GENERIC_F030F4PX=Generic F030F4Px
GenF0.menu.pnum.GENERIC_F030F4PX.upload.maximum_size=16384
GenF0.menu.pnum.GENERIC_F030F4PX.upload.maximum_data_size=4096
GenF0.menu.pnum.GENERIC_F030F4PX.build.board=GENERIC_F030F4PX
GenF0.menu.pnum.GENERIC_F030F4PX.build.product_line=STM32F030x6
GenF0.menu.pnum.GENERIC_F030F4PX.build.variant=STM32F0xx/F030F4P
GenF0.menu.pnum.GENERIC_F030F4PX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F0xx/STM32F0x0.svd

# Generic F030K6Tx
GenF0.menu.pnum.GENERIC_F030K6TX=Generic F030K6Tx
GenF0.menu.pnum.GENERIC_F030K6TX.upload.maximum_size=32768
GenF0.menu.pnum.GENERIC_F030K6TX.upload.maximum_data_size=4096
GenF0.menu.pnum.GENERIC_F030K6TX.build.board=GENERIC_F030K6TX
GenF0.menu.pnum.GENERIC_F030K6TX.build.product_line=STM32F030x6
GenF0.menu.pnum.GENERIC_F030K6TX.build.variant=STM32F0xx/F030K6T
GenF0.menu.pnum.GENERIC_F030K6TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F0xx/STM32F0x0.svd

# Generic F030R8Tx
GenF0.menu.pnum.GENERIC_F030R8TX=Generic F030R8Tx
GenF0.menu.pnum.GENERIC_F030R8TX.upload.maximum_size=65536
GenF0.menu.pnum.GENERIC_F030R8TX.upload.maximum_data_size=8192
GenF0.menu.pnum.GENERIC_F030R8TX.build.board=GENERIC_F030R8TX
GenF0.menu.pnum.GENERIC_F030R8TX.build.product_line=STM32F030x8
GenF0.menu.pnum.GENERIC_F030R8TX.build.variant=STM32F0xx/F030R8T
GenF0.menu.pnum.GENERIC_F030R8TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F0xx/STM32F0x0.svd

# Generic F031C4Tx
GenF0.menu.pnum.GENERIC_F031C4TX=Generic F031C4Tx
GenF0.menu.pnum.GENERIC_F031C4TX.upload.maximum_size=16384
GenF0.menu.pnum.GENERIC_F031C4TX.upload.maximum_data_size=4096
GenF0.menu.pnum.GENERIC_F031C4TX.build.board=GENERIC_F031C4TX
GenF0.menu.pnum.GENERIC_F031C4TX.build.product_line=STM32F031x6
GenF0.menu.pnum.GENERIC_F031C4TX.build.variant=STM32F0xx/F031C(4-6)T
GenF0.menu.pnum.GENERIC_F031C4TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F0xx/STM32F0x1.svd

# Generic F031C6Tx
GenF0.menu.pnum.GENERIC_F031C6TX=Generic F031C6Tx
GenF0.menu.pnum.GENERIC_F031C6TX.upload.maximum_size=32768
GenF0.menu.pnum.GENERIC_F031C6TX.upload.maximum_data_size=4096
GenF0.menu.pnum.GENERIC_F031C6TX.build.board=GENERIC_F031C6TX
GenF0.menu.pnum.GENERIC_F031C6TX.build.product_line=STM32F031x6
GenF0.menu.pnum.GENERIC_F031C6TX.build.variant=STM32F0xx/F031C(4-6)T
GenF0.menu.pnum.GENERIC_F031C6TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F0xx/STM32F0x1.svd

# Generic F031E6Yx
GenF0.menu.pnum.GENERIC_F031E6YX=Generic F031E6Yx
GenF0.menu.pnum.GENERIC_F031E6YX.upload.maximum_size=32768
GenF0.menu.pnum.GENERIC_F031E6YX.upload.maximum_data_size=4096
GenF0.menu.pnum.GENERIC_F031E6YX.build.board=GENERIC_F031E6YX
GenF0.menu.pnum.GENERIC_F031E6YX.build.product_line=STM32F031x6
GenF0.menu.pnum.GENERIC_F031E6YX.build.variant=STM32F0xx/F031E6Y_F038E6Y
GenF0.menu.pnum.GENERIC_F031E6YX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F0xx/STM32F0x1.svd

# Generic F031F4Px
GenF0.menu.pnum.GENERIC_F031F4PX=Generic F031F4Px
GenF0.menu.pnum.GENERIC_F031F4PX.upload.maximum_size=16384
GenF0.menu.pnum.GENERIC_F031F4PX.upload.maximum_data_size=4096
GenF0.menu.pnum.GENERIC_F031F4PX.build.board=GENERIC_F031F4PX
GenF0.menu.pnum.GENERIC_F031F4PX.build.product_line=STM32F031x6
GenF0.menu.pnum.GENERIC_F031F4PX.build.variant=STM32F0xx/F031F(4-6)P
GenF0.menu.pnum.GENERIC_F031F4PX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F0xx/STM32F0x1.svd

# Generic F031F6Px
GenF0.menu.pnum.GENERIC_F031F6PX=Generic F031F6Px
GenF0.menu.pnum.GENERIC_F031F6PX.upload.maximum_size=32768
GenF0.menu.pnum.GENERIC_F031F6PX.upload.maximum_data_size=4096
GenF0.menu.pnum.GENERIC_F031F6PX.build.board=GENERIC_F031F6PX
GenF0.menu.pnum.GENERIC_F031F6PX.build.product_line=STM32F031x6
GenF0.menu.pnum.GENERIC_F031F6PX.build.variant=STM32F0xx/F031F(4-6)P
GenF0.menu.pnum.GENERIC_F031F6PX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F0xx/STM32F0x1.svd

# Generic F031G4Ux
GenF0.menu.pnum.GENERIC_F031G4UX=Generic F031G4Ux
GenF0.menu.pnum.GENERIC_F031G4UX.upload.maximum_size=16384
GenF0.menu.pnum.GENERIC_F031G4UX.upload.maximum_data_size=4096
GenF0.menu.pnum.GENERIC_F031G4UX.build.board=GENERIC_F031G4UX
GenF0.menu.pnum.GENERIC_F031G4UX.build.product_line=STM32F031x6
GenF0.menu.pnum.GENERIC_F031G4UX.build.variant=STM32F0xx/F031G(4-6)U
GenF0.menu.pnum.GENERIC_F031G4UX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F0xx/STM32F0x1.svd

