stm32duino/Arduino_Core_STM32/boards.txt
# Generic F103RCYx
GenF1.menu.pnum.GENERIC_F103RCYX=Generic F103RCYx
GenF1.menu.pnum.GENERIC_F103RCYX.upload.maximum_size=262144
GenF1.menu.pnum.GENERIC_F103RCYX.upload.maximum_data_size=49152
GenF1.menu.pnum.GENERIC_F103RCYX.build.board=GENERIC_F103RCYX
GenF1.menu.pnum.GENERIC_F103RCYX.build.product_line=STM32F103xE
GenF1.menu.pnum.GENERIC_F103RCYX.build.variant=STM32F1xx/F103R(C-D-E)Y
GenF1.menu.pnum.GENERIC_F103RCYX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F1xx/STM32F103.svd

# Generic F103RDYx
GenF1.menu.pnum.GENERIC_F103RDYX=Generic F103RDYx
GenF1.menu.pnum.GENERIC_F103RDYX.upload.maximum_size=393216
GenF1.menu.pnum.GENERIC_F103RDYX.upload.maximum_data_size=65536
GenF1.menu.pnum.GENERIC_F103RDYX.build.board=GENERIC_F103RDYX
GenF1.menu.pnum.GENERIC_F103RDYX.build.product_line=STM32F103xE
GenF1.menu.pnum.GENERIC_F103RDYX.build.variant=STM32F1xx/F103R(C-D-E)Y
GenF1.menu.pnum.GENERIC_F103RDYX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F1xx/STM32F103.svd

# Generic F103REYx
GenF1.menu.pnum.GENERIC_F103REYX=Generic F103REYx
GenF1.menu.pnum.GENERIC_F103REYX.upload.maximum_size=524288
GenF1.menu.pnum.GENERIC_F103REYX.upload.maximum_data_size=65536
GenF1.menu.pnum.GENERIC_F103REYX.build.board=GENERIC_F103REYX
GenF1.menu.pnum.GENERIC_F103REYX.build.product_line=STM32F103xE
GenF1.menu.pnum.GENERIC_F103REYX.build.variant=STM32F1xx/F103R(C-D-E)Y
GenF1.menu.pnum.GENERIC_F103REYX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F1xx/STM32F103.svd

# Generic F103RFTx
GenF1.menu.pnum.GENERIC_F103RFTX=Generic F103RFTx
GenF1.menu.pnum.GENERIC_F103RFTX.upload.maximum_size=786432
GenF1.menu.pnum.GENERIC_F103RFTX.upload.maximum_data_size=98304
GenF1.menu.pnum.GENERIC_F103RFTX.build.board=GENERIC_F103RFTX
GenF1.menu.pnum.GENERIC_F103RFTX.build.product_line=STM32F103xG
GenF1.menu.pnum.GENERIC_F103RFTX.build.variant=STM32F1xx/F103R(F-G)T
GenF1.menu.pnum.GENERIC_F103RFTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F1xx/STM32F103.svd

# Generic F103RGTx
GenF1.menu.pnum.GENERIC_F103RGTX=Generic F103RGTx
GenF1.menu.pnum.GENERIC_F103RGTX.upload.maximum_size=1048576
GenF1.menu.pnum.GENERIC_F103RGTX.upload.maximum_data_size=98304
GenF1.menu.pnum.GENERIC_F103RGTX.build.board=GENERIC_F103RGTX
GenF1.menu.pnum.GENERIC_F103RGTX.build.product_line=STM32F103xG
GenF1.menu.pnum.GENERIC_F103RGTX.build.variant=STM32F1xx/F103R(F-G)T
GenF1.menu.pnum.GENERIC_F103RGTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F1xx/STM32F103.svd

# Generic F103T4Ux
GenF1.menu.pnum.GENERIC_F103T4UX=Generic F103T4Ux
GenF1.menu.pnum.GENERIC_F103T4UX.upload.maximum_size=16384
GenF1.menu.pnum.GENERIC_F103T4UX.upload.maximum_data_size=6144
GenF1.menu.pnum.GENERIC_F103T4UX.build.board=GENERIC_F103T4UX
GenF1.menu.pnum.GENERIC_F103T4UX.build.product_line=STM32F103x6
GenF1.menu.pnum.GENERIC_F103T4UX.build.variant=STM32F1xx/F103T(4-6)U
GenF1.menu.pnum.GENERIC_F103T4UX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F1xx/STM32F103.svd

# Generic F103T6Ux
GenF1.menu.pnum.GENERIC_F103T6UX=Generic F103T6Ux
GenF1.menu.pnum.GENERIC_F103T6UX.upload.maximum_size=32768
GenF1.menu.pnum.GENERIC_F103T6UX.upload.maximum_data_size=10240
GenF1.menu.pnum.GENERIC_F103T6UX.build.board=GENERIC_F103T6UX
GenF1.menu.pnum.GENERIC_F103T6UX.build.product_line=STM32F103x6
GenF1.menu.pnum.GENERIC_F103T6UX.build.variant=STM32F1xx/F103T(4-6)U
GenF1.menu.pnum.GENERIC_F103T6UX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F1xx/STM32F103.svd

# Generic F103T8Ux
GenF1.menu.pnum.GENERIC_F103T8UX=Generic F103T8Ux
GenF1.menu.pnum.GENERIC_F103T8UX.upload.maximum_size=65536
GenF1.menu.pnum.GENERIC_F103T8UX.upload.maximum_data_size=20480
GenF1.menu.pnum.GENERIC_F103T8UX.build.board=GENERIC_F103T8UX
GenF1.menu.pnum.GENERIC_F103T8UX.build.product_line=STM32F103xB
GenF1.menu.pnum.GENERIC_F103T8UX.build.variant=STM32F1xx/F103T(8-B)U
GenF1.menu.pnum.GENERIC_F103T8UX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F1xx/STM32F103.svd

# Generic F103TBUx
GenF1.menu.pnum.GENERIC_F103TBUX=Generic F103TBUx
GenF1.menu.pnum.GENERIC_F103TBUX.upload.maximum_size=131072
GenF1.menu.pnum.GENERIC_F103TBUX.upload.maximum_data_size=20480
GenF1.menu.pnum.GENERIC_F103TBUX.build.board=GENERIC_F103TBUX
GenF1.menu.pnum.GENERIC_F103TBUX.build.product_line=STM32F103xB
GenF1.menu.pnum.GENERIC_F103TBUX.build.variant=STM32F1xx/F103T(8-B)U
GenF1.menu.pnum.GENERIC_F103TBUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F1xx/STM32F103.svd

# Generic F103V8Hx
GenF1.menu.pnum.GENERIC_F103V8HX=Generic F103V8Hx
GenF1.menu.pnum.GENERIC_F103V8HX.upload.maximum_size=65536
GenF1.menu.pnum.GENERIC_F103V8HX.upload.maximum_data_size=20480
GenF1.menu.pnum.GENERIC_F103V8HX.build.board=GENERIC_F103V8HX
GenF1.menu.pnum.GENERIC_F103V8HX.build.product_line=STM32F103xB
GenF1.menu.pnum.GENERIC_F103V8HX.build.variant=STM32F1xx/F103V8(H-T)_F103VB(H-I-T)
GenF1.menu.pnum.GENERIC_F103V8HX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F1xx/STM32F103.svd

# Generic F103VBHx
GenF1.menu.pnum.GENERIC_F103VBHX=Generic F103VBHx
GenF1.menu.pnum.GENERIC_F103VBHX.upload.maximum_size=131072
GenF1.menu.pnum.GENERIC_F103VBHX.upload.maximum_data_size=20480
GenF1.menu.pnum.GENERIC_F103VBHX.build.board=GENERIC_F103VBHX
GenF1.menu.pnum.GENERIC_F103VBHX.build.product_line=STM32F103xB
GenF1.menu.pnum.GENERIC_F103VBHX.build.variant=STM32F1xx/F103V8(H-T)_F103VB(H-I-T)
GenF1.menu.pnum.GENERIC_F103VBHX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F1xx/STM32F103.svd

# Generic F103V8Tx
GenF1.menu.pnum.GENERIC_F103V8TX=Generic F103V8Tx
GenF1.menu.pnum.GENERIC_F103V8TX.upload.maximum_size=65536
GenF1.menu.pnum.GENERIC_F103V8TX.upload.maximum_data_size=20480
GenF1.menu.pnum.GENERIC_F103V8TX.build.board=GENERIC_F103V8TX
GenF1.menu.pnum.GENERIC_F103V8TX.build.product_line=STM32F103xB
GenF1.menu.pnum.GENERIC_F103V8TX.build.variant=STM32F1xx/F103V8(H-T)_F103VB(H-I-T)
GenF1.menu.pnum.GENERIC_F103V8TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F1xx/STM32F103.svd

# Generic F103VBTx
GenF1.menu.pnum.GENERIC_F103VBTX=Generic F103VBTx
GenF1.menu.pnum.GENERIC_F103VBTX.upload.maximum_size=131072
GenF1.menu.pnum.GENERIC_F103VBTX.upload.maximum_data_size=20480
GenF1.menu.pnum.GENERIC_F103VBTX.build.board=GENERIC_F103VBTX
GenF1.menu.pnum.GENERIC_F103VBTX.build.product_line=STM32F103xB
GenF1.menu.pnum.GENERIC_F103VBTX.build.variant=STM32F1xx/F103V8(H-T)_F103VB(H-I-T)
GenF1.menu.pnum.GENERIC_F103VBTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F1xx/STM32F103.svd

# Generic F103VBIx
GenF1.menu.pnum.GENERIC_F103VBIX=Generic F103VBIx
GenF1.menu.pnum.GENERIC_F103VBIX.upload.maximum_size=131072
GenF1.menu.pnum.GENERIC_F103VBIX.upload.maximum_data_size=20480
GenF1.menu.pnum.GENERIC_F103VBIX.build.board=GENERIC_F103VBIX
GenF1.menu.pnum.GENERIC_F103VBIX.build.product_line=STM32F103xB
GenF1.menu.pnum.GENERIC_F103VBIX.build.variant=STM32F1xx/F103V8(H-T)_F103VB(H-I-T)
GenF1.menu.pnum.GENERIC_F103VBIX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F1xx/STM32F103.svd

# Generic F103VCHx
GenF1.menu.pnum.GENERIC_F103VCHX=Generic F103VCHx
GenF1.menu.pnum.GENERIC_F103VCHX.upload.maximum_size=262144
GenF1.menu.pnum.GENERIC_F103VCHX.upload.maximum_data_size=49152
GenF1.menu.pnum.GENERIC_F103VCHX.build.board=GENERIC_F103VCHX
GenF1.menu.pnum.GENERIC_F103VCHX.build.product_line=STM32F103xE
GenF1.menu.pnum.GENERIC_F103VCHX.build.variant=STM32F1xx/F103V(C-D-E)(H-T)
GenF1.menu.pnum.GENERIC_F103VCHX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F1xx/STM32F103.svd

# Generic F103VDHx
GenF1.menu.pnum.GENERIC_F103VDHX=Generic F103VDHx
GenF1.menu.pnum.GENERIC_F103VDHX.upload.maximum_size=393216
GenF1.menu.pnum.GENERIC_F103VDHX.upload.maximum_data_size=65536
GenF1.menu.pnum.GENERIC_F103VDHX.build.board=GENERIC_F103VDHX
GenF1.menu.pnum.GENERIC_F103VDHX.build.product_line=STM32F103xE
GenF1.menu.pnum.GENERIC_F103VDHX.build.variant=STM32F1xx/F103V(C-D-E)(H-T)
GenF1.menu.pnum.GENERIC_F103VDHX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F1xx/STM32F103.svd

# Generic F103VEHx
GenF1.menu.pnum.GENERIC_F103VEHX=Generic F103VEHx
GenF1.menu.pnum.GENERIC_F103VEHX.upload.maximum_size=524288
GenF1.menu.pnum.GENERIC_F103VEHX.upload.maximum_data_size=65536
GenF1.menu.pnum.GENERIC_F103VEHX.build.board=GENERIC_F103VEHX
GenF1.menu.pnum.GENERIC_F103VEHX.build.product_line=STM32F103xE
GenF1.menu.pnum.GENERIC_F103VEHX.build.variant=STM32F1xx/F103V(C-D-E)(H-T)
GenF1.menu.pnum.GENERIC_F103VEHX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F1xx/STM32F103.svd

# Generic F103VCTx
GenF1.menu.pnum.GENERIC_F103VCTX=Generic F103VCTx
GenF1.menu.pnum.GENERIC_F103VCTX.upload.maximum_size=262144
GenF1.menu.pnum.GENERIC_F103VCTX.upload.maximum_data_size=49152
GenF1.menu.pnum.GENERIC_F103VCTX.build.board=GENERIC_F103VCTX
GenF1.menu.pnum.GENERIC_F103VCTX.build.product_line=STM32F103xE
GenF1.menu.pnum.GENERIC_F103VCTX.build.variant=STM32F1xx/F103V(C-D-E)(H-T)
GenF1.menu.pnum.GENERIC_F103VCTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F1xx/STM32F103.svd

# Generic F103VDTx
GenF1.menu.pnum.GENERIC_F103VDTX=Generic F103VDTx
GenF1.menu.pnum.GENERIC_F103VDTX.upload.maximum_size=393216
GenF1.menu.pnum.GENERIC_F103VDTX.upload.maximum_data_size=65536
GenF1.menu.pnum.GENERIC_F103VDTX.build.board=GENERIC_F103VDTX
GenF1.menu.pnum.GENERIC_F103VDTX.build.product_line=STM32F103xE
GenF1.menu.pnum.GENERIC_F103VDTX.build.variant=STM32F1xx/F103V(C-D-E)(H-T)
GenF1.menu.pnum.GENERIC_F103VDTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F1xx/STM32F103.svd

