stm32duino/Arduino_Core_STM32/boards.txt
GenF1.menu.upload_method.jlinkMethod=STM32CubeProgrammer (J-Link)
GenF1.menu.upload_method.jlinkMethod.upload.protocol=jlink
GenF1.menu.upload_method.jlinkMethod.upload.options=
GenF1.menu.upload_method.jlinkMethod.upload.tool=stm32CubeProg

GenF1.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenF1.menu.upload_method.serialMethod.upload.protocol=serial
GenF1.menu.upload_method.serialMethod.upload.options=-c {serial.port.file}
GenF1.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenF1.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenF1.menu.upload_method.dfuMethod.upload.protocol=dfu
GenF1.menu.upload_method.dfuMethod.upload.options=-v {upload.vid} -p {upload.pid}
GenF1.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

GenF1.menu.upload_method.bmpMethod=BMP (Black Magic Probe)
GenF1.menu.upload_method.bmpMethod.upload.protocol=gdb_bmp
GenF1.menu.upload_method.bmpMethod.upload.tool=bmp_upload

GenF1.menu.upload_method.hidMethod=HID Bootloader 2.2
GenF1.menu.upload_method.hidMethod.upload.protocol=hid22
GenF1.menu.upload_method.hidMethod.upload.tool=hid_upload
GenF1.menu.upload_method.hidMethod.build.flash_offset=0x800
GenF1.menu.upload_method.hidMethod.build.bootloader_flags=-DBL_HID

GenF1.menu.upload_method.dfu2Method=Maple DFU Bootloader 2.0
GenF1.menu.upload_method.dfu2Method.upload.protocol=maple
GenF1.menu.upload_method.dfu2Method.upload.tool=maple_upload
GenF1.menu.upload_method.dfu2Method.upload.altID=2
GenF1.menu.upload_method.dfu2Method.build.flash_offset=0x2000
GenF1.menu.upload_method.dfu2Method.build.bootloader_flags=-DBL_LEGACY_LEAF

GenF1.menu.upload_method.dfuoMethod=Maple DFU Bootloader original
GenF1.menu.upload_method.dfuoMethod.upload.protocol=maple
GenF1.menu.upload_method.dfuoMethod.upload.tool=maple_upload
GenF1.menu.upload_method.dfuoMethod.upload.altID=1
GenF1.menu.upload_method.dfuoMethod.build.flash_offset=0x5000
GenF1.menu.upload_method.dfuoMethod.build.bootloader_flags=-DBL_LEGACY_LEAF

GenF1.menu.upload_method.OpenOCDSTLink=OpenOCD STLink (SWD)
GenF1.menu.upload_method.OpenOCDSTLink.upload.protocol=stlink
GenF1.menu.upload_method.OpenOCDSTLink.upload.tool=openocd_upload

GenF1.menu.upload_method.OpenOCDDapLink=OpenOCD DapLink (SWD)
GenF1.menu.upload_method.OpenOCDDapLink.upload.protocol=cmsis-dap
GenF1.menu.upload_method.OpenOCDDapLink.upload.tool=openocd_upload

################################################################################
# Generic F2
GenF2.name=Generic STM32F2 series

GenF2.build.core=arduino
GenF2.build.board=GenF2
GenF2.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
GenF2.build.mcu=cortex-m3
GenF2.build.series=STM32F2xx
GenF2.build.flash_offset=0x0
GenF2.upload.maximum_size=0
GenF2.upload.maximum_data_size=0
GenF2.openocd.target=stm32f2x
GenF2.vid.0=0x0483
GenF2.pid.0=0x5740

# Generic F205RBTx
GenF2.menu.pnum.GENERIC_F205RBTX=Generic F205RBTx
GenF2.menu.pnum.GENERIC_F205RBTX.upload.maximum_size=131072
GenF2.menu.pnum.GENERIC_F205RBTX.upload.maximum_data_size=65536
GenF2.menu.pnum.GENERIC_F205RBTX.build.board=GENERIC_F205RBTX
GenF2.menu.pnum.GENERIC_F205RBTX.build.product_line=STM32F205xx
GenF2.menu.pnum.GENERIC_F205RBTX.build.variant=STM32F2xx/F205RE(T-Y)_F205R(B-C-F)T_F205RG(E-T-Y)_F215R(E-G)T
GenF2.menu.pnum.GENERIC_F205RBTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F2xx/STM32F205.svd

# Generic F205RCTx
GenF2.menu.pnum.GENERIC_F205RCTX=Generic F205RCTx
GenF2.menu.pnum.GENERIC_F205RCTX.upload.maximum_size=262144
GenF2.menu.pnum.GENERIC_F205RCTX.upload.maximum_data_size=98304
GenF2.menu.pnum.GENERIC_F205RCTX.build.board=GENERIC_F205RCTX
GenF2.menu.pnum.GENERIC_F205RCTX.build.product_line=STM32F205xx
GenF2.menu.pnum.GENERIC_F205RCTX.build.variant=STM32F2xx/F205RE(T-Y)_F205R(B-C-F)T_F205RG(E-T-Y)_F215R(E-G)T
GenF2.menu.pnum.GENERIC_F205RCTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F2xx/STM32F205.svd

# Generic F205RETx
GenF2.menu.pnum.GENERIC_F205RETX=Generic F205RETx
GenF2.menu.pnum.GENERIC_F205RETX.upload.maximum_size=524288
GenF2.menu.pnum.GENERIC_F205RETX.upload.maximum_data_size=131072
GenF2.menu.pnum.GENERIC_F205RETX.build.board=GENERIC_F205RETX
GenF2.menu.pnum.GENERIC_F205RETX.build.product_line=STM32F205xx
GenF2.menu.pnum.GENERIC_F205RETX.build.variant=STM32F2xx/F205RE(T-Y)_F205R(B-C-F)T_F205RG(E-T-Y)_F215R(E-G)T
GenF2.menu.pnum.GENERIC_F205RETX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F2xx/STM32F205.svd

# Generic F205RFTx
GenF2.menu.pnum.GENERIC_F205RFTX=Generic F205RFTx
GenF2.menu.pnum.GENERIC_F205RFTX.upload.maximum_size=786432
GenF2.menu.pnum.GENERIC_F205RFTX.upload.maximum_data_size=131072
GenF2.menu.pnum.GENERIC_F205RFTX.build.board=GENERIC_F205RFTX
GenF2.menu.pnum.GENERIC_F205RFTX.build.product_line=STM32F205xx
GenF2.menu.pnum.GENERIC_F205RFTX.build.variant=STM32F2xx/F205RE(T-Y)_F205R(B-C-F)T_F205RG(E-T-Y)_F215R(E-G)T
GenF2.menu.pnum.GENERIC_F205RFTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F2xx/STM32F205.svd

# Generic F205RGTx
GenF2.menu.pnum.GENERIC_F205RGTX=Generic F205RGTx
GenF2.menu.pnum.GENERIC_F205RGTX.upload.maximum_size=1048576
GenF2.menu.pnum.GENERIC_F205RGTX.upload.maximum_data_size=131072
GenF2.menu.pnum.GENERIC_F205RGTX.build.board=GENERIC_F205RGTX
GenF2.menu.pnum.GENERIC_F205RGTX.build.product_line=STM32F205xx
GenF2.menu.pnum.GENERIC_F205RGTX.build.variant=STM32F2xx/F205RE(T-Y)_F205R(B-C-F)T_F205RG(E-T-Y)_F215R(E-G)T
GenF2.menu.pnum.GENERIC_F205RGTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F2xx/STM32F205.svd

# Generic F205REYx
GenF2.menu.pnum.GENERIC_F205REYX=Generic F205REYx
GenF2.menu.pnum.GENERIC_F205REYX.upload.maximum_size=524288
GenF2.menu.pnum.GENERIC_F205REYX.upload.maximum_data_size=131072
GenF2.menu.pnum.GENERIC_F205REYX.build.board=GENERIC_F205REYX
GenF2.menu.pnum.GENERIC_F205REYX.build.product_line=STM32F205xx
GenF2.menu.pnum.GENERIC_F205REYX.build.variant=STM32F2xx/F205RE(T-Y)_F205R(B-C-F)T_F205RG(E-T-Y)_F215R(E-G)T
GenF2.menu.pnum.GENERIC_F205REYX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F2xx/STM32F205.svd

# Generic F205RGYx
GenF2.menu.pnum.GENERIC_F205RGYX=Generic F205RGYx
GenF2.menu.pnum.GENERIC_F205RGYX.upload.maximum_size=1048576
GenF2.menu.pnum.GENERIC_F205RGYX.upload.maximum_data_size=131072
GenF2.menu.pnum.GENERIC_F205RGYX.build.board=GENERIC_F205RGYX
GenF2.menu.pnum.GENERIC_F205RGYX.build.product_line=STM32F205xx
GenF2.menu.pnum.GENERIC_F205RGYX.build.variant=STM32F2xx/F205RE(T-Y)_F205R(B-C-F)T_F205RG(E-T-Y)_F215R(E-G)T
GenF2.menu.pnum.GENERIC_F205RGYX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F2xx/STM32F205.svd

