stm32duino/Arduino_Core_STM32/boards.txt
# Generic F207IFHx
GenF2.menu.pnum.GENERIC_F207IFHX=Generic F207IFHx
GenF2.menu.pnum.GENERIC_F207IFHX.upload.maximum_size=786432
GenF2.menu.pnum.GENERIC_F207IFHX.upload.maximum_data_size=131072
GenF2.menu.pnum.GENERIC_F207IFHX.build.board=GENERIC_F207IFHX
GenF2.menu.pnum.GENERIC_F207IFHX.build.product_line=STM32F207xx
GenF2.menu.pnum.GENERIC_F207IFHX.build.variant=STM32F2xx/F207I(C-E-F-G)(H-T)_F217I(E-G)(H-T)
GenF2.menu.pnum.GENERIC_F207IFHX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F2xx/STM32F207.svd

# Generic F207IGHx
GenF2.menu.pnum.GENERIC_F207IGHX=Generic F207IGHx
GenF2.menu.pnum.GENERIC_F207IGHX.upload.maximum_size=1048576
GenF2.menu.pnum.GENERIC_F207IGHX.upload.maximum_data_size=131072
GenF2.menu.pnum.GENERIC_F207IGHX.build.board=GENERIC_F207IGHX
GenF2.menu.pnum.GENERIC_F207IGHX.build.product_line=STM32F207xx
GenF2.menu.pnum.GENERIC_F207IGHX.build.variant=STM32F2xx/F207I(C-E-F-G)(H-T)_F217I(E-G)(H-T)
GenF2.menu.pnum.GENERIC_F207IGHX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F2xx/STM32F207.svd

# Generic F207ICTx
GenF2.menu.pnum.GENERIC_F207ICTX=Generic F207ICTx
GenF2.menu.pnum.GENERIC_F207ICTX.upload.maximum_size=262144
GenF2.menu.pnum.GENERIC_F207ICTX.upload.maximum_data_size=131072
GenF2.menu.pnum.GENERIC_F207ICTX.build.board=GENERIC_F207ICTX
GenF2.menu.pnum.GENERIC_F207ICTX.build.product_line=STM32F207xx
GenF2.menu.pnum.GENERIC_F207ICTX.build.variant=STM32F2xx/F207I(C-E-F-G)(H-T)_F217I(E-G)(H-T)
GenF2.menu.pnum.GENERIC_F207ICTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F2xx/STM32F207.svd

# Generic F207IETx
GenF2.menu.pnum.GENERIC_F207IETX=Generic F207IETx
GenF2.menu.pnum.GENERIC_F207IETX.upload.maximum_size=524288
GenF2.menu.pnum.GENERIC_F207IETX.upload.maximum_data_size=131072
GenF2.menu.pnum.GENERIC_F207IETX.build.board=GENERIC_F207IETX
GenF2.menu.pnum.GENERIC_F207IETX.build.product_line=STM32F207xx
GenF2.menu.pnum.GENERIC_F207IETX.build.variant=STM32F2xx/F207I(C-E-F-G)(H-T)_F217I(E-G)(H-T)
GenF2.menu.pnum.GENERIC_F207IETX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F2xx/STM32F207.svd

# Generic F207IFTx
GenF2.menu.pnum.GENERIC_F207IFTX=Generic F207IFTx
GenF2.menu.pnum.GENERIC_F207IFTX.upload.maximum_size=786432
GenF2.menu.pnum.GENERIC_F207IFTX.upload.maximum_data_size=131072
GenF2.menu.pnum.GENERIC_F207IFTX.build.board=GENERIC_F207IFTX
GenF2.menu.pnum.GENERIC_F207IFTX.build.product_line=STM32F207xx
GenF2.menu.pnum.GENERIC_F207IFTX.build.variant=STM32F2xx/F207I(C-E-F-G)(H-T)_F217I(E-G)(H-T)
GenF2.menu.pnum.GENERIC_F207IFTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F2xx/STM32F207.svd

# Generic F207IGTx
GenF2.menu.pnum.GENERIC_F207IGTX=Generic F207IGTx
GenF2.menu.pnum.GENERIC_F207IGTX.upload.maximum_size=1048576
GenF2.menu.pnum.GENERIC_F207IGTX.upload.maximum_data_size=131072
GenF2.menu.pnum.GENERIC_F207IGTX.build.board=GENERIC_F207IGTX
GenF2.menu.pnum.GENERIC_F207IGTX.build.product_line=STM32F207xx
GenF2.menu.pnum.GENERIC_F207IGTX.build.variant=STM32F2xx/F207I(C-E-F-G)(H-T)_F217I(E-G)(H-T)
GenF2.menu.pnum.GENERIC_F207IGTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F2xx/STM32F207.svd

# Generic F207VCTx
GenF2.menu.pnum.GENERIC_F207VCTX=Generic F207VCTx
GenF2.menu.pnum.GENERIC_F207VCTX.upload.maximum_size=262144
GenF2.menu.pnum.GENERIC_F207VCTX.upload.maximum_data_size=131072
GenF2.menu.pnum.GENERIC_F207VCTX.build.board=GENERIC_F207VCTX
GenF2.menu.pnum.GENERIC_F207VCTX.build.product_line=STM32F207xx
GenF2.menu.pnum.GENERIC_F207VCTX.build.variant=STM32F2xx/F207V(C-E-F-G)T_F217V(E-G)T
GenF2.menu.pnum.GENERIC_F207VCTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F2xx/STM32F207.svd

# Generic F207VETx
GenF2.menu.pnum.GENERIC_F207VETX=Generic F207VETx
GenF2.menu.pnum.GENERIC_F207VETX.upload.maximum_size=524288
GenF2.menu.pnum.GENERIC_F207VETX.upload.maximum_data_size=131072
GenF2.menu.pnum.GENERIC_F207VETX.build.board=GENERIC_F207VETX
GenF2.menu.pnum.GENERIC_F207VETX.build.product_line=STM32F207xx
GenF2.menu.pnum.GENERIC_F207VETX.build.variant=STM32F2xx/F207V(C-E-F-G)T_F217V(E-G)T
GenF2.menu.pnum.GENERIC_F207VETX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F2xx/STM32F207.svd

# Generic F207VFTx
GenF2.menu.pnum.GENERIC_F207VFTX=Generic F207VFTx
GenF2.menu.pnum.GENERIC_F207VFTX.upload.maximum_size=786432
GenF2.menu.pnum.GENERIC_F207VFTX.upload.maximum_data_size=131072
GenF2.menu.pnum.GENERIC_F207VFTX.build.board=GENERIC_F207VFTX
GenF2.menu.pnum.GENERIC_F207VFTX.build.product_line=STM32F207xx
GenF2.menu.pnum.GENERIC_F207VFTX.build.variant=STM32F2xx/F207V(C-E-F-G)T_F217V(E-G)T
GenF2.menu.pnum.GENERIC_F207VFTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F2xx/STM32F207.svd

# Generic F207VGTx
GenF2.menu.pnum.GENERIC_F207VGTX=Generic F207VGTx
GenF2.menu.pnum.GENERIC_F207VGTX.upload.maximum_size=1048576
GenF2.menu.pnum.GENERIC_F207VGTX.upload.maximum_data_size=131072
GenF2.menu.pnum.GENERIC_F207VGTX.build.board=GENERIC_F207VGTX
GenF2.menu.pnum.GENERIC_F207VGTX.build.product_line=STM32F207xx
GenF2.menu.pnum.GENERIC_F207VGTX.build.variant=STM32F2xx/F207V(C-E-F-G)T_F217V(E-G)T
GenF2.menu.pnum.GENERIC_F207VGTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F2xx/STM32F207.svd

# Generic F207ZCTx
GenF2.menu.pnum.GENERIC_F207ZCTX=Generic F207ZCTx
GenF2.menu.pnum.GENERIC_F207ZCTX.upload.maximum_size=262144
GenF2.menu.pnum.GENERIC_F207ZCTX.upload.maximum_data_size=131072
GenF2.menu.pnum.GENERIC_F207ZCTX.build.board=GENERIC_F207ZCTX
GenF2.menu.pnum.GENERIC_F207ZCTX.build.product_line=STM32F207xx
GenF2.menu.pnum.GENERIC_F207ZCTX.build.variant=STM32F2xx/F207Z(C-E-F-G)T_F217Z(E-G)T
GenF2.menu.pnum.GENERIC_F207ZCTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F2xx/STM32F207.svd

# Generic F207ZETx
GenF2.menu.pnum.GENERIC_F207ZETX=Generic F207ZETx
GenF2.menu.pnum.GENERIC_F207ZETX.upload.maximum_size=524288
GenF2.menu.pnum.GENERIC_F207ZETX.upload.maximum_data_size=131072
GenF2.menu.pnum.GENERIC_F207ZETX.build.board=GENERIC_F207ZETX
GenF2.menu.pnum.GENERIC_F207ZETX.build.product_line=STM32F207xx
GenF2.menu.pnum.GENERIC_F207ZETX.build.variant=STM32F2xx/F207Z(C-E-F-G)T_F217Z(E-G)T
GenF2.menu.pnum.GENERIC_F207ZETX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F2xx/STM32F207.svd

