stm32duino/Arduino_Core_STM32/boards.txt
# Generic F334K6Tx
GenF3.menu.pnum.GENERIC_F334K6TX=Generic F334K6Tx
GenF3.menu.pnum.GENERIC_F334K6TX.upload.maximum_size=32768
GenF3.menu.pnum.GENERIC_F334K6TX.upload.maximum_data_size=12288
GenF3.menu.pnum.GENERIC_F334K6TX.build.board=GENERIC_F334K6TX
GenF3.menu.pnum.GENERIC_F334K6TX.build.product_line=STM32F334x8
GenF3.menu.pnum.GENERIC_F334K6TX.build.variant=STM32F3xx/F303K(6-8)T_F334K(4-6-8)T
GenF3.menu.pnum.GENERIC_F334K6TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F3xx/STM32F3x4.svd

# Generic F334K8Tx
GenF3.menu.pnum.GENERIC_F334K8TX=Generic F334K8Tx
GenF3.menu.pnum.GENERIC_F334K8TX.upload.maximum_size=65536
GenF3.menu.pnum.GENERIC_F334K8TX.upload.maximum_data_size=12288
GenF3.menu.pnum.GENERIC_F334K8TX.build.board=GENERIC_F334K8TX
GenF3.menu.pnum.GENERIC_F334K8TX.build.product_line=STM32F334x8
GenF3.menu.pnum.GENERIC_F334K8TX.build.variant=STM32F3xx/F303K(6-8)T_F334K(4-6-8)T
GenF3.menu.pnum.GENERIC_F334K8TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F3xx/STM32F3x4.svd

# Generic F334R6Tx
GenF3.menu.pnum.GENERIC_F334R6TX=Generic F334R6Tx
GenF3.menu.pnum.GENERIC_F334R6TX.upload.maximum_size=32768
GenF3.menu.pnum.GENERIC_F334R6TX.upload.maximum_data_size=12288
GenF3.menu.pnum.GENERIC_F334R6TX.build.board=GENERIC_F334R6TX
GenF3.menu.pnum.GENERIC_F334R6TX.build.product_line=STM32F334x8
GenF3.menu.pnum.GENERIC_F334R6TX.build.variant=STM32F3xx/F303R(6-8)T_F334R(6-8)T
GenF3.menu.pnum.GENERIC_F334R6TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F3xx/STM32F3x4.svd

# Generic F334R8Tx
GenF3.menu.pnum.GENERIC_F334R8TX=Generic F334R8Tx
GenF3.menu.pnum.GENERIC_F334R8TX.upload.maximum_size=65536
GenF3.menu.pnum.GENERIC_F334R8TX.upload.maximum_data_size=12288
GenF3.menu.pnum.GENERIC_F334R8TX.build.board=GENERIC_F334R8TX
GenF3.menu.pnum.GENERIC_F334R8TX.build.product_line=STM32F334x8
GenF3.menu.pnum.GENERIC_F334R8TX.build.variant=STM32F3xx/F303R(6-8)T_F334R(6-8)T
GenF3.menu.pnum.GENERIC_F334R8TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F3xx/STM32F3x4.svd

# Generic F358CCTx
GenF3.menu.pnum.GENERIC_F358CCTX=Generic F358CCTx
GenF3.menu.pnum.GENERIC_F358CCTX.upload.maximum_size=262144
GenF3.menu.pnum.GENERIC_F358CCTX.upload.maximum_data_size=40960
GenF3.menu.pnum.GENERIC_F358CCTX.build.board=GENERIC_F358CCTX
GenF3.menu.pnum.GENERIC_F358CCTX.build.product_line=STM32F358xx
GenF3.menu.pnum.GENERIC_F358CCTX.build.variant=STM32F3xx/F358CCT
GenF3.menu.pnum.GENERIC_F358CCTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F3xx/STM32F3x8.svd

# Generic F358RCTx
GenF3.menu.pnum.GENERIC_F358RCTX=Generic F358RCTx
GenF3.menu.pnum.GENERIC_F358RCTX.upload.maximum_size=262144
GenF3.menu.pnum.GENERIC_F358RCTX.upload.maximum_data_size=40960
GenF3.menu.pnum.GENERIC_F358RCTX.build.board=GENERIC_F358RCTX
GenF3.menu.pnum.GENERIC_F358RCTX.build.product_line=STM32F358xx
GenF3.menu.pnum.GENERIC_F358RCTX.build.variant=STM32F3xx/F358RCT
GenF3.menu.pnum.GENERIC_F358RCTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F3xx/STM32F3x8.svd

# Generic F358VCTx
GenF3.menu.pnum.GENERIC_F358VCTX=Generic F358VCTx
GenF3.menu.pnum.GENERIC_F358VCTX.upload.maximum_size=262144
GenF3.menu.pnum.GENERIC_F358VCTX.upload.maximum_data_size=40960
GenF3.menu.pnum.GENERIC_F358VCTX.build.board=GENERIC_F358VCTX
GenF3.menu.pnum.GENERIC_F358VCTX.build.product_line=STM32F358xx
GenF3.menu.pnum.GENERIC_F358VCTX.build.variant=STM32F3xx/F358VCT
GenF3.menu.pnum.GENERIC_F358VCTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F3xx/STM32F3x8.svd

# Generic F378CCTx
GenF3.menu.pnum.GENERIC_F378CCTX=Generic F378CCTx
GenF3.menu.pnum.GENERIC_F378CCTX.upload.maximum_size=262144
GenF3.menu.pnum.GENERIC_F378CCTX.upload.maximum_data_size=32768
GenF3.menu.pnum.GENERIC_F378CCTX.build.board=GENERIC_F378CCTX
GenF3.menu.pnum.GENERIC_F378CCTX.build.product_line=STM32F378xx
GenF3.menu.pnum.GENERIC_F378CCTX.build.variant=STM32F3xx/F378CCT
GenF3.menu.pnum.GENERIC_F378CCTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F3xx/STM32F3x8.svd

# Generic F378RCTx
GenF3.menu.pnum.GENERIC_F378RCTX=Generic F378RCTx
GenF3.menu.pnum.GENERIC_F378RCTX.upload.maximum_size=262144
GenF3.menu.pnum.GENERIC_F378RCTX.upload.maximum_data_size=32768
GenF3.menu.pnum.GENERIC_F378RCTX.build.board=GENERIC_F378RCTX
GenF3.menu.pnum.GENERIC_F378RCTX.build.product_line=STM32F378xx
GenF3.menu.pnum.GENERIC_F378RCTX.build.variant=STM32F3xx/F378RC(T-Y)
GenF3.menu.pnum.GENERIC_F378RCTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F3xx/STM32F3x8.svd

# Generic F378RCYx
GenF3.menu.pnum.GENERIC_F378RCYX=Generic F378RCYx
GenF3.menu.pnum.GENERIC_F378RCYX.upload.maximum_size=262144
GenF3.menu.pnum.GENERIC_F378RCYX.upload.maximum_data_size=32768
GenF3.menu.pnum.GENERIC_F378RCYX.build.board=GENERIC_F378RCYX
GenF3.menu.pnum.GENERIC_F378RCYX.build.product_line=STM32F378xx
GenF3.menu.pnum.GENERIC_F378RCYX.build.variant=STM32F3xx/F378RC(T-Y)
GenF3.menu.pnum.GENERIC_F378RCYX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F3xx/STM32F3x8.svd

# Generic F378VCHx
GenF3.menu.pnum.GENERIC_F378VCHX=Generic F378VCHx
GenF3.menu.pnum.GENERIC_F378VCHX.upload.maximum_size=262144
GenF3.menu.pnum.GENERIC_F378VCHX.upload.maximum_data_size=32768
GenF3.menu.pnum.GENERIC_F378VCHX.build.board=GENERIC_F378VCHX
GenF3.menu.pnum.GENERIC_F378VCHX.build.product_line=STM32F378xx
GenF3.menu.pnum.GENERIC_F378VCHX.build.variant=STM32F3xx/F378VC(H-T)
GenF3.menu.pnum.GENERIC_F378VCHX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F3xx/STM32F3x8.svd

# Generic F378VCTx
GenF3.menu.pnum.GENERIC_F378VCTX=Generic F378VCTx
GenF3.menu.pnum.GENERIC_F378VCTX.upload.maximum_size=262144
GenF3.menu.pnum.GENERIC_F378VCTX.upload.maximum_data_size=32768
GenF3.menu.pnum.GENERIC_F378VCTX.build.board=GENERIC_F378VCTX
GenF3.menu.pnum.GENERIC_F378VCTX.build.product_line=STM32F378xx
GenF3.menu.pnum.GENERIC_F378VCTX.build.variant=STM32F3xx/F378VC(H-T)
GenF3.menu.pnum.GENERIC_F378VCTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F3xx/STM32F3x8.svd

# Generic F398VETx
GenF3.menu.pnum.GENERIC_F398VETX=Generic F398VETx
GenF3.menu.pnum.GENERIC_F398VETX.upload.maximum_size=524288
GenF3.menu.pnum.GENERIC_F398VETX.upload.maximum_data_size=65536
GenF3.menu.pnum.GENERIC_F398VETX.build.board=GENERIC_F398VETX
GenF3.menu.pnum.GENERIC_F398VETX.build.product_line=STM32F398xx
GenF3.menu.pnum.GENERIC_F398VETX.build.variant=STM32F3xx/F398VET
GenF3.menu.pnum.GENERIC_F398VETX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F3xx/STM32F3x8.svd

# Upload menu
GenF3.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenF3.menu.upload_method.swdMethod.upload.protocol=swd
GenF3.menu.upload_method.swdMethod.upload.options=
GenF3.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenF3.menu.upload_method.jlinkMethod=STM32CubeProgrammer (J-Link)
GenF3.menu.upload_method.jlinkMethod.upload.protocol=jlink
GenF3.menu.upload_method.jlinkMethod.upload.options=
GenF3.menu.upload_method.jlinkMethod.upload.tool=stm32CubeProg

GenF3.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenF3.menu.upload_method.serialMethod.upload.protocol=serial
GenF3.menu.upload_method.serialMethod.upload.options=-c {serial.port.file}
GenF3.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenF3.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenF3.menu.upload_method.dfuMethod.upload.protocol=dfu
GenF3.menu.upload_method.dfuMethod.upload.options=-v {upload.vid} -p {upload.pid}
GenF3.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

GenF3.menu.upload_method.bmpMethod=BMP (Black Magic Probe)
GenF3.menu.upload_method.bmpMethod.upload.protocol=gdb_bmp
GenF3.menu.upload_method.bmpMethod.upload.tool=bmp_upload

GenF3.menu.upload_method.OpenOCDSTLink=OpenOCD STLink (SWD)
GenF3.menu.upload_method.OpenOCDSTLink.upload.protocol=stlink
GenF3.menu.upload_method.OpenOCDSTLink.upload.tool=openocd_upload

GenF3.menu.upload_method.OpenOCDDapLink=OpenOCD DapLink (SWD)
GenF3.menu.upload_method.OpenOCDDapLink.upload.protocol=cmsis-dap
GenF3.menu.upload_method.OpenOCDDapLink.upload.tool=openocd_upload

################################################################################
# Generic F4

