stm32duino/Arduino_Core_STM32/boards.txt
# ThunderPack F411xxE
# https://github.com/jgillick/ThunderPack/tree/STM32F4
GenF4.menu.pnum.THUNDERPACK_F411=ThunderPack v1.1+
GenF4.menu.pnum.THUNDERPACK_F411.upload.maximum_size=524288
GenF4.menu.pnum.THUNDERPACK_F411.upload.maximum_data_size=131072
GenF4.menu.pnum.THUNDERPACK_F411.build.board=THUNDERPACK_F411
GenF4.menu.pnum.THUNDERPACK_F411.build.product_line=STM32F411xE
GenF4.menu.pnum.THUNDERPACK_F411.build.variant_h=variant_{build.board}.h
GenF4.menu.pnum.THUNDERPACK_F411.build.variant=STM32F4xx/F411C(C-E)(U-Y)
GenF4.menu.pnum.THUNDERPACK_F411.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
GenF4.menu.pnum.THUNDERPACK_F411.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F4xx/STM32F411.svd

# VCCGND_F407ZGT6 board
GenF4.menu.pnum.VCCGND_F407ZG_MINI=VCCGND F407ZGT6 Mini
GenF4.menu.pnum.VCCGND_F407ZG_MINI.upload.maximum_size=1048576
GenF4.menu.pnum.VCCGND_F407ZG_MINI.upload.maximum_data_size=131072
GenF4.menu.pnum.VCCGND_F407ZG_MINI.build.board=VCCGND_F407ZG_MINI
GenF4.menu.pnum.VCCGND_F407ZG_MINI.build.product_line=STM32F407xx
GenF4.menu.pnum.VCCGND_F407ZG_MINI.build.variant_h=variant_{build.board}.h
GenF4.menu.pnum.VCCGND_F407ZG_MINI.build.variant=STM32F4xx/F407Z(E-G)T_F417Z(E-G)T
GenF4.menu.pnum.VCCGND_F407ZG_MINI.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
GenF4.menu.pnum.VCCGND_F407ZG_MINI.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F4xx/STM32F407.svd

# Generic F401CBUx
GenF4.menu.pnum.GENERIC_F401CBUX=Generic F401CBUx
GenF4.menu.pnum.GENERIC_F401CBUX.upload.maximum_size=131072
GenF4.menu.pnum.GENERIC_F401CBUX.upload.maximum_data_size=65536
GenF4.menu.pnum.GENERIC_F401CBUX.build.board=GENERIC_F401CBUX
GenF4.menu.pnum.GENERIC_F401CBUX.build.product_line=STM32F401xC
GenF4.menu.pnum.GENERIC_F401CBUX.build.variant=STM32F4xx/F401CC(F-U-Y)_F401C(B-D-E)(U-Y)
GenF4.menu.pnum.GENERIC_F401CBUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F4xx/STM32F401.svd

# Generic F401CCUx
GenF4.menu.pnum.GENERIC_F401CCUX=Generic F401CCUx
GenF4.menu.pnum.GENERIC_F401CCUX.upload.maximum_size=262144
GenF4.menu.pnum.GENERIC_F401CCUX.upload.maximum_data_size=65536
GenF4.menu.pnum.GENERIC_F401CCUX.build.board=GENERIC_F401CCUX
GenF4.menu.pnum.GENERIC_F401CCUX.build.product_line=STM32F401xC
GenF4.menu.pnum.GENERIC_F401CCUX.build.variant=STM32F4xx/F401CC(F-U-Y)_F401C(B-D-E)(U-Y)
GenF4.menu.pnum.GENERIC_F401CCUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F4xx/STM32F401.svd

# Generic F401CBYx
GenF4.menu.pnum.GENERIC_F401CBYX=Generic F401CBYx
GenF4.menu.pnum.GENERIC_F401CBYX.upload.maximum_size=131072
GenF4.menu.pnum.GENERIC_F401CBYX.upload.maximum_data_size=65536
GenF4.menu.pnum.GENERIC_F401CBYX.build.board=GENERIC_F401CBYX
GenF4.menu.pnum.GENERIC_F401CBYX.build.product_line=STM32F401xC
GenF4.menu.pnum.GENERIC_F401CBYX.build.variant=STM32F4xx/F401CC(F-U-Y)_F401C(B-D-E)(U-Y)
GenF4.menu.pnum.GENERIC_F401CBYX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F4xx/STM32F401.svd

# Generic F401CCYx
GenF4.menu.pnum.GENERIC_F401CCYX=Generic F401CCYx
GenF4.menu.pnum.GENERIC_F401CCYX.upload.maximum_size=262144
GenF4.menu.pnum.GENERIC_F401CCYX.upload.maximum_data_size=65536
GenF4.menu.pnum.GENERIC_F401CCYX.build.board=GENERIC_F401CCYX
GenF4.menu.pnum.GENERIC_F401CCYX.build.product_line=STM32F401xC
GenF4.menu.pnum.GENERIC_F401CCYX.build.variant=STM32F4xx/F401CC(F-U-Y)_F401C(B-D-E)(U-Y)
GenF4.menu.pnum.GENERIC_F401CCYX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F4xx/STM32F401.svd

# Generic F401CDUx
GenF4.menu.pnum.GENERIC_F401CDUX=Generic F401CDUx
GenF4.menu.pnum.GENERIC_F401CDUX.upload.maximum_size=393216
GenF4.menu.pnum.GENERIC_F401CDUX.upload.maximum_data_size=98304
GenF4.menu.pnum.GENERIC_F401CDUX.build.board=GENERIC_F401CDUX
GenF4.menu.pnum.GENERIC_F401CDUX.build.product_line=STM32F401xE
GenF4.menu.pnum.GENERIC_F401CDUX.build.variant=STM32F4xx/F401CC(F-U-Y)_F401C(B-D-E)(U-Y)
GenF4.menu.pnum.GENERIC_F401CDUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F4xx/STM32F401.svd

# Generic F401CEUx
GenF4.menu.pnum.GENERIC_F401CEUX=Generic F401CEUx
GenF4.menu.pnum.GENERIC_F401CEUX.upload.maximum_size=524288
GenF4.menu.pnum.GENERIC_F401CEUX.upload.maximum_data_size=98304
GenF4.menu.pnum.GENERIC_F401CEUX.build.board=GENERIC_F401CEUX
GenF4.menu.pnum.GENERIC_F401CEUX.build.product_line=STM32F401xE
GenF4.menu.pnum.GENERIC_F401CEUX.build.variant=STM32F4xx/F401CC(F-U-Y)_F401C(B-D-E)(U-Y)
GenF4.menu.pnum.GENERIC_F401CEUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F4xx/STM32F401.svd

# Generic F401CDYx
GenF4.menu.pnum.GENERIC_F401CDYX=Generic F401CDYx
GenF4.menu.pnum.GENERIC_F401CDYX.upload.maximum_size=393216
GenF4.menu.pnum.GENERIC_F401CDYX.upload.maximum_data_size=98304
GenF4.menu.pnum.GENERIC_F401CDYX.build.board=GENERIC_F401CDYX
GenF4.menu.pnum.GENERIC_F401CDYX.build.product_line=STM32F401xE
GenF4.menu.pnum.GENERIC_F401CDYX.build.variant=STM32F4xx/F401CC(F-U-Y)_F401C(B-D-E)(U-Y)
GenF4.menu.pnum.GENERIC_F401CDYX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F4xx/STM32F401.svd

# Generic F401CEYx
GenF4.menu.pnum.GENERIC_F401CEYX=Generic F401CEYx
GenF4.menu.pnum.GENERIC_F401CEYX.upload.maximum_size=524288
GenF4.menu.pnum.GENERIC_F401CEYX.upload.maximum_data_size=98304
GenF4.menu.pnum.GENERIC_F401CEYX.build.board=GENERIC_F401CEYX
GenF4.menu.pnum.GENERIC_F401CEYX.build.product_line=STM32F401xE
GenF4.menu.pnum.GENERIC_F401CEYX.build.variant=STM32F4xx/F401CC(F-U-Y)_F401C(B-D-E)(U-Y)
GenF4.menu.pnum.GENERIC_F401CEYX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F4xx/STM32F401.svd

# Generic F401CCFx
GenF4.menu.pnum.GENERIC_F401CCFX=Generic F401CCFx
GenF4.menu.pnum.GENERIC_F401CCFX.upload.maximum_size=262144
GenF4.menu.pnum.GENERIC_F401CCFX.upload.maximum_data_size=65536
GenF4.menu.pnum.GENERIC_F401CCFX.build.board=GENERIC_F401CCFX
GenF4.menu.pnum.GENERIC_F401CCFX.build.product_line=STM32F401xC
GenF4.menu.pnum.GENERIC_F401CCFX.build.variant=STM32F4xx/F401CC(F-U-Y)_F401C(B-D-E)(U-Y)
GenF4.menu.pnum.GENERIC_F401CCFX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F4xx/STM32F401.svd

# Generic F401RBTx
GenF4.menu.pnum.GENERIC_F401RBTX=Generic F401RBTx
GenF4.menu.pnum.GENERIC_F401RBTX.upload.maximum_size=131072
GenF4.menu.pnum.GENERIC_F401RBTX.upload.maximum_data_size=65536
GenF4.menu.pnum.GENERIC_F401RBTX.build.board=GENERIC_F401RBTX
GenF4.menu.pnum.GENERIC_F401RBTX.build.product_line=STM32F401xC
GenF4.menu.pnum.GENERIC_F401RBTX.build.variant=STM32F4xx/F401R(B-C-D-E)T
GenF4.menu.pnum.GENERIC_F401RBTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F4xx/STM32F401.svd

# Generic F401RCTx
GenF4.menu.pnum.GENERIC_F401RCTX=Generic F401RCTx
GenF4.menu.pnum.GENERIC_F401RCTX.upload.maximum_size=262144
GenF4.menu.pnum.GENERIC_F401RCTX.upload.maximum_data_size=65536
GenF4.menu.pnum.GENERIC_F401RCTX.build.board=GENERIC_F401RCTX
GenF4.menu.pnum.GENERIC_F401RCTX.build.product_line=STM32F401xC
GenF4.menu.pnum.GENERIC_F401RCTX.build.variant=STM32F4xx/F401R(B-C-D-E)T
GenF4.menu.pnum.GENERIC_F401RCTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F4xx/STM32F401.svd

# Generic F401RDTx
GenF4.menu.pnum.GENERIC_F401RDTX=Generic F401RDTx
GenF4.menu.pnum.GENERIC_F401RDTX.upload.maximum_size=393216
GenF4.menu.pnum.GENERIC_F401RDTX.upload.maximum_data_size=98304
GenF4.menu.pnum.GENERIC_F401RDTX.build.board=GENERIC_F401RDTX
GenF4.menu.pnum.GENERIC_F401RDTX.build.product_line=STM32F401xE
GenF4.menu.pnum.GENERIC_F401RDTX.build.variant=STM32F4xx/F401R(B-C-D-E)T
GenF4.menu.pnum.GENERIC_F401RDTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F4xx/STM32F401.svd

