stm32duino/Arduino_Core_STM32/boards.txt
# Generic F401RETx
GenF4.menu.pnum.GENERIC_F401RETX=Generic F401RETx
GenF4.menu.pnum.GENERIC_F401RETX.upload.maximum_size=524288
GenF4.menu.pnum.GENERIC_F401RETX.upload.maximum_data_size=98304
GenF4.menu.pnum.GENERIC_F401RETX.build.board=GENERIC_F401RETX
GenF4.menu.pnum.GENERIC_F401RETX.build.product_line=STM32F401xE
GenF4.menu.pnum.GENERIC_F401RETX.build.variant=STM32F4xx/F401R(B-C-D-E)T
GenF4.menu.pnum.GENERIC_F401RETX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F4xx/STM32F401.svd

# Generic F401VBTx
GenF4.menu.pnum.GENERIC_F401VBTX=Generic F401VBTx
GenF4.menu.pnum.GENERIC_F401VBTX.upload.maximum_size=131072
GenF4.menu.pnum.GENERIC_F401VBTX.upload.maximum_data_size=65536
GenF4.menu.pnum.GENERIC_F401VBTX.build.board=GENERIC_F401VBTX
GenF4.menu.pnum.GENERIC_F401VBTX.build.product_line=STM32F401xC
GenF4.menu.pnum.GENERIC_F401VBTX.build.variant=STM32F4xx/F401V(B-C-D-E)T
GenF4.menu.pnum.GENERIC_F401VBTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F4xx/STM32F401.svd

# Generic F401VCTx
GenF4.menu.pnum.GENERIC_F401VCTX=Generic F401VCTx
GenF4.menu.pnum.GENERIC_F401VCTX.upload.maximum_size=262144
GenF4.menu.pnum.GENERIC_F401VCTX.upload.maximum_data_size=65536
GenF4.menu.pnum.GENERIC_F401VCTX.build.board=GENERIC_F401VCTX
GenF4.menu.pnum.GENERIC_F401VCTX.build.product_line=STM32F401xC
GenF4.menu.pnum.GENERIC_F401VCTX.build.variant=STM32F4xx/F401V(B-C-D-E)T
GenF4.menu.pnum.GENERIC_F401VCTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F4xx/STM32F401.svd

# Generic F401VDTx
GenF4.menu.pnum.GENERIC_F401VDTX=Generic F401VDTx
GenF4.menu.pnum.GENERIC_F401VDTX.upload.maximum_size=393216
GenF4.menu.pnum.GENERIC_F401VDTX.upload.maximum_data_size=98304
GenF4.menu.pnum.GENERIC_F401VDTX.build.board=GENERIC_F401VDTX
GenF4.menu.pnum.GENERIC_F401VDTX.build.product_line=STM32F401xE
GenF4.menu.pnum.GENERIC_F401VDTX.build.variant=STM32F4xx/F401V(B-C-D-E)T
GenF4.menu.pnum.GENERIC_F401VDTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F4xx/STM32F401.svd

# Generic F401VETx
GenF4.menu.pnum.GENERIC_F401VETX=Generic F401VETx
GenF4.menu.pnum.GENERIC_F401VETX.upload.maximum_size=524288
GenF4.menu.pnum.GENERIC_F401VETX.upload.maximum_data_size=98304
GenF4.menu.pnum.GENERIC_F401VETX.build.board=GENERIC_F401VETX
GenF4.menu.pnum.GENERIC_F401VETX.build.product_line=STM32F401xE
GenF4.menu.pnum.GENERIC_F401VETX.build.variant=STM32F4xx/F401V(B-C-D-E)T
GenF4.menu.pnum.GENERIC_F401VETX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F4xx/STM32F401.svd

# Generic F405RGTx
GenF4.menu.pnum.GENERIC_F405RGTX=Generic F405RGTx
GenF4.menu.pnum.GENERIC_F405RGTX.upload.maximum_size=1048576
GenF4.menu.pnum.GENERIC_F405RGTX.upload.maximum_data_size=131072
GenF4.menu.pnum.GENERIC_F405RGTX.build.board=GENERIC_F405RGTX
GenF4.menu.pnum.GENERIC_F405RGTX.build.product_line=STM32F405xx
GenF4.menu.pnum.GENERIC_F405RGTX.build.variant=STM32F4xx/F405RGT_F415RGT
GenF4.menu.pnum.GENERIC_F405RGTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F4xx/STM32F405.svd

# Generic F407IEHx
GenF4.menu.pnum.GENERIC_F407IEHX=Generic F407IEHx
GenF4.menu.pnum.GENERIC_F407IEHX.upload.maximum_size=524288
GenF4.menu.pnum.GENERIC_F407IEHX.upload.maximum_data_size=131072
GenF4.menu.pnum.GENERIC_F407IEHX.build.board=GENERIC_F407IEHX
GenF4.menu.pnum.GENERIC_F407IEHX.build.product_line=STM32F407xx
GenF4.menu.pnum.GENERIC_F407IEHX.build.variant=STM32F4xx/F407I(E-G)(H-T)_F417I(E-G)(H-T)
GenF4.menu.pnum.GENERIC_F407IEHX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F4xx/STM32F407.svd

# Generic F407IETx
GenF4.menu.pnum.GENERIC_F407IETX=Generic F407IETx
GenF4.menu.pnum.GENERIC_F407IETX.upload.maximum_size=524288
GenF4.menu.pnum.GENERIC_F407IETX.upload.maximum_data_size=131072
GenF4.menu.pnum.GENERIC_F407IETX.build.board=GENERIC_F407IETX
GenF4.menu.pnum.GENERIC_F407IETX.build.product_line=STM32F407xx
GenF4.menu.pnum.GENERIC_F407IETX.build.variant=STM32F4xx/F407I(E-G)(H-T)_F417I(E-G)(H-T)
GenF4.menu.pnum.GENERIC_F407IETX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F4xx/STM32F407.svd

# Generic F407IGHx
GenF4.menu.pnum.GENERIC_F407IGHX=Generic F407IGHx
GenF4.menu.pnum.GENERIC_F407IGHX.upload.maximum_size=1048576
GenF4.menu.pnum.GENERIC_F407IGHX.upload.maximum_data_size=131072
GenF4.menu.pnum.GENERIC_F407IGHX.build.board=GENERIC_F407IGHX
GenF4.menu.pnum.GENERIC_F407IGHX.build.product_line=STM32F407xx
GenF4.menu.pnum.GENERIC_F407IGHX.build.variant=STM32F4xx/F407I(E-G)(H-T)_F417I(E-G)(H-T)
GenF4.menu.pnum.GENERIC_F407IGHX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F4xx/STM32F407.svd

# Generic F407IGTx
GenF4.menu.pnum.GENERIC_F407IGTX=Generic F407IGTx
GenF4.menu.pnum.GENERIC_F407IGTX.upload.maximum_size=1048576
GenF4.menu.pnum.GENERIC_F407IGTX.upload.maximum_data_size=131072
GenF4.menu.pnum.GENERIC_F407IGTX.build.board=GENERIC_F407IGTX
GenF4.menu.pnum.GENERIC_F407IGTX.build.product_line=STM32F407xx
GenF4.menu.pnum.GENERIC_F407IGTX.build.variant=STM32F4xx/F407I(E-G)(H-T)_F417I(E-G)(H-T)
GenF4.menu.pnum.GENERIC_F407IGTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F4xx/STM32F407.svd

# Generic F407VETx
GenF4.menu.pnum.GENERIC_F407VETX=Generic F407VETx
GenF4.menu.pnum.GENERIC_F407VETX.upload.maximum_size=524288
GenF4.menu.pnum.GENERIC_F407VETX.upload.maximum_data_size=131072
GenF4.menu.pnum.GENERIC_F407VETX.build.board=GENERIC_F407VETX
GenF4.menu.pnum.GENERIC_F407VETX.build.product_line=STM32F407xx
GenF4.menu.pnum.GENERIC_F407VETX.build.variant=STM32F4xx/F407V(E-G)T_F417V(E-G)T
GenF4.menu.pnum.GENERIC_F407VETX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F4xx/STM32F407.svd

# Generic F407VGTx
GenF4.menu.pnum.GENERIC_F407VGTX=Generic F407VGTx
GenF4.menu.pnum.GENERIC_F407VGTX.upload.maximum_size=1048576
GenF4.menu.pnum.GENERIC_F407VGTX.upload.maximum_data_size=131072
GenF4.menu.pnum.GENERIC_F407VGTX.build.board=GENERIC_F407VGTX
GenF4.menu.pnum.GENERIC_F407VGTX.build.product_line=STM32F407xx
GenF4.menu.pnum.GENERIC_F407VGTX.build.variant=STM32F4xx/F407V(E-G)T_F417V(E-G)T
GenF4.menu.pnum.GENERIC_F407VGTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F4xx/STM32F407.svd

# Generic F407ZETx
GenF4.menu.pnum.GENERIC_F407ZETX=Generic F407ZETx
GenF4.menu.pnum.GENERIC_F407ZETX.upload.maximum_size=524288
GenF4.menu.pnum.GENERIC_F407ZETX.upload.maximum_data_size=131072
GenF4.menu.pnum.GENERIC_F407ZETX.build.board=GENERIC_F407ZETX
GenF4.menu.pnum.GENERIC_F407ZETX.build.product_line=STM32F407xx
GenF4.menu.pnum.GENERIC_F407ZETX.build.variant=STM32F4xx/F407Z(E-G)T_F417Z(E-G)T
GenF4.menu.pnum.GENERIC_F407ZETX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F4xx/STM32F407.svd

# Generic F407ZGTx
GenF4.menu.pnum.GENERIC_F407ZGTX=Generic F407ZGTx
GenF4.menu.pnum.GENERIC_F407ZGTX.upload.maximum_size=1048576
GenF4.menu.pnum.GENERIC_F407ZGTX.upload.maximum_data_size=131072
GenF4.menu.pnum.GENERIC_F407ZGTX.build.board=GENERIC_F407ZGTX
GenF4.menu.pnum.GENERIC_F407ZGTX.build.product_line=STM32F407xx
GenF4.menu.pnum.GENERIC_F407ZGTX.build.variant=STM32F4xx/F407Z(E-G)T_F417Z(E-G)T
GenF4.menu.pnum.GENERIC_F407ZGTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F4xx/STM32F407.svd

