stm32duino/Arduino_Core_STM32/boards.txt
# Generic G051C6Ux
GenG0.menu.pnum.GENERIC_G051C6UX=Generic G051C6Ux
GenG0.menu.pnum.GENERIC_G051C6UX.upload.maximum_size=32768
GenG0.menu.pnum.GENERIC_G051C6UX.upload.maximum_data_size=18432
GenG0.menu.pnum.GENERIC_G051C6UX.build.board=GENERIC_G051C6UX
GenG0.menu.pnum.GENERIC_G051C6UX.build.product_line=STM32G051xx
GenG0.menu.pnum.GENERIC_G051C6UX.build.variant=STM32G0xx/G051C(6-8)(T-U)_G061C(6-8)(T-U)
GenG0.menu.pnum.GENERIC_G051C6UX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G051.svd

# Generic G051C8Ux
GenG0.menu.pnum.GENERIC_G051C8UX=Generic G051C8Ux
GenG0.menu.pnum.GENERIC_G051C8UX.upload.maximum_size=65536
GenG0.menu.pnum.GENERIC_G051C8UX.upload.maximum_data_size=18432
GenG0.menu.pnum.GENERIC_G051C8UX.build.board=GENERIC_G051C8UX
GenG0.menu.pnum.GENERIC_G051C8UX.build.product_line=STM32G051xx
GenG0.menu.pnum.GENERIC_G051C8UX.build.variant=STM32G0xx/G051C(6-8)(T-U)_G061C(6-8)(T-U)
GenG0.menu.pnum.GENERIC_G051C8UX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G051.svd

# Generic G061C6Tx
GenG0.menu.pnum.GENERIC_G061C6TX=Generic G061C6Tx
GenG0.menu.pnum.GENERIC_G061C6TX.upload.maximum_size=32768
GenG0.menu.pnum.GENERIC_G061C6TX.upload.maximum_data_size=18432
GenG0.menu.pnum.GENERIC_G061C6TX.build.board=GENERIC_G061C6TX
GenG0.menu.pnum.GENERIC_G061C6TX.build.product_line=STM32G061xx
GenG0.menu.pnum.GENERIC_G061C6TX.build.variant=STM32G0xx/G051C(6-8)(T-U)_G061C(6-8)(T-U)
GenG0.menu.pnum.GENERIC_G061C6TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G061.svd

# Generic G061C8Tx
GenG0.menu.pnum.GENERIC_G061C8TX=Generic G061C8Tx
GenG0.menu.pnum.GENERIC_G061C8TX.upload.maximum_size=65536
GenG0.menu.pnum.GENERIC_G061C8TX.upload.maximum_data_size=18432
GenG0.menu.pnum.GENERIC_G061C8TX.build.board=GENERIC_G061C8TX
GenG0.menu.pnum.GENERIC_G061C8TX.build.product_line=STM32G061xx
GenG0.menu.pnum.GENERIC_G061C8TX.build.variant=STM32G0xx/G051C(6-8)(T-U)_G061C(6-8)(T-U)
GenG0.menu.pnum.GENERIC_G061C8TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G061.svd

# Generic G061C6Ux
GenG0.menu.pnum.GENERIC_G061C6UX=Generic G061C6Ux
GenG0.menu.pnum.GENERIC_G061C6UX.upload.maximum_size=32768
GenG0.menu.pnum.GENERIC_G061C6UX.upload.maximum_data_size=18432
GenG0.menu.pnum.GENERIC_G061C6UX.build.board=GENERIC_G061C6UX
GenG0.menu.pnum.GENERIC_G061C6UX.build.product_line=STM32G061xx
GenG0.menu.pnum.GENERIC_G061C6UX.build.variant=STM32G0xx/G051C(6-8)(T-U)_G061C(6-8)(T-U)
GenG0.menu.pnum.GENERIC_G061C6UX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G061.svd

# Generic G061C8Ux
GenG0.menu.pnum.GENERIC_G061C8UX=Generic G061C8Ux
GenG0.menu.pnum.GENERIC_G061C8UX.upload.maximum_size=65536
GenG0.menu.pnum.GENERIC_G061C8UX.upload.maximum_data_size=18432
GenG0.menu.pnum.GENERIC_G061C8UX.build.board=GENERIC_G061C8UX
GenG0.menu.pnum.GENERIC_G061C8UX.build.product_line=STM32G061xx
GenG0.menu.pnum.GENERIC_G061C8UX.build.variant=STM32G0xx/G051C(6-8)(T-U)_G061C(6-8)(T-U)
GenG0.menu.pnum.GENERIC_G061C8UX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G061.svd

# Generic G051F6Px
GenG0.menu.pnum.GENERIC_G051F6PX=Generic G051F6Px
GenG0.menu.pnum.GENERIC_G051F6PX.upload.maximum_size=32768
GenG0.menu.pnum.GENERIC_G051F6PX.upload.maximum_data_size=18432
GenG0.menu.pnum.GENERIC_G051F6PX.build.board=GENERIC_G051F6PX
GenG0.menu.pnum.GENERIC_G051F6PX.build.product_line=STM32G051xx
GenG0.menu.pnum.GENERIC_G051F6PX.build.variant=STM32G0xx/G051F6P_G051F8(P-Y)_G061F6P_G061F8(P-Y)
GenG0.menu.pnum.GENERIC_G051F6PX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G051.svd

# Generic G051F8Px
GenG0.menu.pnum.GENERIC_G051F8PX=Generic G051F8Px
GenG0.menu.pnum.GENERIC_G051F8PX.upload.maximum_size=65536
GenG0.menu.pnum.GENERIC_G051F8PX.upload.maximum_data_size=18432
GenG0.menu.pnum.GENERIC_G051F8PX.build.board=GENERIC_G051F8PX
GenG0.menu.pnum.GENERIC_G051F8PX.build.product_line=STM32G051xx
GenG0.menu.pnum.GENERIC_G051F8PX.build.variant=STM32G0xx/G051F6P_G051F8(P-Y)_G061F6P_G061F8(P-Y)
GenG0.menu.pnum.GENERIC_G051F8PX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G051.svd

# Generic G051F8Yx
GenG0.menu.pnum.GENERIC_G051F8YX=Generic G051F8Yx
GenG0.menu.pnum.GENERIC_G051F8YX.upload.maximum_size=65536
GenG0.menu.pnum.GENERIC_G051F8YX.upload.maximum_data_size=18432
GenG0.menu.pnum.GENERIC_G051F8YX.build.board=GENERIC_G051F8YX
GenG0.menu.pnum.GENERIC_G051F8YX.build.product_line=STM32G051xx
GenG0.menu.pnum.GENERIC_G051F8YX.build.variant=STM32G0xx/G051F6P_G051F8(P-Y)_G061F6P_G061F8(P-Y)
GenG0.menu.pnum.GENERIC_G051F8YX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G051.svd

# Generic G061F6Px
GenG0.menu.pnum.GENERIC_G061F6PX=Generic G061F6Px
GenG0.menu.pnum.GENERIC_G061F6PX.upload.maximum_size=32768
GenG0.menu.pnum.GENERIC_G061F6PX.upload.maximum_data_size=18432
GenG0.menu.pnum.GENERIC_G061F6PX.build.board=GENERIC_G061F6PX
GenG0.menu.pnum.GENERIC_G061F6PX.build.product_line=STM32G061xx
GenG0.menu.pnum.GENERIC_G061F6PX.build.variant=STM32G0xx/G051F6P_G051F8(P-Y)_G061F6P_G061F8(P-Y)
GenG0.menu.pnum.GENERIC_G061F6PX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G061.svd

# Generic G061F8Px
GenG0.menu.pnum.GENERIC_G061F8PX=Generic G061F8Px
GenG0.menu.pnum.GENERIC_G061F8PX.upload.maximum_size=65536
GenG0.menu.pnum.GENERIC_G061F8PX.upload.maximum_data_size=18432
GenG0.menu.pnum.GENERIC_G061F8PX.build.board=GENERIC_G061F8PX
GenG0.menu.pnum.GENERIC_G061F8PX.build.product_line=STM32G061xx
GenG0.menu.pnum.GENERIC_G061F8PX.build.variant=STM32G0xx/G051F6P_G051F8(P-Y)_G061F6P_G061F8(P-Y)
GenG0.menu.pnum.GENERIC_G061F8PX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G061.svd

# Generic G061F8Yx
GenG0.menu.pnum.GENERIC_G061F8YX=Generic G061F8Yx
GenG0.menu.pnum.GENERIC_G061F8YX.upload.maximum_size=65536
GenG0.menu.pnum.GENERIC_G061F8YX.upload.maximum_data_size=18432
GenG0.menu.pnum.GENERIC_G061F8YX.build.board=GENERIC_G061F8YX
GenG0.menu.pnum.GENERIC_G061F8YX.build.product_line=STM32G061xx
GenG0.menu.pnum.GENERIC_G061F8YX.build.variant=STM32G0xx/G051F6P_G051F8(P-Y)_G061F6P_G061F8(P-Y)
GenG0.menu.pnum.GENERIC_G061F8YX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G061.svd

# Generic G051G6Ux
GenG0.menu.pnum.GENERIC_G051G6UX=Generic G051G6Ux
GenG0.menu.pnum.GENERIC_G051G6UX.upload.maximum_size=32768
GenG0.menu.pnum.GENERIC_G051G6UX.upload.maximum_data_size=18432
GenG0.menu.pnum.GENERIC_G051G6UX.build.board=GENERIC_G051G6UX
GenG0.menu.pnum.GENERIC_G051G6UX.build.product_line=STM32G051xx
GenG0.menu.pnum.GENERIC_G051G6UX.build.variant=STM32G0xx/G051G(6-8)U_G061G(6-8)U
GenG0.menu.pnum.GENERIC_G051G6UX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G051.svd

# Generic G051G8Ux
GenG0.menu.pnum.GENERIC_G051G8UX=Generic G051G8Ux
GenG0.menu.pnum.GENERIC_G051G8UX.upload.maximum_size=65536
GenG0.menu.pnum.GENERIC_G051G8UX.upload.maximum_data_size=18432
GenG0.menu.pnum.GENERIC_G051G8UX.build.board=GENERIC_G051G8UX
GenG0.menu.pnum.GENERIC_G051G8UX.build.product_line=STM32G051xx
GenG0.menu.pnum.GENERIC_G051G8UX.build.variant=STM32G0xx/G051G(6-8)U_G061G(6-8)U
GenG0.menu.pnum.GENERIC_G051G8UX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G051.svd

# Generic G061G6Ux
GenG0.menu.pnum.GENERIC_G061G6UX=Generic G061G6Ux
GenG0.menu.pnum.GENERIC_G061G6UX.upload.maximum_size=32768
GenG0.menu.pnum.GENERIC_G061G6UX.upload.maximum_data_size=18432
GenG0.menu.pnum.GENERIC_G061G6UX.build.board=GENERIC_G061G6UX
GenG0.menu.pnum.GENERIC_G061G6UX.build.product_line=STM32G061xx
GenG0.menu.pnum.GENERIC_G061G6UX.build.variant=STM32G0xx/G051G(6-8)U_G061G(6-8)U
GenG0.menu.pnum.GENERIC_G061G6UX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G061.svd

# Generic G061G8Ux
GenG0.menu.pnum.GENERIC_G061G8UX=Generic G061G8Ux
GenG0.menu.pnum.GENERIC_G061G8UX.upload.maximum_size=65536
GenG0.menu.pnum.GENERIC_G061G8UX.upload.maximum_data_size=18432
GenG0.menu.pnum.GENERIC_G061G8UX.build.board=GENERIC_G061G8UX
GenG0.menu.pnum.GENERIC_G061G8UX.build.product_line=STM32G061xx
GenG0.menu.pnum.GENERIC_G061G8UX.build.variant=STM32G0xx/G051G(6-8)U_G061G(6-8)U
GenG0.menu.pnum.GENERIC_G061G8UX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G061.svd

# Generic G051K6Tx
GenG0.menu.pnum.GENERIC_G051K6TX=Generic G051K6Tx
GenG0.menu.pnum.GENERIC_G051K6TX.upload.maximum_size=32768
GenG0.menu.pnum.GENERIC_G051K6TX.upload.maximum_data_size=18432
GenG0.menu.pnum.GENERIC_G051K6TX.build.board=GENERIC_G051K6TX
GenG0.menu.pnum.GENERIC_G051K6TX.build.product_line=STM32G051xx
GenG0.menu.pnum.GENERIC_G051K6TX.build.variant=STM32G0xx/G051K(6-8)(T-U)_G061K(6-8)(T-U)
GenG0.menu.pnum.GENERIC_G051K6TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G051.svd

