stm32duino/Arduino_Core_STM32/boards.txt
# Generic G071GBUx
GenG0.menu.pnum.GENERIC_G071GBUX=Generic G071GBUx
GenG0.menu.pnum.GENERIC_G071GBUX.upload.maximum_size=131072
GenG0.menu.pnum.GENERIC_G071GBUX.upload.maximum_data_size=36864
GenG0.menu.pnum.GENERIC_G071GBUX.build.board=GENERIC_G071GBUX
GenG0.menu.pnum.GENERIC_G071GBUX.build.product_line=STM32G071xx
GenG0.menu.pnum.GENERIC_G071GBUX.build.variant=STM32G0xx/G071G(6-8-B)U_G081GBU
GenG0.menu.pnum.GENERIC_G071GBUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G071.svd

# Generic G081GBUx
GenG0.menu.pnum.GENERIC_G081GBUX=Generic G081GBUx
GenG0.menu.pnum.GENERIC_G081GBUX.upload.maximum_size=131072
GenG0.menu.pnum.GENERIC_G081GBUX.upload.maximum_data_size=36864
GenG0.menu.pnum.GENERIC_G081GBUX.build.board=GENERIC_G081GBUX
GenG0.menu.pnum.GENERIC_G081GBUX.build.product_line=STM32G081xx
GenG0.menu.pnum.GENERIC_G081GBUX.build.variant=STM32G0xx/G071G(6-8-B)U_G081GBU
GenG0.menu.pnum.GENERIC_G081GBUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G081.svd

# Generic G070KBTx
GenG0.menu.pnum.GENERIC_G070KBTX=Generic G070KBTx
GenG0.menu.pnum.GENERIC_G070KBTX.upload.maximum_size=131072
GenG0.menu.pnum.GENERIC_G070KBTX.upload.maximum_data_size=36864
GenG0.menu.pnum.GENERIC_G070KBTX.build.board=GENERIC_G070KBTX
GenG0.menu.pnum.GENERIC_G070KBTX.build.product_line=STM32G070xx
GenG0.menu.pnum.GENERIC_G070KBTX.build.variant=STM32G0xx/G070KBT
GenG0.menu.pnum.GENERIC_G070KBTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G070.svd

# Generic G070RBTx
GenG0.menu.pnum.GENERIC_G070RBTX=Generic G070RBTx
GenG0.menu.pnum.GENERIC_G070RBTX.upload.maximum_size=131072
GenG0.menu.pnum.GENERIC_G070RBTX.upload.maximum_data_size=36864
GenG0.menu.pnum.GENERIC_G070RBTX.build.board=GENERIC_G070RBTX
GenG0.menu.pnum.GENERIC_G070RBTX.build.product_line=STM32G070xx
GenG0.menu.pnum.GENERIC_G070RBTX.build.variant=STM32G0xx/G070RBT
GenG0.menu.pnum.GENERIC_G070RBTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G070.svd

# Generic G071C6Tx
GenG0.menu.pnum.GENERIC_G071C6TX=Generic G071C6Tx
GenG0.menu.pnum.GENERIC_G071C6TX.upload.maximum_size=32768
GenG0.menu.pnum.GENERIC_G071C6TX.upload.maximum_data_size=36864
GenG0.menu.pnum.GENERIC_G071C6TX.build.board=GENERIC_G071C6TX
GenG0.menu.pnum.GENERIC_G071C6TX.build.product_line=STM32G071xx
GenG0.menu.pnum.GENERIC_G071C6TX.build.variant=STM32G0xx/G071C(6-8-B)(T-U)_G081CB(T-U)
GenG0.menu.pnum.GENERIC_G071C6TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G071.svd

# Generic G071C8Tx
GenG0.menu.pnum.GENERIC_G071C8TX=Generic G071C8Tx
GenG0.menu.pnum.GENERIC_G071C8TX.upload.maximum_size=65536
GenG0.menu.pnum.GENERIC_G071C8TX.upload.maximum_data_size=36864
GenG0.menu.pnum.GENERIC_G071C8TX.build.board=GENERIC_G071C8TX
GenG0.menu.pnum.GENERIC_G071C8TX.build.product_line=STM32G071xx
GenG0.menu.pnum.GENERIC_G071C8TX.build.variant=STM32G0xx/G071C(6-8-B)(T-U)_G081CB(T-U)
GenG0.menu.pnum.GENERIC_G071C8TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G071.svd

# Generic G071CBTx
GenG0.menu.pnum.GENERIC_G071CBTX=Generic G071CBTx
GenG0.menu.pnum.GENERIC_G071CBTX.upload.maximum_size=131072
GenG0.menu.pnum.GENERIC_G071CBTX.upload.maximum_data_size=36864
GenG0.menu.pnum.GENERIC_G071CBTX.build.board=GENERIC_G071CBTX
GenG0.menu.pnum.GENERIC_G071CBTX.build.product_line=STM32G071xx
GenG0.menu.pnum.GENERIC_G071CBTX.build.variant=STM32G0xx/G071C(6-8-B)(T-U)_G081CB(T-U)
GenG0.menu.pnum.GENERIC_G071CBTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G071.svd

# Generic G071C6Ux
GenG0.menu.pnum.GENERIC_G071C6UX=Generic G071C6Ux
GenG0.menu.pnum.GENERIC_G071C6UX.upload.maximum_size=32768
GenG0.menu.pnum.GENERIC_G071C6UX.upload.maximum_data_size=36864
GenG0.menu.pnum.GENERIC_G071C6UX.build.board=GENERIC_G071C6UX
GenG0.menu.pnum.GENERIC_G071C6UX.build.product_line=STM32G071xx
GenG0.menu.pnum.GENERIC_G071C6UX.build.variant=STM32G0xx/G071C(6-8-B)(T-U)_G081CB(T-U)
GenG0.menu.pnum.GENERIC_G071C6UX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G071.svd

# Generic G071C8Ux
GenG0.menu.pnum.GENERIC_G071C8UX=Generic G071C8Ux
GenG0.menu.pnum.GENERIC_G071C8UX.upload.maximum_size=65536
GenG0.menu.pnum.GENERIC_G071C8UX.upload.maximum_data_size=36864
GenG0.menu.pnum.GENERIC_G071C8UX.build.board=GENERIC_G071C8UX
GenG0.menu.pnum.GENERIC_G071C8UX.build.product_line=STM32G071xx
GenG0.menu.pnum.GENERIC_G071C8UX.build.variant=STM32G0xx/G071C(6-8-B)(T-U)_G081CB(T-U)
GenG0.menu.pnum.GENERIC_G071C8UX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G071.svd

# Generic G071CBUx
GenG0.menu.pnum.GENERIC_G071CBUX=Generic G071CBUx
GenG0.menu.pnum.GENERIC_G071CBUX.upload.maximum_size=131072
GenG0.menu.pnum.GENERIC_G071CBUX.upload.maximum_data_size=36864
GenG0.menu.pnum.GENERIC_G071CBUX.build.board=GENERIC_G071CBUX
GenG0.menu.pnum.GENERIC_G071CBUX.build.product_line=STM32G071xx
GenG0.menu.pnum.GENERIC_G071CBUX.build.variant=STM32G0xx/G071C(6-8-B)(T-U)_G081CB(T-U)
GenG0.menu.pnum.GENERIC_G071CBUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G071.svd

# Generic G071G8UxN
GenG0.menu.pnum.GENERIC_G071G8UXN=Generic G071G8UxN
GenG0.menu.pnum.GENERIC_G071G8UXN.upload.maximum_size=65536
GenG0.menu.pnum.GENERIC_G071G8UXN.upload.maximum_data_size=36864
GenG0.menu.pnum.GENERIC_G071G8UXN.build.board=GENERIC_G071G8UXN
GenG0.menu.pnum.GENERIC_G071G8UXN.build.product_line=STM32G071xx
GenG0.menu.pnum.GENERIC_G071G8UXN.build.variant=STM32G0xx/G071G(8-B)UxN_G081GBUxN
GenG0.menu.pnum.GENERIC_G071G8UXN.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G071.svd

# Generic G071GBUxN
GenG0.menu.pnum.GENERIC_G071GBUXN=Generic G071GBUxN
GenG0.menu.pnum.GENERIC_G071GBUXN.upload.maximum_size=131072
GenG0.menu.pnum.GENERIC_G071GBUXN.upload.maximum_data_size=36864
GenG0.menu.pnum.GENERIC_G071GBUXN.build.board=GENERIC_G071GBUXN
GenG0.menu.pnum.GENERIC_G071GBUXN.build.product_line=STM32G071xx
GenG0.menu.pnum.GENERIC_G071GBUXN.build.variant=STM32G0xx/G071G(8-B)UxN_G081GBUxN
GenG0.menu.pnum.GENERIC_G071GBUXN.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G071.svd

# Generic G071K6Tx
GenG0.menu.pnum.GENERIC_G071K6TX=Generic G071K6Tx
GenG0.menu.pnum.GENERIC_G071K6TX.upload.maximum_size=32768
GenG0.menu.pnum.GENERIC_G071K6TX.upload.maximum_data_size=36864
GenG0.menu.pnum.GENERIC_G071K6TX.build.board=GENERIC_G071K6TX
GenG0.menu.pnum.GENERIC_G071K6TX.build.product_line=STM32G071xx
GenG0.menu.pnum.GENERIC_G071K6TX.build.variant=STM32G0xx/G071K(6-8-B)(T-U)_G081KB(T-U)
GenG0.menu.pnum.GENERIC_G071K6TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G071.svd

# Generic G071K8Tx
GenG0.menu.pnum.GENERIC_G071K8TX=Generic G071K8Tx
GenG0.menu.pnum.GENERIC_G071K8TX.upload.maximum_size=65536
GenG0.menu.pnum.GENERIC_G071K8TX.upload.maximum_data_size=36864
GenG0.menu.pnum.GENERIC_G071K8TX.build.board=GENERIC_G071K8TX
GenG0.menu.pnum.GENERIC_G071K8TX.build.product_line=STM32G071xx
GenG0.menu.pnum.GENERIC_G071K8TX.build.variant=STM32G0xx/G071K(6-8-B)(T-U)_G081KB(T-U)
GenG0.menu.pnum.GENERIC_G071K8TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G071.svd

# Generic G071KBTx
GenG0.menu.pnum.GENERIC_G071KBTX=Generic G071KBTx
GenG0.menu.pnum.GENERIC_G071KBTX.upload.maximum_size=131072
GenG0.menu.pnum.GENERIC_G071KBTX.upload.maximum_data_size=36864
GenG0.menu.pnum.GENERIC_G071KBTX.build.board=GENERIC_G071KBTX
GenG0.menu.pnum.GENERIC_G071KBTX.build.product_line=STM32G071xx
GenG0.menu.pnum.GENERIC_G071KBTX.build.variant=STM32G0xx/G071K(6-8-B)(T-U)_G081KB(T-U)
GenG0.menu.pnum.GENERIC_G071KBTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G071.svd

