stm32duino/Arduino_Core_STM32/boards.txt
# Generic G0B0VETx
GenG0.menu.pnum.GENERIC_G0B0VETX=Generic G0B0VETx
GenG0.menu.pnum.GENERIC_G0B0VETX.upload.maximum_size=524288
GenG0.menu.pnum.GENERIC_G0B0VETX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0B0VETX.build.board=GENERIC_G0B0VETX
GenG0.menu.pnum.GENERIC_G0B0VETX.build.product_line=STM32G0B0xx
GenG0.menu.pnum.GENERIC_G0B0VETX.build.variant=STM32G0xx/G0B0VET
GenG0.menu.pnum.GENERIC_G0B0VETX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G0B0.svd

# Generic G0B1CBTx
GenG0.menu.pnum.GENERIC_G0B1CBTX=Generic G0B1CBTx
GenG0.menu.pnum.GENERIC_G0B1CBTX.upload.maximum_size=131072
GenG0.menu.pnum.GENERIC_G0B1CBTX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0B1CBTX.build.board=GENERIC_G0B1CBTX
GenG0.menu.pnum.GENERIC_G0B1CBTX.build.product_line=STM32G0B1xx
GenG0.menu.pnum.GENERIC_G0B1CBTX.build.variant=STM32G0xx/G0B1C(B-C-E)(T-U)_G0C1C(C-E)(T-U)
GenG0.menu.pnum.GENERIC_G0B1CBTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G0B1.svd

# Generic G0B1CCTx
GenG0.menu.pnum.GENERIC_G0B1CCTX=Generic G0B1CCTx
GenG0.menu.pnum.GENERIC_G0B1CCTX.upload.maximum_size=262144
GenG0.menu.pnum.GENERIC_G0B1CCTX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0B1CCTX.build.board=GENERIC_G0B1CCTX
GenG0.menu.pnum.GENERIC_G0B1CCTX.build.product_line=STM32G0B1xx
GenG0.menu.pnum.GENERIC_G0B1CCTX.build.variant=STM32G0xx/G0B1C(B-C-E)(T-U)_G0C1C(C-E)(T-U)
GenG0.menu.pnum.GENERIC_G0B1CCTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G0B1.svd

# Generic G0B1CETx
GenG0.menu.pnum.GENERIC_G0B1CETX=Generic G0B1CETx
GenG0.menu.pnum.GENERIC_G0B1CETX.upload.maximum_size=524288
GenG0.menu.pnum.GENERIC_G0B1CETX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0B1CETX.build.board=GENERIC_G0B1CETX
GenG0.menu.pnum.GENERIC_G0B1CETX.build.product_line=STM32G0B1xx
GenG0.menu.pnum.GENERIC_G0B1CETX.build.variant=STM32G0xx/G0B1C(B-C-E)(T-U)_G0C1C(C-E)(T-U)
GenG0.menu.pnum.GENERIC_G0B1CETX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G0B1.svd

# Generic G0B1CBUx
GenG0.menu.pnum.GENERIC_G0B1CBUX=Generic G0B1CBUx
GenG0.menu.pnum.GENERIC_G0B1CBUX.upload.maximum_size=131072
GenG0.menu.pnum.GENERIC_G0B1CBUX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0B1CBUX.build.board=GENERIC_G0B1CBUX
GenG0.menu.pnum.GENERIC_G0B1CBUX.build.product_line=STM32G0B1xx
GenG0.menu.pnum.GENERIC_G0B1CBUX.build.variant=STM32G0xx/G0B1C(B-C-E)(T-U)_G0C1C(C-E)(T-U)
GenG0.menu.pnum.GENERIC_G0B1CBUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G0B1.svd

# Generic G0B1CCUx
GenG0.menu.pnum.GENERIC_G0B1CCUX=Generic G0B1CCUx
GenG0.menu.pnum.GENERIC_G0B1CCUX.upload.maximum_size=262144
GenG0.menu.pnum.GENERIC_G0B1CCUX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0B1CCUX.build.board=GENERIC_G0B1CCUX
GenG0.menu.pnum.GENERIC_G0B1CCUX.build.product_line=STM32G0B1xx
GenG0.menu.pnum.GENERIC_G0B1CCUX.build.variant=STM32G0xx/G0B1C(B-C-E)(T-U)_G0C1C(C-E)(T-U)
GenG0.menu.pnum.GENERIC_G0B1CCUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G0B1.svd

# Generic G0B1CEUx
GenG0.menu.pnum.GENERIC_G0B1CEUX=Generic G0B1CEUx
GenG0.menu.pnum.GENERIC_G0B1CEUX.upload.maximum_size=524288
GenG0.menu.pnum.GENERIC_G0B1CEUX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0B1CEUX.build.board=GENERIC_G0B1CEUX
GenG0.menu.pnum.GENERIC_G0B1CEUX.build.product_line=STM32G0B1xx
GenG0.menu.pnum.GENERIC_G0B1CEUX.build.variant=STM32G0xx/G0B1C(B-C-E)(T-U)_G0C1C(C-E)(T-U)
GenG0.menu.pnum.GENERIC_G0B1CEUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G0B1.svd

# Generic G0B1KBTx
GenG0.menu.pnum.GENERIC_G0B1KBTX=Generic G0B1KBTx
GenG0.menu.pnum.GENERIC_G0B1KBTX.upload.maximum_size=131072
GenG0.menu.pnum.GENERIC_G0B1KBTX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0B1KBTX.build.board=GENERIC_G0B1KBTX
GenG0.menu.pnum.GENERIC_G0B1KBTX.build.product_line=STM32G0B1xx
GenG0.menu.pnum.GENERIC_G0B1KBTX.build.variant=STM32G0xx/G0B1K(B-C-E)(T-U)_G0C1K(C-E)(T-U)
GenG0.menu.pnum.GENERIC_G0B1KBTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G0B1.svd

# Generic G0B1KCTx
GenG0.menu.pnum.GENERIC_G0B1KCTX=Generic G0B1KCTx
GenG0.menu.pnum.GENERIC_G0B1KCTX.upload.maximum_size=262144
GenG0.menu.pnum.GENERIC_G0B1KCTX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0B1KCTX.build.board=GENERIC_G0B1KCTX
GenG0.menu.pnum.GENERIC_G0B1KCTX.build.product_line=STM32G0B1xx
GenG0.menu.pnum.GENERIC_G0B1KCTX.build.variant=STM32G0xx/G0B1K(B-C-E)(T-U)_G0C1K(C-E)(T-U)
GenG0.menu.pnum.GENERIC_G0B1KCTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G0B1.svd

# Generic G0B1KETx
GenG0.menu.pnum.GENERIC_G0B1KETX=Generic G0B1KETx
GenG0.menu.pnum.GENERIC_G0B1KETX.upload.maximum_size=524288
GenG0.menu.pnum.GENERIC_G0B1KETX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0B1KETX.build.board=GENERIC_G0B1KETX
GenG0.menu.pnum.GENERIC_G0B1KETX.build.product_line=STM32G0B1xx
GenG0.menu.pnum.GENERIC_G0B1KETX.build.variant=STM32G0xx/G0B1K(B-C-E)(T-U)_G0C1K(C-E)(T-U)
GenG0.menu.pnum.GENERIC_G0B1KETX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G0B1.svd

# Generic G0B1KBUx
GenG0.menu.pnum.GENERIC_G0B1KBUX=Generic G0B1KBUx
GenG0.menu.pnum.GENERIC_G0B1KBUX.upload.maximum_size=131072
GenG0.menu.pnum.GENERIC_G0B1KBUX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0B1KBUX.build.board=GENERIC_G0B1KBUX
GenG0.menu.pnum.GENERIC_G0B1KBUX.build.product_line=STM32G0B1xx
GenG0.menu.pnum.GENERIC_G0B1KBUX.build.variant=STM32G0xx/G0B1K(B-C-E)(T-U)_G0C1K(C-E)(T-U)
GenG0.menu.pnum.GENERIC_G0B1KBUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G0B1.svd

# Generic G0B1KCUx
GenG0.menu.pnum.GENERIC_G0B1KCUX=Generic G0B1KCUx
GenG0.menu.pnum.GENERIC_G0B1KCUX.upload.maximum_size=262144
GenG0.menu.pnum.GENERIC_G0B1KCUX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0B1KCUX.build.board=GENERIC_G0B1KCUX
GenG0.menu.pnum.GENERIC_G0B1KCUX.build.product_line=STM32G0B1xx
GenG0.menu.pnum.GENERIC_G0B1KCUX.build.variant=STM32G0xx/G0B1K(B-C-E)(T-U)_G0C1K(C-E)(T-U)
GenG0.menu.pnum.GENERIC_G0B1KCUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G0B1.svd

# Generic G0B1KEUx
GenG0.menu.pnum.GENERIC_G0B1KEUX=Generic G0B1KEUx
GenG0.menu.pnum.GENERIC_G0B1KEUX.upload.maximum_size=524288
GenG0.menu.pnum.GENERIC_G0B1KEUX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0B1KEUX.build.board=GENERIC_G0B1KEUX
GenG0.menu.pnum.GENERIC_G0B1KEUX.build.product_line=STM32G0B1xx
GenG0.menu.pnum.GENERIC_G0B1KEUX.build.variant=STM32G0xx/G0B1K(B-C-E)(T-U)_G0C1K(C-E)(T-U)
GenG0.menu.pnum.GENERIC_G0B1KEUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G0B1.svd

# Generic G0C1KCTx
GenG0.menu.pnum.GENERIC_G0C1KCTX=Generic G0C1KCTx
GenG0.menu.pnum.GENERIC_G0C1KCTX.upload.maximum_size=262144
GenG0.menu.pnum.GENERIC_G0C1KCTX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0C1KCTX.build.board=GENERIC_G0C1KCTX
GenG0.menu.pnum.GENERIC_G0C1KCTX.build.product_line=STM32G0C1xx
GenG0.menu.pnum.GENERIC_G0C1KCTX.build.variant=STM32G0xx/G0B1K(B-C-E)(T-U)_G0C1K(C-E)(T-U)
GenG0.menu.pnum.GENERIC_G0C1KCTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G0C1.svd

# Generic G0C1KETx
GenG0.menu.pnum.GENERIC_G0C1KETX=Generic G0C1KETx
GenG0.menu.pnum.GENERIC_G0C1KETX.upload.maximum_size=524288
GenG0.menu.pnum.GENERIC_G0C1KETX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0C1KETX.build.board=GENERIC_G0C1KETX
GenG0.menu.pnum.GENERIC_G0C1KETX.build.product_line=STM32G0C1xx
GenG0.menu.pnum.GENERIC_G0C1KETX.build.variant=STM32G0xx/G0B1K(B-C-E)(T-U)_G0C1K(C-E)(T-U)
GenG0.menu.pnum.GENERIC_G0C1KETX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G0C1.svd

