stm32duino/Arduino_Core_STM32/boards.txt
# Generic G0B1VEIx
GenG0.menu.pnum.GENERIC_G0B1VEIX=Generic G0B1VEIx
GenG0.menu.pnum.GENERIC_G0B1VEIX.upload.maximum_size=524288
GenG0.menu.pnum.GENERIC_G0B1VEIX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0B1VEIX.build.board=GENERIC_G0B1VEIX
GenG0.menu.pnum.GENERIC_G0B1VEIX.build.product_line=STM32G0B1xx
GenG0.menu.pnum.GENERIC_G0B1VEIX.build.variant=STM32G0xx/G0B1V(B-C-E)(I-T)_G0C1V(C-E)(I-T)
GenG0.menu.pnum.GENERIC_G0B1VEIX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G0B1.svd

# Generic G0B1VBTx
GenG0.menu.pnum.GENERIC_G0B1VBTX=Generic G0B1VBTx
GenG0.menu.pnum.GENERIC_G0B1VBTX.upload.maximum_size=131072
GenG0.menu.pnum.GENERIC_G0B1VBTX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0B1VBTX.build.board=GENERIC_G0B1VBTX
GenG0.menu.pnum.GENERIC_G0B1VBTX.build.product_line=STM32G0B1xx
GenG0.menu.pnum.GENERIC_G0B1VBTX.build.variant=STM32G0xx/G0B1V(B-C-E)(I-T)_G0C1V(C-E)(I-T)
GenG0.menu.pnum.GENERIC_G0B1VBTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G0B1.svd

# Generic G0B1VCTx
GenG0.menu.pnum.GENERIC_G0B1VCTX=Generic G0B1VCTx
GenG0.menu.pnum.GENERIC_G0B1VCTX.upload.maximum_size=262144
GenG0.menu.pnum.GENERIC_G0B1VCTX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0B1VCTX.build.board=GENERIC_G0B1VCTX
GenG0.menu.pnum.GENERIC_G0B1VCTX.build.product_line=STM32G0B1xx
GenG0.menu.pnum.GENERIC_G0B1VCTX.build.variant=STM32G0xx/G0B1V(B-C-E)(I-T)_G0C1V(C-E)(I-T)
GenG0.menu.pnum.GENERIC_G0B1VCTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G0B1.svd

# Generic G0B1VETx
GenG0.menu.pnum.GENERIC_G0B1VETX=Generic G0B1VETx
GenG0.menu.pnum.GENERIC_G0B1VETX.upload.maximum_size=524288
GenG0.menu.pnum.GENERIC_G0B1VETX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0B1VETX.build.board=GENERIC_G0B1VETX
GenG0.menu.pnum.GENERIC_G0B1VETX.build.product_line=STM32G0B1xx
GenG0.menu.pnum.GENERIC_G0B1VETX.build.variant=STM32G0xx/G0B1V(B-C-E)(I-T)_G0C1V(C-E)(I-T)
GenG0.menu.pnum.GENERIC_G0B1VETX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G0B1.svd

# Generic G0C1VCIx
GenG0.menu.pnum.GENERIC_G0C1VCIX=Generic G0C1VCIx
GenG0.menu.pnum.GENERIC_G0C1VCIX.upload.maximum_size=262144
GenG0.menu.pnum.GENERIC_G0C1VCIX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0C1VCIX.build.board=GENERIC_G0C1VCIX
GenG0.menu.pnum.GENERIC_G0C1VCIX.build.product_line=STM32G0C1xx
GenG0.menu.pnum.GENERIC_G0C1VCIX.build.variant=STM32G0xx/G0B1V(B-C-E)(I-T)_G0C1V(C-E)(I-T)
GenG0.menu.pnum.GENERIC_G0C1VCIX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G0C1.svd

# Generic G0C1VEIx
GenG0.menu.pnum.GENERIC_G0C1VEIX=Generic G0C1VEIx
GenG0.menu.pnum.GENERIC_G0C1VEIX.upload.maximum_size=524288
GenG0.menu.pnum.GENERIC_G0C1VEIX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0C1VEIX.build.board=GENERIC_G0C1VEIX
GenG0.menu.pnum.GENERIC_G0C1VEIX.build.product_line=STM32G0C1xx
GenG0.menu.pnum.GENERIC_G0C1VEIX.build.variant=STM32G0xx/G0B1V(B-C-E)(I-T)_G0C1V(C-E)(I-T)
GenG0.menu.pnum.GENERIC_G0C1VEIX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G0C1.svd

# Generic G0C1VCTx
GenG0.menu.pnum.GENERIC_G0C1VCTX=Generic G0C1VCTx
GenG0.menu.pnum.GENERIC_G0C1VCTX.upload.maximum_size=262144
GenG0.menu.pnum.GENERIC_G0C1VCTX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0C1VCTX.build.board=GENERIC_G0C1VCTX
GenG0.menu.pnum.GENERIC_G0C1VCTX.build.product_line=STM32G0C1xx
GenG0.menu.pnum.GENERIC_G0C1VCTX.build.variant=STM32G0xx/G0B1V(B-C-E)(I-T)_G0C1V(C-E)(I-T)
GenG0.menu.pnum.GENERIC_G0C1VCTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G0C1.svd

# Generic G0C1VETx
GenG0.menu.pnum.GENERIC_G0C1VETX=Generic G0C1VETx
GenG0.menu.pnum.GENERIC_G0C1VETX.upload.maximum_size=524288
GenG0.menu.pnum.GENERIC_G0C1VETX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0C1VETX.build.board=GENERIC_G0C1VETX
GenG0.menu.pnum.GENERIC_G0C1VETX.build.product_line=STM32G0C1xx
GenG0.menu.pnum.GENERIC_G0C1VETX.build.variant=STM32G0xx/G0B1V(B-C-E)(I-T)_G0C1V(C-E)(I-T)
GenG0.menu.pnum.GENERIC_G0C1VETX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G0C1.svd

# Generic G0C1CCTx
GenG0.menu.pnum.GENERIC_G0C1CCTX=Generic G0C1CCTx
GenG0.menu.pnum.GENERIC_G0C1CCTX.upload.maximum_size=262144
GenG0.menu.pnum.GENERIC_G0C1CCTX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0C1CCTX.build.board=GENERIC_G0C1CCTX
GenG0.menu.pnum.GENERIC_G0C1CCTX.build.product_line=STM32G0C1xx
GenG0.menu.pnum.GENERIC_G0C1CCTX.build.variant=STM32G0xx/G0B1C(B-C-E)(T-U)_G0C1C(C-E)(T-U)
GenG0.menu.pnum.GENERIC_G0C1CCTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G0C1.svd

# Generic G0C1CETx
GenG0.menu.pnum.GENERIC_G0C1CETX=Generic G0C1CETx
GenG0.menu.pnum.GENERIC_G0C1CETX.upload.maximum_size=524288
GenG0.menu.pnum.GENERIC_G0C1CETX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0C1CETX.build.board=GENERIC_G0C1CETX
GenG0.menu.pnum.GENERIC_G0C1CETX.build.product_line=STM32G0C1xx
GenG0.menu.pnum.GENERIC_G0C1CETX.build.variant=STM32G0xx/G0B1C(B-C-E)(T-U)_G0C1C(C-E)(T-U)
GenG0.menu.pnum.GENERIC_G0C1CETX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G0C1.svd

# Generic G0C1CCUx
GenG0.menu.pnum.GENERIC_G0C1CCUX=Generic G0C1CCUx
GenG0.menu.pnum.GENERIC_G0C1CCUX.upload.maximum_size=262144
GenG0.menu.pnum.GENERIC_G0C1CCUX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0C1CCUX.build.board=GENERIC_G0C1CCUX
GenG0.menu.pnum.GENERIC_G0C1CCUX.build.product_line=STM32G0C1xx
GenG0.menu.pnum.GENERIC_G0C1CCUX.build.variant=STM32G0xx/G0B1C(B-C-E)(T-U)_G0C1C(C-E)(T-U)
GenG0.menu.pnum.GENERIC_G0C1CCUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G0C1.svd

# Generic G0C1CEUx
GenG0.menu.pnum.GENERIC_G0C1CEUX=Generic G0C1CEUx
GenG0.menu.pnum.GENERIC_G0C1CEUX.upload.maximum_size=524288
GenG0.menu.pnum.GENERIC_G0C1CEUX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0C1CEUX.build.board=GENERIC_G0C1CEUX
GenG0.menu.pnum.GENERIC_G0C1CEUX.build.product_line=STM32G0C1xx
GenG0.menu.pnum.GENERIC_G0C1CEUX.build.variant=STM32G0xx/G0B1C(B-C-E)(T-U)_G0C1C(C-E)(T-U)
GenG0.menu.pnum.GENERIC_G0C1CEUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G0C1.svd

