stm32duino/Arduino_Core_STM32/boards.txt
# Generic G0C1RCTx
GenG0.menu.pnum.GENERIC_G0C1RCTX=Generic G0C1RCTx
GenG0.menu.pnum.GENERIC_G0C1RCTX.upload.maximum_size=262144
GenG0.menu.pnum.GENERIC_G0C1RCTX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0C1RCTX.build.board=GENERIC_G0C1RCTX
GenG0.menu.pnum.GENERIC_G0C1RCTX.build.product_line=STM32G0C1xx
GenG0.menu.pnum.GENERIC_G0C1RCTX.build.variant=STM32G0xx/G0B1R(B-C-E)T_G0C1R(C-E)T
GenG0.menu.pnum.GENERIC_G0C1RCTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G0C1.svd

# Generic G0C1RETx
GenG0.menu.pnum.GENERIC_G0C1RETX=Generic G0C1RETx
GenG0.menu.pnum.GENERIC_G0C1RETX.upload.maximum_size=524288
GenG0.menu.pnum.GENERIC_G0C1RETX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0C1RETX.build.board=GENERIC_G0C1RETX
GenG0.menu.pnum.GENERIC_G0C1RETX.build.product_line=STM32G0C1xx
GenG0.menu.pnum.GENERIC_G0C1RETX.build.variant=STM32G0xx/G0B1R(B-C-E)T_G0C1R(C-E)T
GenG0.menu.pnum.GENERIC_G0C1RETX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G0C1.svd

# Upload menu
GenG0.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenG0.menu.upload_method.swdMethod.upload.protocol=swd
GenG0.menu.upload_method.swdMethod.upload.options=
GenG0.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenG0.menu.upload_method.jlinkMethod=STM32CubeProgrammer (J-Link)
GenG0.menu.upload_method.jlinkMethod.upload.protocol=jlink
GenG0.menu.upload_method.jlinkMethod.upload.options=
GenG0.menu.upload_method.jlinkMethod.upload.tool=stm32CubeProg

GenG0.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenG0.menu.upload_method.serialMethod.upload.protocol=serial
GenG0.menu.upload_method.serialMethod.upload.options=-c {serial.port.file}
GenG0.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenG0.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenG0.menu.upload_method.dfuMethod.upload.protocol=dfu
GenG0.menu.upload_method.dfuMethod.upload.options=-v {upload.vid} -p {upload.pid}
GenG0.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

GenG0.menu.upload_method.bmpMethod=BMP (Black Magic Probe)
GenG0.menu.upload_method.bmpMethod.upload.protocol=gdb_bmp
GenG0.menu.upload_method.bmpMethod.upload.tool=bmp_upload

GenG0.menu.upload_method.OpenOCDSTLink=OpenOCD STLink (SWD)
GenG0.menu.upload_method.OpenOCDSTLink.upload.protocol=stlink
GenG0.menu.upload_method.OpenOCDSTLink.upload.tool=openocd_upload

GenG0.menu.upload_method.OpenOCDDapLink=OpenOCD DapLink (SWD)
GenG0.menu.upload_method.OpenOCDDapLink.upload.protocol=cmsis-dap
GenG0.menu.upload_method.OpenOCDDapLink.upload.tool=openocd_upload

###############################
# Generic G4
GenG4.name=Generic STM32G4 series

GenG4.build.core=arduino
GenG4.build.board=GenG4
GenG4.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
GenG4.build.mcu=cortex-m4
GenG4.build.fpu=-mfpu=fpv4-sp-d16
GenG4.build.float-abi=-mfloat-abi=hard
GenG4.build.series=STM32G4xx
GenG4.build.flash_offset=0x0
GenG4.upload.maximum_size=0
GenG4.upload.maximum_data_size=0
GenG4.openocd.target=stm32g4x
GenG4.vid.0=0x0483
GenG4.pid.0=0x5740

# WEACT_G474CE board
GenG4.menu.pnum.WEACT_G474CE=WeAct G474CE
GenG4.menu.pnum.WEACT_G474CE.upload.maximum_size=524288
GenG4.menu.pnum.WEACT_G474CE.upload.maximum_data_size=131072
GenG4.menu.pnum.WEACT_G474CE.build.board=WEACT_G474CE
GenG4.menu.pnum.WEACT_G474CE.build.product_line=STM32G474xx
GenG4.menu.pnum.WEACT_G474CE.build.variant=STM32G4xx/G473C(B-C-E)U_G474C(B-C-E)U_G483CEU_G484CEU
GenG4.menu.pnum.WEACT_G474CE.build.variant_h=variant_{build.board}.h
GenG4.menu.pnum.WEACT_G474CE.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G474.svd

# Generic G431C6Tx
GenG4.menu.pnum.GENERIC_G431C6TX=Generic G431C6Tx
GenG4.menu.pnum.GENERIC_G431C6TX.upload.maximum_size=32768
GenG4.menu.pnum.GENERIC_G431C6TX.upload.maximum_data_size=32768
GenG4.menu.pnum.GENERIC_G431C6TX.build.board=GENERIC_G431C6TX
GenG4.menu.pnum.GENERIC_G431C6TX.build.product_line=STM32G431xx
GenG4.menu.pnum.GENERIC_G431C6TX.build.variant=STM32G4xx/G431C(6-8-B)T_G441CBT
GenG4.menu.pnum.GENERIC_G431C6TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G431.svd

# Generic G431C8Tx
GenG4.menu.pnum.GENERIC_G431C8TX=Generic G431C8Tx
GenG4.menu.pnum.GENERIC_G431C8TX.upload.maximum_size=65536
GenG4.menu.pnum.GENERIC_G431C8TX.upload.maximum_data_size=32768
GenG4.menu.pnum.GENERIC_G431C8TX.build.board=GENERIC_G431C8TX
GenG4.menu.pnum.GENERIC_G431C8TX.build.product_line=STM32G431xx
GenG4.menu.pnum.GENERIC_G431C8TX.build.variant=STM32G4xx/G431C(6-8-B)T_G441CBT
GenG4.menu.pnum.GENERIC_G431C8TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G431.svd

# Generic G431CBTx
GenG4.menu.pnum.GENERIC_G431CBTX=Generic G431CBTx
GenG4.menu.pnum.GENERIC_G431CBTX.upload.maximum_size=131072
GenG4.menu.pnum.GENERIC_G431CBTX.upload.maximum_data_size=32768
GenG4.menu.pnum.GENERIC_G431CBTX.build.board=GENERIC_G431CBTX
GenG4.menu.pnum.GENERIC_G431CBTX.build.product_line=STM32G431xx
GenG4.menu.pnum.GENERIC_G431CBTX.build.variant=STM32G4xx/G431C(6-8-B)T_G441CBT
GenG4.menu.pnum.GENERIC_G431CBTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G431.svd

# Generic G431C6Ux
GenG4.menu.pnum.GENERIC_G431C6UX=Generic G431C6Ux
GenG4.menu.pnum.GENERIC_G431C6UX.upload.maximum_size=32768
GenG4.menu.pnum.GENERIC_G431C6UX.upload.maximum_data_size=32768
GenG4.menu.pnum.GENERIC_G431C6UX.build.board=GENERIC_G431C6UX
GenG4.menu.pnum.GENERIC_G431C6UX.build.product_line=STM32G431xx
GenG4.menu.pnum.GENERIC_G431C6UX.build.variant=STM32G4xx/G431C(6-8-B)U_G441CBU
GenG4.menu.pnum.GENERIC_G431C6UX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G431.svd

# Generic G431C8Ux
GenG4.menu.pnum.GENERIC_G431C8UX=Generic G431C8Ux
GenG4.menu.pnum.GENERIC_G431C8UX.upload.maximum_size=65536
GenG4.menu.pnum.GENERIC_G431C8UX.upload.maximum_data_size=32768
GenG4.menu.pnum.GENERIC_G431C8UX.build.board=GENERIC_G431C8UX
GenG4.menu.pnum.GENERIC_G431C8UX.build.product_line=STM32G431xx
GenG4.menu.pnum.GENERIC_G431C8UX.build.variant=STM32G4xx/G431C(6-8-B)U_G441CBU
GenG4.menu.pnum.GENERIC_G431C8UX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G431.svd

# Generic G431CBUx
GenG4.menu.pnum.GENERIC_G431CBUX=Generic G431CBUx
GenG4.menu.pnum.GENERIC_G431CBUX.upload.maximum_size=131072
GenG4.menu.pnum.GENERIC_G431CBUX.upload.maximum_data_size=32768
GenG4.menu.pnum.GENERIC_G431CBUX.build.board=GENERIC_G431CBUX
GenG4.menu.pnum.GENERIC_G431CBUX.build.product_line=STM32G431xx
GenG4.menu.pnum.GENERIC_G431CBUX.build.variant=STM32G4xx/G431C(6-8-B)U_G441CBU
GenG4.menu.pnum.GENERIC_G431CBUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G431.svd

