stm32duino/Arduino_Core_STM32/boards.txt
# Generic G431V8Tx
GenG4.menu.pnum.GENERIC_G431V8TX=Generic G431V8Tx
GenG4.menu.pnum.GENERIC_G431V8TX.upload.maximum_size=65536
GenG4.menu.pnum.GENERIC_G431V8TX.upload.maximum_data_size=32768
GenG4.menu.pnum.GENERIC_G431V8TX.build.board=GENERIC_G431V8TX
GenG4.menu.pnum.GENERIC_G431V8TX.build.product_line=STM32G431xx
GenG4.menu.pnum.GENERIC_G431V8TX.build.variant=STM32G4xx/G431V(6-8-B)T_G441VBT
GenG4.menu.pnum.GENERIC_G431V8TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G431.svd

# Generic G431VBTx
GenG4.menu.pnum.GENERIC_G431VBTX=Generic G431VBTx
GenG4.menu.pnum.GENERIC_G431VBTX.upload.maximum_size=131072
GenG4.menu.pnum.GENERIC_G431VBTX.upload.maximum_data_size=32768
GenG4.menu.pnum.GENERIC_G431VBTX.build.board=GENERIC_G431VBTX
GenG4.menu.pnum.GENERIC_G431VBTX.build.product_line=STM32G431xx
GenG4.menu.pnum.GENERIC_G431VBTX.build.variant=STM32G4xx/G431V(6-8-B)T_G441VBT
GenG4.menu.pnum.GENERIC_G431VBTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G431.svd

# Generic G441CBTx
GenG4.menu.pnum.GENERIC_G441CBTX=Generic G441CBTx
GenG4.menu.pnum.GENERIC_G441CBTX.upload.maximum_size=131072
GenG4.menu.pnum.GENERIC_G441CBTX.upload.maximum_data_size=32768
GenG4.menu.pnum.GENERIC_G441CBTX.build.board=GENERIC_G441CBTX
GenG4.menu.pnum.GENERIC_G441CBTX.build.product_line=STM32G441xx
GenG4.menu.pnum.GENERIC_G441CBTX.build.variant=STM32G4xx/G431C(6-8-B)T_G441CBT
GenG4.menu.pnum.GENERIC_G441CBTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G441.svd

# Generic G441CBUx
GenG4.menu.pnum.GENERIC_G441CBUX=Generic G441CBUx
GenG4.menu.pnum.GENERIC_G441CBUX.upload.maximum_size=131072
GenG4.menu.pnum.GENERIC_G441CBUX.upload.maximum_data_size=32768
GenG4.menu.pnum.GENERIC_G441CBUX.build.board=GENERIC_G441CBUX
GenG4.menu.pnum.GENERIC_G441CBUX.build.product_line=STM32G441xx
GenG4.menu.pnum.GENERIC_G441CBUX.build.variant=STM32G4xx/G431C(6-8-B)U_G441CBU
GenG4.menu.pnum.GENERIC_G441CBUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G441.svd

# Generic G441MBTx
GenG4.menu.pnum.GENERIC_G441MBTX=Generic G441MBTx
GenG4.menu.pnum.GENERIC_G441MBTX.upload.maximum_size=131072
GenG4.menu.pnum.GENERIC_G441MBTX.upload.maximum_data_size=32768
GenG4.menu.pnum.GENERIC_G441MBTX.build.board=GENERIC_G441MBTX
GenG4.menu.pnum.GENERIC_G441MBTX.build.product_line=STM32G441xx
GenG4.menu.pnum.GENERIC_G441MBTX.build.variant=STM32G4xx/G431M(6-8-B)T_G441MBT
GenG4.menu.pnum.GENERIC_G441MBTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G441.svd

# Generic G441KBTx
GenG4.menu.pnum.GENERIC_G441KBTX=Generic G441KBTx
GenG4.menu.pnum.GENERIC_G441KBTX.upload.maximum_size=131072
GenG4.menu.pnum.GENERIC_G441KBTX.upload.maximum_data_size=32768
GenG4.menu.pnum.GENERIC_G441KBTX.build.board=GENERIC_G441KBTX
GenG4.menu.pnum.GENERIC_G441KBTX.build.product_line=STM32G441xx
GenG4.menu.pnum.GENERIC_G441KBTX.build.variant=STM32G4xx/G431K(6-8-B)(T-U)_G441KB(T-U)
GenG4.menu.pnum.GENERIC_G441KBTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G441.svd

# Generic G441KBUx
GenG4.menu.pnum.GENERIC_G441KBUX=Generic G441KBUx
GenG4.menu.pnum.GENERIC_G441KBUX.upload.maximum_size=131072
GenG4.menu.pnum.GENERIC_G441KBUX.upload.maximum_data_size=32768
GenG4.menu.pnum.GENERIC_G441KBUX.build.board=GENERIC_G441KBUX
GenG4.menu.pnum.GENERIC_G441KBUX.build.product_line=STM32G441xx
GenG4.menu.pnum.GENERIC_G441KBUX.build.variant=STM32G4xx/G431K(6-8-B)(T-U)_G441KB(T-U)
GenG4.menu.pnum.GENERIC_G441KBUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G441.svd

# Generic G441RBIx
GenG4.menu.pnum.GENERIC_G441RBIX=Generic G441RBIx
GenG4.menu.pnum.GENERIC_G441RBIX.upload.maximum_size=131072
GenG4.menu.pnum.GENERIC_G441RBIX.upload.maximum_data_size=32768
GenG4.menu.pnum.GENERIC_G441RBIX.build.board=GENERIC_G441RBIX
GenG4.menu.pnum.GENERIC_G441RBIX.build.product_line=STM32G441xx
GenG4.menu.pnum.GENERIC_G441RBIX.build.variant=STM32G4xx/G431R(6-8)(I-T)_G431RB(I-T)x(Z)_G441RB(I-T)
GenG4.menu.pnum.GENERIC_G441RBIX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G441.svd

# Generic G441RBTx
GenG4.menu.pnum.GENERIC_G441RBTX=Generic G441RBTx
GenG4.menu.pnum.GENERIC_G441RBTX.upload.maximum_size=131072
GenG4.menu.pnum.GENERIC_G441RBTX.upload.maximum_data_size=32768
GenG4.menu.pnum.GENERIC_G441RBTX.build.board=GENERIC_G441RBTX
GenG4.menu.pnum.GENERIC_G441RBTX.build.product_line=STM32G441xx
GenG4.menu.pnum.GENERIC_G441RBTX.build.variant=STM32G4xx/G431R(6-8)(I-T)_G431RB(I-T)x(Z)_G441RB(I-T)
GenG4.menu.pnum.GENERIC_G441RBTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G441.svd

# Generic G441VBTx
GenG4.menu.pnum.GENERIC_G441VBTX=Generic G441VBTx
GenG4.menu.pnum.GENERIC_G441VBTX.upload.maximum_size=131072
GenG4.menu.pnum.GENERIC_G441VBTX.upload.maximum_data_size=32768
GenG4.menu.pnum.GENERIC_G441VBTX.build.board=GENERIC_G441VBTX
GenG4.menu.pnum.GENERIC_G441VBTX.build.product_line=STM32G441xx
GenG4.menu.pnum.GENERIC_G441VBTX.build.variant=STM32G4xx/G431V(6-8-B)T_G441VBT
GenG4.menu.pnum.GENERIC_G441VBTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G441.svd

# Generic G471CCTx
GenG4.menu.pnum.GENERIC_G471CCTX=Generic G471CCTx
GenG4.menu.pnum.GENERIC_G471CCTX.upload.maximum_size=262144
GenG4.menu.pnum.GENERIC_G471CCTX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G471CCTX.build.board=GENERIC_G471CCTX
GenG4.menu.pnum.GENERIC_G471CCTX.build.product_line=STM32G471xx
GenG4.menu.pnum.GENERIC_G471CCTX.build.variant=STM32G4xx/G471C(C-E)T
GenG4.menu.pnum.GENERIC_G471CCTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G471.svd

# Generic G471CETx
GenG4.menu.pnum.GENERIC_G471CETX=Generic G471CETx
GenG4.menu.pnum.GENERIC_G471CETX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G471CETX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G471CETX.build.board=GENERIC_G471CETX
GenG4.menu.pnum.GENERIC_G471CETX.build.product_line=STM32G471xx
GenG4.menu.pnum.GENERIC_G471CETX.build.variant=STM32G4xx/G471C(C-E)T
GenG4.menu.pnum.GENERIC_G471CETX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G471.svd

# Generic G471MCTx
GenG4.menu.pnum.GENERIC_G471MCTX=Generic G471MCTx
GenG4.menu.pnum.GENERIC_G471MCTX.upload.maximum_size=262144
GenG4.menu.pnum.GENERIC_G471MCTX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G471MCTX.build.board=GENERIC_G471MCTX
GenG4.menu.pnum.GENERIC_G471MCTX.build.product_line=STM32G471xx
GenG4.menu.pnum.GENERIC_G471MCTX.build.variant=STM32G4xx/G471M(C-E)T
GenG4.menu.pnum.GENERIC_G471MCTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G471.svd

# Generic G471METx
GenG4.menu.pnum.GENERIC_G471METX=Generic G471METx
GenG4.menu.pnum.GENERIC_G471METX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G471METX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G471METX.build.board=GENERIC_G471METX
GenG4.menu.pnum.GENERIC_G471METX.build.product_line=STM32G471xx
GenG4.menu.pnum.GENERIC_G471METX.build.variant=STM32G4xx/G471M(C-E)T
GenG4.menu.pnum.GENERIC_G471METX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G471.svd

# Generic G471QCTx
GenG4.menu.pnum.GENERIC_G471QCTX=Generic G471QCTx
GenG4.menu.pnum.GENERIC_G471QCTX.upload.maximum_size=262144
GenG4.menu.pnum.GENERIC_G471QCTX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G471QCTX.build.board=GENERIC_G471QCTX
GenG4.menu.pnum.GENERIC_G471QCTX.build.product_line=STM32G471xx
GenG4.menu.pnum.GENERIC_G471QCTX.build.variant=STM32G4xx/G471Q(C-E)T
GenG4.menu.pnum.GENERIC_G471QCTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G471.svd

