stm32duino/Arduino_Core_STM32/boards.txt
# Generic G471QETx
GenG4.menu.pnum.GENERIC_G471QETX=Generic G471QETx
GenG4.menu.pnum.GENERIC_G471QETX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G471QETX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G471QETX.build.board=GENERIC_G471QETX
GenG4.menu.pnum.GENERIC_G471QETX.build.product_line=STM32G471xx
GenG4.menu.pnum.GENERIC_G471QETX.build.variant=STM32G4xx/G471Q(C-E)T
GenG4.menu.pnum.GENERIC_G471QETX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G471.svd

# Generic G471RCTx
GenG4.menu.pnum.GENERIC_G471RCTX=Generic G471RCTx
GenG4.menu.pnum.GENERIC_G471RCTX.upload.maximum_size=262144
GenG4.menu.pnum.GENERIC_G471RCTX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G471RCTX.build.board=GENERIC_G471RCTX
GenG4.menu.pnum.GENERIC_G471RCTX.build.product_line=STM32G471xx
GenG4.menu.pnum.GENERIC_G471RCTX.build.variant=STM32G4xx/G471R(C-E)T
GenG4.menu.pnum.GENERIC_G471RCTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G471.svd

# Generic G471RETx
GenG4.menu.pnum.GENERIC_G471RETX=Generic G471RETx
GenG4.menu.pnum.GENERIC_G471RETX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G471RETX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G471RETX.build.board=GENERIC_G471RETX
GenG4.menu.pnum.GENERIC_G471RETX.build.product_line=STM32G471xx
GenG4.menu.pnum.GENERIC_G471RETX.build.variant=STM32G4xx/G471R(C-E)T
GenG4.menu.pnum.GENERIC_G471RETX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G471.svd

# Generic G471VCHx
GenG4.menu.pnum.GENERIC_G471VCHX=Generic G471VCHx
GenG4.menu.pnum.GENERIC_G471VCHX.upload.maximum_size=262144
GenG4.menu.pnum.GENERIC_G471VCHX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G471VCHX.build.board=GENERIC_G471VCHX
GenG4.menu.pnum.GENERIC_G471VCHX.build.product_line=STM32G471xx
GenG4.menu.pnum.GENERIC_G471VCHX.build.variant=STM32G4xx/G471V(C-E)(H-I-T)
GenG4.menu.pnum.GENERIC_G471VCHX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G471.svd

# Generic G471VEHx
GenG4.menu.pnum.GENERIC_G471VEHX=Generic G471VEHx
GenG4.menu.pnum.GENERIC_G471VEHX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G471VEHX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G471VEHX.build.board=GENERIC_G471VEHX
GenG4.menu.pnum.GENERIC_G471VEHX.build.product_line=STM32G471xx
GenG4.menu.pnum.GENERIC_G471VEHX.build.variant=STM32G4xx/G471V(C-E)(H-I-T)
GenG4.menu.pnum.GENERIC_G471VEHX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G471.svd

# Generic G471VCIx
GenG4.menu.pnum.GENERIC_G471VCIX=Generic G471VCIx
GenG4.menu.pnum.GENERIC_G471VCIX.upload.maximum_size=262144
GenG4.menu.pnum.GENERIC_G471VCIX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G471VCIX.build.board=GENERIC_G471VCIX
GenG4.menu.pnum.GENERIC_G471VCIX.build.product_line=STM32G471xx
GenG4.menu.pnum.GENERIC_G471VCIX.build.variant=STM32G4xx/G471V(C-E)(H-I-T)
GenG4.menu.pnum.GENERIC_G471VCIX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G471.svd

# Generic G471VEIx
GenG4.menu.pnum.GENERIC_G471VEIX=Generic G471VEIx
GenG4.menu.pnum.GENERIC_G471VEIX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G471VEIX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G471VEIX.build.board=GENERIC_G471VEIX
GenG4.menu.pnum.GENERIC_G471VEIX.build.product_line=STM32G471xx
GenG4.menu.pnum.GENERIC_G471VEIX.build.variant=STM32G4xx/G471V(C-E)(H-I-T)
GenG4.menu.pnum.GENERIC_G471VEIX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G471.svd

# Generic G471VCTx
GenG4.menu.pnum.GENERIC_G471VCTX=Generic G471VCTx
GenG4.menu.pnum.GENERIC_G471VCTX.upload.maximum_size=262144
GenG4.menu.pnum.GENERIC_G471VCTX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G471VCTX.build.board=GENERIC_G471VCTX
GenG4.menu.pnum.GENERIC_G471VCTX.build.product_line=STM32G471xx
GenG4.menu.pnum.GENERIC_G471VCTX.build.variant=STM32G4xx/G471V(C-E)(H-I-T)
GenG4.menu.pnum.GENERIC_G471VCTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G471.svd

# Generic G471VETx
GenG4.menu.pnum.GENERIC_G471VETX=Generic G471VETx
GenG4.menu.pnum.GENERIC_G471VETX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G471VETX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G471VETX.build.board=GENERIC_G471VETX
GenG4.menu.pnum.GENERIC_G471VETX.build.product_line=STM32G471xx
GenG4.menu.pnum.GENERIC_G471VETX.build.variant=STM32G4xx/G471V(C-E)(H-I-T)
GenG4.menu.pnum.GENERIC_G471VETX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G471.svd

# Generic G473CBTx
GenG4.menu.pnum.GENERIC_G473CBTX=Generic G473CBTx
GenG4.menu.pnum.GENERIC_G473CBTX.upload.maximum_size=131072
GenG4.menu.pnum.GENERIC_G473CBTX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G473CBTX.build.board=GENERIC_G473CBTX
GenG4.menu.pnum.GENERIC_G473CBTX.build.product_line=STM32G473xx
GenG4.menu.pnum.GENERIC_G473CBTX.build.variant=STM32G4xx/G473C(B-C-E)T_G474C(B-C-E)T_G483CET_G484CET
GenG4.menu.pnum.GENERIC_G473CBTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G473.svd

# Generic G473CBUx
GenG4.menu.pnum.GENERIC_G473CBUX=Generic G473CBUx
GenG4.menu.pnum.GENERIC_G473CBUX.upload.maximum_size=131072
GenG4.menu.pnum.GENERIC_G473CBUX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G473CBUX.build.board=GENERIC_G473CBUX
GenG4.menu.pnum.GENERIC_G473CBUX.build.product_line=STM32G473xx
GenG4.menu.pnum.GENERIC_G473CBUX.build.variant=STM32G4xx/G473C(B-C-E)U_G474C(B-C-E)U_G483CEU_G484CEU
GenG4.menu.pnum.GENERIC_G473CBUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G473.svd

# Generic G473CCTx
GenG4.menu.pnum.GENERIC_G473CCTX=Generic G473CCTx
GenG4.menu.pnum.GENERIC_G473CCTX.upload.maximum_size=262144
GenG4.menu.pnum.GENERIC_G473CCTX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G473CCTX.build.board=GENERIC_G473CCTX
GenG4.menu.pnum.GENERIC_G473CCTX.build.product_line=STM32G473xx
GenG4.menu.pnum.GENERIC_G473CCTX.build.variant=STM32G4xx/G473C(B-C-E)T_G474C(B-C-E)T_G483CET_G484CET
GenG4.menu.pnum.GENERIC_G473CCTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G473.svd

# Generic G473CCUx
GenG4.menu.pnum.GENERIC_G473CCUX=Generic G473CCUx
GenG4.menu.pnum.GENERIC_G473CCUX.upload.maximum_size=262144
GenG4.menu.pnum.GENERIC_G473CCUX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G473CCUX.build.board=GENERIC_G473CCUX
GenG4.menu.pnum.GENERIC_G473CCUX.build.product_line=STM32G473xx
GenG4.menu.pnum.GENERIC_G473CCUX.build.variant=STM32G4xx/G473C(B-C-E)U_G474C(B-C-E)U_G483CEU_G484CEU
GenG4.menu.pnum.GENERIC_G473CCUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G473.svd

