stm32duino/Arduino_Core_STM32/boards.txt
# Generic G473CETx
GenG4.menu.pnum.GENERIC_G473CETX=Generic G473CETx
GenG4.menu.pnum.GENERIC_G473CETX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G473CETX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G473CETX.build.board=GENERIC_G473CETX
GenG4.menu.pnum.GENERIC_G473CETX.build.product_line=STM32G473xx
GenG4.menu.pnum.GENERIC_G473CETX.build.variant=STM32G4xx/G473C(B-C-E)T_G474C(B-C-E)T_G483CET_G484CET
GenG4.menu.pnum.GENERIC_G473CETX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G473.svd

# Generic G473CEUx
GenG4.menu.pnum.GENERIC_G473CEUX=Generic G473CEUx
GenG4.menu.pnum.GENERIC_G473CEUX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G473CEUX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G473CEUX.build.board=GENERIC_G473CEUX
GenG4.menu.pnum.GENERIC_G473CEUX.build.product_line=STM32G473xx
GenG4.menu.pnum.GENERIC_G473CEUX.build.variant=STM32G4xx/G473C(B-C-E)U_G474C(B-C-E)U_G483CEU_G484CEU
GenG4.menu.pnum.GENERIC_G473CEUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G473.svd

# Generic G473MBTx
GenG4.menu.pnum.GENERIC_G473MBTX=Generic G473MBTx
GenG4.menu.pnum.GENERIC_G473MBTX.upload.maximum_size=131072
GenG4.menu.pnum.GENERIC_G473MBTX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G473MBTX.build.board=GENERIC_G473MBTX
GenG4.menu.pnum.GENERIC_G473MBTX.build.product_line=STM32G473xx
GenG4.menu.pnum.GENERIC_G473MBTX.build.variant=STM32G4xx/G473M(B-C-E)T_G474M(B-C-E)T_G483MET_G484MET
GenG4.menu.pnum.GENERIC_G473MBTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G473.svd

# Generic G473MCTx
GenG4.menu.pnum.GENERIC_G473MCTX=Generic G473MCTx
GenG4.menu.pnum.GENERIC_G473MCTX.upload.maximum_size=262144
GenG4.menu.pnum.GENERIC_G473MCTX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G473MCTX.build.board=GENERIC_G473MCTX
GenG4.menu.pnum.GENERIC_G473MCTX.build.product_line=STM32G473xx
GenG4.menu.pnum.GENERIC_G473MCTX.build.variant=STM32G4xx/G473M(B-C-E)T_G474M(B-C-E)T_G483MET_G484MET
GenG4.menu.pnum.GENERIC_G473MCTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G473.svd

# Generic G473METx
GenG4.menu.pnum.GENERIC_G473METX=Generic G473METx
GenG4.menu.pnum.GENERIC_G473METX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G473METX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G473METX.build.board=GENERIC_G473METX
GenG4.menu.pnum.GENERIC_G473METX.build.product_line=STM32G473xx
GenG4.menu.pnum.GENERIC_G473METX.build.variant=STM32G4xx/G473M(B-C-E)T_G474M(B-C-E)T_G483MET_G484MET
GenG4.menu.pnum.GENERIC_G473METX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G473.svd

# Generic G473PBIx
GenG4.menu.pnum.GENERIC_G473PBIX=Generic G473PBIx
GenG4.menu.pnum.GENERIC_G473PBIX.upload.maximum_size=131072
GenG4.menu.pnum.GENERIC_G473PBIX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G473PBIX.build.board=GENERIC_G473PBIX
GenG4.menu.pnum.GENERIC_G473PBIX.build.product_line=STM32G473xx
GenG4.menu.pnum.GENERIC_G473PBIX.build.variant=STM32G4xx/G473P(B-C-E)I_G474P(B-C-E)I_G483PEI_G484PEI
GenG4.menu.pnum.GENERIC_G473PBIX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G473.svd

# Generic G473PCIx
GenG4.menu.pnum.GENERIC_G473PCIX=Generic G473PCIx
GenG4.menu.pnum.GENERIC_G473PCIX.upload.maximum_size=262144
GenG4.menu.pnum.GENERIC_G473PCIX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G473PCIX.build.board=GENERIC_G473PCIX
GenG4.menu.pnum.GENERIC_G473PCIX.build.product_line=STM32G473xx
GenG4.menu.pnum.GENERIC_G473PCIX.build.variant=STM32G4xx/G473P(B-C-E)I_G474P(B-C-E)I_G483PEI_G484PEI
GenG4.menu.pnum.GENERIC_G473PCIX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G473.svd

# Generic G473PEIx
GenG4.menu.pnum.GENERIC_G473PEIX=Generic G473PEIx
GenG4.menu.pnum.GENERIC_G473PEIX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G473PEIX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G473PEIX.build.board=GENERIC_G473PEIX
GenG4.menu.pnum.GENERIC_G473PEIX.build.product_line=STM32G473xx
GenG4.menu.pnum.GENERIC_G473PEIX.build.variant=STM32G4xx/G473P(B-C-E)I_G474P(B-C-E)I_G483PEI_G484PEI
GenG4.menu.pnum.GENERIC_G473PEIX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G473.svd

# Generic G473RBTx
GenG4.menu.pnum.GENERIC_G473RBTX=Generic G473RBTx
GenG4.menu.pnum.GENERIC_G473RBTX.upload.maximum_size=131072
GenG4.menu.pnum.GENERIC_G473RBTX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G473RBTX.build.board=GENERIC_G473RBTX
GenG4.menu.pnum.GENERIC_G473RBTX.build.product_line=STM32G473xx
GenG4.menu.pnum.GENERIC_G473RBTX.build.variant=STM32G4xx/G473R(B-C)T_G473RETx(Z)_G474R(B-C-E)T_G483RET_G484RET
GenG4.menu.pnum.GENERIC_G473RBTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G473.svd

# Generic G473RCTx
GenG4.menu.pnum.GENERIC_G473RCTX=Generic G473RCTx
GenG4.menu.pnum.GENERIC_G473RCTX.upload.maximum_size=262144
GenG4.menu.pnum.GENERIC_G473RCTX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G473RCTX.build.board=GENERIC_G473RCTX
GenG4.menu.pnum.GENERIC_G473RCTX.build.product_line=STM32G473xx
GenG4.menu.pnum.GENERIC_G473RCTX.build.variant=STM32G4xx/G473R(B-C)T_G473RETx(Z)_G474R(B-C-E)T_G483RET_G484RET
GenG4.menu.pnum.GENERIC_G473RCTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G473.svd

# Generic G473RETx
GenG4.menu.pnum.GENERIC_G473RETX=Generic G473RETx
GenG4.menu.pnum.GENERIC_G473RETX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G473RETX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G473RETX.build.board=GENERIC_G473RETX
GenG4.menu.pnum.GENERIC_G473RETX.build.product_line=STM32G473xx
GenG4.menu.pnum.GENERIC_G473RETX.build.variant=STM32G4xx/G473R(B-C)T_G473RETx(Z)_G474R(B-C-E)T_G483RET_G484RET
GenG4.menu.pnum.GENERIC_G473RETX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G473.svd

# Generic G473QBTx
GenG4.menu.pnum.GENERIC_G473QBTX=Generic G473QBTx
GenG4.menu.pnum.GENERIC_G473QBTX.upload.maximum_size=131072
GenG4.menu.pnum.GENERIC_G473QBTX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G473QBTX.build.board=GENERIC_G473QBTX
GenG4.menu.pnum.GENERIC_G473QBTX.build.product_line=STM32G473xx
GenG4.menu.pnum.GENERIC_G473QBTX.build.variant=STM32G4xx/G473Q(B-C)T_G473QETx(Z)_G474Q(B-C-E)T_G483QET_G484QET
GenG4.menu.pnum.GENERIC_G473QBTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G473.svd

# Generic G473QCTx
GenG4.menu.pnum.GENERIC_G473QCTX=Generic G473QCTx
GenG4.menu.pnum.GENERIC_G473QCTX.upload.maximum_size=262144
GenG4.menu.pnum.GENERIC_G473QCTX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G473QCTX.build.board=GENERIC_G473QCTX
GenG4.menu.pnum.GENERIC_G473QCTX.build.product_line=STM32G473xx
GenG4.menu.pnum.GENERIC_G473QCTX.build.variant=STM32G4xx/G473Q(B-C)T_G473QETx(Z)_G474Q(B-C-E)T_G483QET_G484QET
GenG4.menu.pnum.GENERIC_G473QCTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G473.svd

