stm32duino/Arduino_Core_STM32/boards.txt
# Generic G473QETx
GenG4.menu.pnum.GENERIC_G473QETX=Generic G473QETx
GenG4.menu.pnum.GENERIC_G473QETX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G473QETX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G473QETX.build.board=GENERIC_G473QETX
GenG4.menu.pnum.GENERIC_G473QETX.build.product_line=STM32G473xx
GenG4.menu.pnum.GENERIC_G473QETX.build.variant=STM32G4xx/G473Q(B-C)T_G473QETx(Z)_G474Q(B-C-E)T_G483QET_G484QET
GenG4.menu.pnum.GENERIC_G473QETX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G473.svd

# Generic G473QETxZ
GenG4.menu.pnum.GENERIC_G473QETXZ=Generic G473QETxZ
GenG4.menu.pnum.GENERIC_G473QETXZ.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G473QETXZ.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G473QETXZ.build.board=GENERIC_G473QETXZ
GenG4.menu.pnum.GENERIC_G473QETXZ.build.product_line=STM32G473xx
GenG4.menu.pnum.GENERIC_G473QETXZ.build.variant=STM32G4xx/G473Q(B-C)T_G473QETx(Z)_G474Q(B-C-E)T_G483QET_G484QET
GenG4.menu.pnum.GENERIC_G473QETXZ.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G473.svd

# Generic G473VBHx
GenG4.menu.pnum.GENERIC_G473VBHX=Generic G473VBHx
GenG4.menu.pnum.GENERIC_G473VBHX.upload.maximum_size=131072
GenG4.menu.pnum.GENERIC_G473VBHX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G473VBHX.build.board=GENERIC_G473VBHX
GenG4.menu.pnum.GENERIC_G473VBHX.build.product_line=STM32G473xx
GenG4.menu.pnum.GENERIC_G473VBHX.build.variant=STM32G4xx/G473V(B-C-E)(H-T)_G474V(B-C-E)(H-T)_G483VE(H-T)_G484VE(H-T)
GenG4.menu.pnum.GENERIC_G473VBHX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G473.svd

# Generic G473VCHx
GenG4.menu.pnum.GENERIC_G473VCHX=Generic G473VCHx
GenG4.menu.pnum.GENERIC_G473VCHX.upload.maximum_size=262144
GenG4.menu.pnum.GENERIC_G473VCHX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G473VCHX.build.board=GENERIC_G473VCHX
GenG4.menu.pnum.GENERIC_G473VCHX.build.product_line=STM32G473xx
GenG4.menu.pnum.GENERIC_G473VCHX.build.variant=STM32G4xx/G473V(B-C-E)(H-T)_G474V(B-C-E)(H-T)_G483VE(H-T)_G484VE(H-T)
GenG4.menu.pnum.GENERIC_G473VCHX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G473.svd

# Generic G473VEHx
GenG4.menu.pnum.GENERIC_G473VEHX=Generic G473VEHx
GenG4.menu.pnum.GENERIC_G473VEHX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G473VEHX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G473VEHX.build.board=GENERIC_G473VEHX
GenG4.menu.pnum.GENERIC_G473VEHX.build.product_line=STM32G473xx
GenG4.menu.pnum.GENERIC_G473VEHX.build.variant=STM32G4xx/G473V(B-C-E)(H-T)_G474V(B-C-E)(H-T)_G483VE(H-T)_G484VE(H-T)
GenG4.menu.pnum.GENERIC_G473VEHX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G473.svd

# Generic G473VBTx
GenG4.menu.pnum.GENERIC_G473VBTX=Generic G473VBTx
GenG4.menu.pnum.GENERIC_G473VBTX.upload.maximum_size=131072
GenG4.menu.pnum.GENERIC_G473VBTX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G473VBTX.build.board=GENERIC_G473VBTX
GenG4.menu.pnum.GENERIC_G473VBTX.build.product_line=STM32G473xx
GenG4.menu.pnum.GENERIC_G473VBTX.build.variant=STM32G4xx/G473V(B-C-E)(H-T)_G474V(B-C-E)(H-T)_G483VE(H-T)_G484VE(H-T)
GenG4.menu.pnum.GENERIC_G473VBTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G473.svd

# Generic G473VCTx
GenG4.menu.pnum.GENERIC_G473VCTX=Generic G473VCTx
GenG4.menu.pnum.GENERIC_G473VCTX.upload.maximum_size=262144
GenG4.menu.pnum.GENERIC_G473VCTX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G473VCTX.build.board=GENERIC_G473VCTX
GenG4.menu.pnum.GENERIC_G473VCTX.build.product_line=STM32G473xx
GenG4.menu.pnum.GENERIC_G473VCTX.build.variant=STM32G4xx/G473V(B-C-E)(H-T)_G474V(B-C-E)(H-T)_G483VE(H-T)_G484VE(H-T)
GenG4.menu.pnum.GENERIC_G473VCTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G473.svd

# Generic G473VETx
GenG4.menu.pnum.GENERIC_G473VETX=Generic G473VETx
GenG4.menu.pnum.GENERIC_G473VETX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G473VETX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G473VETX.build.board=GENERIC_G473VETX
GenG4.menu.pnum.GENERIC_G473VETX.build.product_line=STM32G473xx
GenG4.menu.pnum.GENERIC_G473VETX.build.variant=STM32G4xx/G473V(B-C-E)(H-T)_G474V(B-C-E)(H-T)_G483VE(H-T)_G484VE(H-T)
GenG4.menu.pnum.GENERIC_G473VETX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G473.svd

# Generic G474CBTx
GenG4.menu.pnum.GENERIC_G474CBTX=Generic G474CBTx
GenG4.menu.pnum.GENERIC_G474CBTX.upload.maximum_size=131072
GenG4.menu.pnum.GENERIC_G474CBTX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G474CBTX.build.board=GENERIC_G474CBTX
GenG4.menu.pnum.GENERIC_G474CBTX.build.product_line=STM32G474xx
GenG4.menu.pnum.GENERIC_G474CBTX.build.variant=STM32G4xx/G473C(B-C-E)T_G474C(B-C-E)T_G483CET_G484CET
GenG4.menu.pnum.GENERIC_G474CBTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G474.svd

# Generic G474CBUx
GenG4.menu.pnum.GENERIC_G474CBUX=Generic G474CBUx
GenG4.menu.pnum.GENERIC_G474CBUX.upload.maximum_size=131072
GenG4.menu.pnum.GENERIC_G474CBUX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G474CBUX.build.board=GENERIC_G474CBUX
GenG4.menu.pnum.GENERIC_G474CBUX.build.product_line=STM32G474xx
GenG4.menu.pnum.GENERIC_G474CBUX.build.variant=STM32G4xx/G473C(B-C-E)U_G474C(B-C-E)U_G483CEU_G484CEU
GenG4.menu.pnum.GENERIC_G474CBUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G474.svd

# Generic G474CCTx
GenG4.menu.pnum.GENERIC_G474CCTX=Generic G474CCTx
GenG4.menu.pnum.GENERIC_G474CCTX.upload.maximum_size=262144
GenG4.menu.pnum.GENERIC_G474CCTX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G474CCTX.build.board=GENERIC_G474CCTX
GenG4.menu.pnum.GENERIC_G474CCTX.build.product_line=STM32G474xx
GenG4.menu.pnum.GENERIC_G474CCTX.build.variant=STM32G4xx/G473C(B-C-E)T_G474C(B-C-E)T_G483CET_G484CET
GenG4.menu.pnum.GENERIC_G474CCTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G474.svd

# Generic G474CCUx
GenG4.menu.pnum.GENERIC_G474CCUX=Generic G474CCUx
GenG4.menu.pnum.GENERIC_G474CCUX.upload.maximum_size=262144
GenG4.menu.pnum.GENERIC_G474CCUX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G474CCUX.build.board=GENERIC_G474CCUX
GenG4.menu.pnum.GENERIC_G474CCUX.build.product_line=STM32G474xx
GenG4.menu.pnum.GENERIC_G474CCUX.build.variant=STM32G4xx/G473C(B-C-E)U_G474C(B-C-E)U_G483CEU_G484CEU
GenG4.menu.pnum.GENERIC_G474CCUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G474.svd

