stm32duino/Arduino_Core_STM32/boards.txt
# Generic G483VETx
GenG4.menu.pnum.GENERIC_G483VETX=Generic G483VETx
GenG4.menu.pnum.GENERIC_G483VETX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G483VETX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G483VETX.build.board=GENERIC_G483VETX
GenG4.menu.pnum.GENERIC_G483VETX.build.product_line=STM32G483xx
GenG4.menu.pnum.GENERIC_G483VETX.build.variant=STM32G4xx/G473V(B-C-E)(H-T)_G474V(B-C-E)(H-T)_G483VE(H-T)_G484VE(H-T)
GenG4.menu.pnum.GENERIC_G483VETX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G483.svd

# Generic G484CETx
GenG4.menu.pnum.GENERIC_G484CETX=Generic G484CETx
GenG4.menu.pnum.GENERIC_G484CETX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G484CETX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G484CETX.build.board=GENERIC_G484CETX
GenG4.menu.pnum.GENERIC_G484CETX.build.product_line=STM32G484xx
GenG4.menu.pnum.GENERIC_G484CETX.build.variant=STM32G4xx/G473C(B-C-E)T_G474C(B-C-E)T_G483CET_G484CET
GenG4.menu.pnum.GENERIC_G484CETX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G484.svd

# Generic G484CEUx
GenG4.menu.pnum.GENERIC_G484CEUX=Generic G484CEUx
GenG4.menu.pnum.GENERIC_G484CEUX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G484CEUX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G484CEUX.build.board=GENERIC_G484CEUX
GenG4.menu.pnum.GENERIC_G484CEUX.build.product_line=STM32G484xx
GenG4.menu.pnum.GENERIC_G484CEUX.build.variant=STM32G4xx/G473C(B-C-E)U_G474C(B-C-E)U_G483CEU_G484CEU
GenG4.menu.pnum.GENERIC_G484CEUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G484.svd

# Generic G484METx
GenG4.menu.pnum.GENERIC_G484METX=Generic G484METx
GenG4.menu.pnum.GENERIC_G484METX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G484METX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G484METX.build.board=GENERIC_G484METX
GenG4.menu.pnum.GENERIC_G484METX.build.product_line=STM32G484xx
GenG4.menu.pnum.GENERIC_G484METX.build.variant=STM32G4xx/G473M(B-C-E)T_G474M(B-C-E)T_G483MET_G484MET
GenG4.menu.pnum.GENERIC_G484METX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G484.svd

# Generic G484PEIx
GenG4.menu.pnum.GENERIC_G484PEIX=Generic G484PEIx
GenG4.menu.pnum.GENERIC_G484PEIX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G484PEIX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G484PEIX.build.board=GENERIC_G484PEIX
GenG4.menu.pnum.GENERIC_G484PEIX.build.product_line=STM32G484xx
GenG4.menu.pnum.GENERIC_G484PEIX.build.variant=STM32G4xx/G473P(B-C-E)I_G474P(B-C-E)I_G483PEI_G484PEI
GenG4.menu.pnum.GENERIC_G484PEIX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G484.svd

# Generic G484QETx
GenG4.menu.pnum.GENERIC_G484QETX=Generic G484QETx
GenG4.menu.pnum.GENERIC_G484QETX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G484QETX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G484QETX.build.board=GENERIC_G484QETX
GenG4.menu.pnum.GENERIC_G484QETX.build.product_line=STM32G484xx
GenG4.menu.pnum.GENERIC_G484QETX.build.variant=STM32G4xx/G473Q(B-C)T_G473QETx(Z)_G474Q(B-C-E)T_G483QET_G484QET
GenG4.menu.pnum.GENERIC_G484QETX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G484.svd

# Generic G484RETx
GenG4.menu.pnum.GENERIC_G484RETX=Generic G484RETx
GenG4.menu.pnum.GENERIC_G484RETX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G484RETX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G484RETX.build.board=GENERIC_G484RETX
GenG4.menu.pnum.GENERIC_G484RETX.build.product_line=STM32G484xx
GenG4.menu.pnum.GENERIC_G484RETX.build.variant=STM32G4xx/G473R(B-C)T_G473RETx(Z)_G474R(B-C-E)T_G483RET_G484RET
GenG4.menu.pnum.GENERIC_G484RETX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G484.svd

# Generic G484VEHx
GenG4.menu.pnum.GENERIC_G484VEHX=Generic G484VEHx
GenG4.menu.pnum.GENERIC_G484VEHX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G484VEHX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G484VEHX.build.board=GENERIC_G484VEHX
GenG4.menu.pnum.GENERIC_G484VEHX.build.product_line=STM32G484xx
GenG4.menu.pnum.GENERIC_G484VEHX.build.variant=STM32G4xx/G473V(B-C-E)(H-T)_G474V(B-C-E)(H-T)_G483VE(H-T)_G484VE(H-T)
GenG4.menu.pnum.GENERIC_G484VEHX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G484.svd

# Generic G484VETx
GenG4.menu.pnum.GENERIC_G484VETX=Generic G484VETx
GenG4.menu.pnum.GENERIC_G484VETX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G484VETX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G484VETX.build.board=GENERIC_G484VETX
GenG4.menu.pnum.GENERIC_G484VETX.build.product_line=STM32G484xx
GenG4.menu.pnum.GENERIC_G484VETX.build.variant=STM32G4xx/G473V(B-C-E)(H-T)_G474V(B-C-E)(H-T)_G483VE(H-T)_G484VE(H-T)
GenG4.menu.pnum.GENERIC_G484VETX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G484.svd

# Generic G491CCTx
GenG4.menu.pnum.GENERIC_G491CCTX=Generic G491CCTx
GenG4.menu.pnum.GENERIC_G491CCTX.upload.maximum_size=262144
GenG4.menu.pnum.GENERIC_G491CCTX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G491CCTX.build.board=GENERIC_G491CCTX
GenG4.menu.pnum.GENERIC_G491CCTX.build.product_line=STM32G491xx
GenG4.menu.pnum.GENERIC_G491CCTX.build.variant=STM32G4xx/G491C(C-E)T_G4A1CET
GenG4.menu.pnum.GENERIC_G491CCTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G491.svd

# Generic G491CETx
GenG4.menu.pnum.GENERIC_G491CETX=Generic G491CETx
GenG4.menu.pnum.GENERIC_G491CETX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G491CETX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G491CETX.build.board=GENERIC_G491CETX
GenG4.menu.pnum.GENERIC_G491CETX.build.product_line=STM32G491xx
GenG4.menu.pnum.GENERIC_G491CETX.build.variant=STM32G4xx/G491C(C-E)T_G4A1CET
GenG4.menu.pnum.GENERIC_G491CETX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G491.svd

# Generic G491KCUx
GenG4.menu.pnum.GENERIC_G491KCUX=Generic G491KCUx
GenG4.menu.pnum.GENERIC_G491KCUX.upload.maximum_size=262144
GenG4.menu.pnum.GENERIC_G491KCUX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G491KCUX.build.board=GENERIC_G491KCUX
GenG4.menu.pnum.GENERIC_G491KCUX.build.product_line=STM32G491xx
GenG4.menu.pnum.GENERIC_G491KCUX.build.variant=STM32G4xx/G491K(C-E)U_G4A1KEU
GenG4.menu.pnum.GENERIC_G491KCUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G491.svd

# Generic G491KEUx
GenG4.menu.pnum.GENERIC_G491KEUX=Generic G491KEUx
GenG4.menu.pnum.GENERIC_G491KEUX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G491KEUX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G491KEUX.build.board=GENERIC_G491KEUX
GenG4.menu.pnum.GENERIC_G491KEUX.build.product_line=STM32G491xx
GenG4.menu.pnum.GENERIC_G491KEUX.build.variant=STM32G4xx/G491K(C-E)U_G4A1KEU
GenG4.menu.pnum.GENERIC_G491KEUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G491.svd

# Generic G491MCSx
GenG4.menu.pnum.GENERIC_G491MCSX=Generic G491MCSx
GenG4.menu.pnum.GENERIC_G491MCSX.upload.maximum_size=262144
GenG4.menu.pnum.GENERIC_G491MCSX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G491MCSX.build.board=GENERIC_G491MCSX
GenG4.menu.pnum.GENERIC_G491MCSX.build.product_line=STM32G491xx
GenG4.menu.pnum.GENERIC_G491MCSX.build.variant=STM32G4xx/G491M(C-E)(S-T)_G4A1ME(S-T)
GenG4.menu.pnum.GENERIC_G491MCSX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G491.svd

