stm32duino/Arduino_Core_STM32/boards.txt
# Generic G491MESx
GenG4.menu.pnum.GENERIC_G491MESX=Generic G491MESx
GenG4.menu.pnum.GENERIC_G491MESX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G491MESX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G491MESX.build.board=GENERIC_G491MESX
GenG4.menu.pnum.GENERIC_G491MESX.build.product_line=STM32G491xx
GenG4.menu.pnum.GENERIC_G491MESX.build.variant=STM32G4xx/G491M(C-E)(S-T)_G4A1ME(S-T)
GenG4.menu.pnum.GENERIC_G491MESX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G491.svd

# Generic G491MCTx
GenG4.menu.pnum.GENERIC_G491MCTX=Generic G491MCTx
GenG4.menu.pnum.GENERIC_G491MCTX.upload.maximum_size=262144
GenG4.menu.pnum.GENERIC_G491MCTX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G491MCTX.build.board=GENERIC_G491MCTX
GenG4.menu.pnum.GENERIC_G491MCTX.build.product_line=STM32G491xx
GenG4.menu.pnum.GENERIC_G491MCTX.build.variant=STM32G4xx/G491M(C-E)(S-T)_G4A1ME(S-T)
GenG4.menu.pnum.GENERIC_G491MCTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G491.svd

# Generic G491METx
GenG4.menu.pnum.GENERIC_G491METX=Generic G491METx
GenG4.menu.pnum.GENERIC_G491METX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G491METX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G491METX.build.board=GENERIC_G491METX
GenG4.menu.pnum.GENERIC_G491METX.build.product_line=STM32G491xx
GenG4.menu.pnum.GENERIC_G491METX.build.variant=STM32G4xx/G491M(C-E)(S-T)_G4A1ME(S-T)
GenG4.menu.pnum.GENERIC_G491METX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G491.svd

# Generic G491RCIx
GenG4.menu.pnum.GENERIC_G491RCIX=Generic G491RCIx
GenG4.menu.pnum.GENERIC_G491RCIX.upload.maximum_size=262144
GenG4.menu.pnum.GENERIC_G491RCIX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G491RCIX.build.board=GENERIC_G491RCIX
GenG4.menu.pnum.GENERIC_G491RCIX.build.product_line=STM32G491xx
GenG4.menu.pnum.GENERIC_G491RCIX.build.variant=STM32G4xx/G491RC(I-T)_G491RE(I-T-Y)x(Z)_G4A1RE(I-T-Y)
GenG4.menu.pnum.GENERIC_G491RCIX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G491.svd

# Generic G491REIx
GenG4.menu.pnum.GENERIC_G491REIX=Generic G491REIx
GenG4.menu.pnum.GENERIC_G491REIX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G491REIX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G491REIX.build.board=GENERIC_G491REIX
GenG4.menu.pnum.GENERIC_G491REIX.build.product_line=STM32G491xx
GenG4.menu.pnum.GENERIC_G491REIX.build.variant=STM32G4xx/G491RC(I-T)_G491RE(I-T-Y)x(Z)_G4A1RE(I-T-Y)
GenG4.menu.pnum.GENERIC_G491REIX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G491.svd

# Generic G491RCTx
GenG4.menu.pnum.GENERIC_G491RCTX=Generic G491RCTx
GenG4.menu.pnum.GENERIC_G491RCTX.upload.maximum_size=262144
GenG4.menu.pnum.GENERIC_G491RCTX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G491RCTX.build.board=GENERIC_G491RCTX
GenG4.menu.pnum.GENERIC_G491RCTX.build.product_line=STM32G491xx
GenG4.menu.pnum.GENERIC_G491RCTX.build.variant=STM32G4xx/G491RC(I-T)_G491RE(I-T-Y)x(Z)_G4A1RE(I-T-Y)
GenG4.menu.pnum.GENERIC_G491RCTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G491.svd

# Generic G491RETx
GenG4.menu.pnum.GENERIC_G491RETX=Generic G491RETx
GenG4.menu.pnum.GENERIC_G491RETX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G491RETX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G491RETX.build.board=GENERIC_G491RETX
GenG4.menu.pnum.GENERIC_G491RETX.build.product_line=STM32G491xx
GenG4.menu.pnum.GENERIC_G491RETX.build.variant=STM32G4xx/G491RC(I-T)_G491RE(I-T-Y)x(Z)_G4A1RE(I-T-Y)
GenG4.menu.pnum.GENERIC_G491RETX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G491.svd

# Generic G491RETxZ
GenG4.menu.pnum.GENERIC_G491RETXZ=Generic G491RETxZ
GenG4.menu.pnum.GENERIC_G491RETXZ.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G491RETXZ.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G491RETXZ.build.board=GENERIC_G491RETXZ
GenG4.menu.pnum.GENERIC_G491RETXZ.build.product_line=STM32G491xx
GenG4.menu.pnum.GENERIC_G491RETXZ.build.variant=STM32G4xx/G491RC(I-T)_G491RE(I-T-Y)x(Z)_G4A1RE(I-T-Y)

# Generic G491REYx
GenG4.menu.pnum.GENERIC_G491REYX=Generic G491REYx
GenG4.menu.pnum.GENERIC_G491REYX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G491REYX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G491REYX.build.board=GENERIC_G491REYX
GenG4.menu.pnum.GENERIC_G491REYX.build.product_line=STM32G491xx
GenG4.menu.pnum.GENERIC_G491REYX.build.variant=STM32G4xx/G491RC(I-T)_G491RE(I-T-Y)x(Z)_G4A1RE(I-T-Y)
GenG4.menu.pnum.GENERIC_G491REYX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G491.svd

# Generic G491VCTx
GenG4.menu.pnum.GENERIC_G491VCTX=Generic G491VCTx
GenG4.menu.pnum.GENERIC_G491VCTX.upload.maximum_size=262144
GenG4.menu.pnum.GENERIC_G491VCTX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G491VCTX.build.board=GENERIC_G491VCTX
GenG4.menu.pnum.GENERIC_G491VCTX.build.product_line=STM32G491xx
GenG4.menu.pnum.GENERIC_G491VCTX.build.variant=STM32G4xx/G491V(C-E)T_G4A1VET
GenG4.menu.pnum.GENERIC_G491VCTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G491.svd

# Generic G491VETx
GenG4.menu.pnum.GENERIC_G491VETX=Generic G491VETx
GenG4.menu.pnum.GENERIC_G491VETX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G491VETX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G491VETX.build.board=GENERIC_G491VETX
GenG4.menu.pnum.GENERIC_G491VETX.build.product_line=STM32G491xx
GenG4.menu.pnum.GENERIC_G491VETX.build.variant=STM32G4xx/G491V(C-E)T_G4A1VET
GenG4.menu.pnum.GENERIC_G491VETX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G491.svd

# Generic G4A1REIx
GenG4.menu.pnum.GENERIC_G4A1REIX=Generic G4A1REIx
GenG4.menu.pnum.GENERIC_G4A1REIX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G4A1REIX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G4A1REIX.build.board=GENERIC_G4A1REIX
GenG4.menu.pnum.GENERIC_G4A1REIX.build.product_line=STM32G4A1xx
GenG4.menu.pnum.GENERIC_G4A1REIX.build.variant=STM32G4xx/G491RC(I-T)_G491RE(I-T-Y)x(Z)_G4A1RE(I-T-Y)
GenG4.menu.pnum.GENERIC_G4A1REIX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G4A1.svd

