stm32duino/Arduino_Core_STM32/boards.txt
# Generic H503CBUx
GenH5.menu.pnum.GENERIC_H503CBUX=Generic H503CBUx
GenH5.menu.pnum.GENERIC_H503CBUX.upload.maximum_size=131072
GenH5.menu.pnum.GENERIC_H503CBUX.upload.maximum_data_size=32768
GenH5.menu.pnum.GENERIC_H503CBUX.build.board=GENERIC_H503CBUX
GenH5.menu.pnum.GENERIC_H503CBUX.build.product_line=STM32H503xx
GenH5.menu.pnum.GENERIC_H503CBUX.build.variant=STM32H5xx/H503CB(T-U)
GenH5.menu.pnum.GENERIC_H503CBUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32H5xx/STM32H503.svd

# Generic H503KBUx
GenH5.menu.pnum.GENERIC_H503KBUX=Generic H503KBUx
GenH5.menu.pnum.GENERIC_H503KBUX.upload.maximum_size=131072
GenH5.menu.pnum.GENERIC_H503KBUX.upload.maximum_data_size=32768
GenH5.menu.pnum.GENERIC_H503KBUX.build.board=GENERIC_H503KBUX
GenH5.menu.pnum.GENERIC_H503KBUX.build.product_line=STM32H503xx
GenH5.menu.pnum.GENERIC_H503KBUX.build.variant=STM32H5xx/H503KBU
GenH5.menu.pnum.GENERIC_H503KBUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32H5xx/STM32H503.svd

# Generic H503RBTx
GenH5.menu.pnum.GENERIC_H503RBTX=Generic H503RBTx
GenH5.menu.pnum.GENERIC_H503RBTX.upload.maximum_size=131072
GenH5.menu.pnum.GENERIC_H503RBTX.upload.maximum_data_size=32768
GenH5.menu.pnum.GENERIC_H503RBTX.build.board=GENERIC_H503RBTX
GenH5.menu.pnum.GENERIC_H503RBTX.build.product_line=STM32H503xx
GenH5.menu.pnum.GENERIC_H503RBTX.build.variant=STM32H5xx/H503RBT
GenH5.menu.pnum.GENERIC_H503RBTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32H5xx/STM32H503.svd

# Generic H562RGTx
GenH5.menu.pnum.GENERIC_H562RGTX=Generic H562RGTx
GenH5.menu.pnum.GENERIC_H562RGTX.upload.maximum_size=1048576
GenH5.menu.pnum.GENERIC_H562RGTX.upload.maximum_data_size=655360
GenH5.menu.pnum.GENERIC_H562RGTX.build.board=GENERIC_H562RGTX
GenH5.menu.pnum.GENERIC_H562RGTX.build.product_line=STM32H562xx
GenH5.menu.pnum.GENERIC_H562RGTX.build.variant=STM32H5xx/H562R(G-I)T
GenH5.menu.pnum.GENERIC_H562RGTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32H5xx/STM32H562.svd

# Generic H562RITx
GenH5.menu.pnum.GENERIC_H562RITX=Generic H562RITx
GenH5.menu.pnum.GENERIC_H562RITX.upload.maximum_size=2097152
GenH5.menu.pnum.GENERIC_H562RITX.upload.maximum_data_size=655360
GenH5.menu.pnum.GENERIC_H562RITX.build.board=GENERIC_H562RITX
GenH5.menu.pnum.GENERIC_H562RITX.build.product_line=STM32H562xx
GenH5.menu.pnum.GENERIC_H562RITX.build.variant=STM32H5xx/H562R(G-I)T
GenH5.menu.pnum.GENERIC_H562RITX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32H5xx/STM32H562.svd

# Generic H563IIKxQ
GenH5.menu.pnum.GENERIC_H563IIKXQ=Generic H563IIKxQ
GenH5.menu.pnum.GENERIC_H563IIKXQ.upload.maximum_size=2097152
GenH5.menu.pnum.GENERIC_H563IIKXQ.upload.maximum_data_size=655360
GenH5.menu.pnum.GENERIC_H563IIKXQ.build.board=GENERIC_H563IIKXQ
GenH5.menu.pnum.GENERIC_H563IIKXQ.build.product_line=STM32H563xx
GenH5.menu.pnum.GENERIC_H563IIKXQ.build.variant=STM32H5xx/H563IIKxQ_H573IIKxQ
GenH5.menu.pnum.GENERIC_H563IIKXQ.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32H5xx/STM32H563.svd

# Generic H563RGTx
GenH5.menu.pnum.GENERIC_H563RGTX=Generic H563RGTx
GenH5.menu.pnum.GENERIC_H563RGTX.upload.maximum_size=1048576
GenH5.menu.pnum.GENERIC_H563RGTX.upload.maximum_data_size=655360
GenH5.menu.pnum.GENERIC_H563RGTX.build.board=GENERIC_H563RGTX
GenH5.menu.pnum.GENERIC_H563RGTX.build.product_line=STM32H563xx
GenH5.menu.pnum.GENERIC_H563RGTX.build.variant=STM32H5xx/H563R(G-I)T_H573RIT
GenH5.menu.pnum.GENERIC_H563RGTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32H5xx/STM32H563.svd

# Generic H563RITx
GenH5.menu.pnum.GENERIC_H563RITX=Generic H563RITx
GenH5.menu.pnum.GENERIC_H563RITX.upload.maximum_size=2097152
GenH5.menu.pnum.GENERIC_H563RITX.upload.maximum_data_size=655360
GenH5.menu.pnum.GENERIC_H563RITX.build.board=GENERIC_H563RITX
GenH5.menu.pnum.GENERIC_H563RITX.build.product_line=STM32H563xx
GenH5.menu.pnum.GENERIC_H563RITX.build.variant=STM32H5xx/H563R(G-I)T_H573RIT
GenH5.menu.pnum.GENERIC_H563RITX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32H5xx/STM32H563.svd

# Generic H563ZGTx
GenH5.menu.pnum.GENERIC_H563ZGTX=Generic H563ZGTx
GenH5.menu.pnum.GENERIC_H563ZGTX.upload.maximum_size=1048576
GenH5.menu.pnum.GENERIC_H563ZGTX.upload.maximum_data_size=655360
GenH5.menu.pnum.GENERIC_H563ZGTX.build.board=GENERIC_H563ZGTX
GenH5.menu.pnum.GENERIC_H563ZGTX.build.product_line=STM32H563xx
GenH5.menu.pnum.GENERIC_H563ZGTX.build.variant=STM32H5xx/H563Z(G-I)T_H573ZIT
GenH5.menu.pnum.GENERIC_H563ZGTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32H5xx/STM32H563.svd

# Generic H563ZITx
GenH5.menu.pnum.GENERIC_H563ZITX=Generic H563ZITx
GenH5.menu.pnum.GENERIC_H563ZITX.upload.maximum_size=2097152
GenH5.menu.pnum.GENERIC_H563ZITX.upload.maximum_data_size=655360
GenH5.menu.pnum.GENERIC_H563ZITX.build.board=GENERIC_H563ZITX
GenH5.menu.pnum.GENERIC_H563ZITX.build.product_line=STM32H563xx
GenH5.menu.pnum.GENERIC_H563ZITX.build.variant=STM32H5xx/H563Z(G-I)T_H573ZIT
GenH5.menu.pnum.GENERIC_H563ZITX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32H5xx/STM32H563.svd

# Generic H573IIKxQ
GenH5.menu.pnum.GENERIC_H573IIKXQ=Generic H573IIKxQ
GenH5.menu.pnum.GENERIC_H573IIKXQ.upload.maximum_size=2097152
GenH5.menu.pnum.GENERIC_H573IIKXQ.upload.maximum_data_size=655360
GenH5.menu.pnum.GENERIC_H573IIKXQ.build.board=GENERIC_H573IIKXQ
GenH5.menu.pnum.GENERIC_H573IIKXQ.build.product_line=STM32H573xx
GenH5.menu.pnum.GENERIC_H573IIKXQ.build.variant=STM32H5xx/H563IIKxQ_H573IIKxQ
GenH5.menu.pnum.GENERIC_H573IIKXQ.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32H5xx/STM32H573.svd

# Generic H573RITx
GenH5.menu.pnum.GENERIC_H573RITX=Generic H573RITx
GenH5.menu.pnum.GENERIC_H573RITX.upload.maximum_size=2097152
GenH5.menu.pnum.GENERIC_H573RITX.upload.maximum_data_size=655360
GenH5.menu.pnum.GENERIC_H573RITX.build.board=GENERIC_H573RITX
GenH5.menu.pnum.GENERIC_H573RITX.build.product_line=STM32H573xx
GenH5.menu.pnum.GENERIC_H573RITX.build.variant=STM32H5xx/H563R(G-I)T_H573RIT
GenH5.menu.pnum.GENERIC_H573RITX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32H5xx/STM32H573.svd

# Generic H573ZITx
GenH5.menu.pnum.GENERIC_H573ZITX=Generic H573ZITx
GenH5.menu.pnum.GENERIC_H573ZITX.upload.maximum_size=2097152
GenH5.menu.pnum.GENERIC_H573ZITX.upload.maximum_data_size=655360
GenH5.menu.pnum.GENERIC_H573ZITX.build.board=GENERIC_H573ZITX
GenH5.menu.pnum.GENERIC_H573ZITX.build.product_line=STM32H573xx
GenH5.menu.pnum.GENERIC_H573ZITX.build.variant=STM32H5xx/H563Z(G-I)T_H573ZIT
GenH5.menu.pnum.GENERIC_H573ZITX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32H5xx/STM32H573.svd

# Upload menu
GenH5.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenH5.menu.upload_method.swdMethod.upload.protocol=swd
GenH5.menu.upload_method.swdMethod.upload.options=
GenH5.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

