stm32duino/Arduino_Core_STM32/boards.txt
# Generic H747XIHx
GenH7.menu.pnum.GENERIC_H747XIHX=Generic H747XIHx
GenH7.menu.pnum.GENERIC_H747XIHX.upload.maximum_size=2097152
GenH7.menu.pnum.GENERIC_H747XIHX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H747XIHX.build.board=GENERIC_H747XIHX
GenH7.menu.pnum.GENERIC_H747XIHX.build.product_line=STM32H747xx
GenH7.menu.pnum.GENERIC_H747XIHX.build.variant=STM32H7xx/H742X(G-I)H_H743X(G-I)H_H745X(G-I)H_H747X(G-I)H_H750XBH_H753XIH_H755XIH_H757XIH
GenH7.menu.pnum.GENERIC_H747XIHX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32H7xx/STM32H747_CM7.svd

# Generic H750IBKx
GenH7.menu.pnum.GENERIC_H750IBKX=Generic H750IBKx
GenH7.menu.pnum.GENERIC_H750IBKX.upload.maximum_size=131072
GenH7.menu.pnum.GENERIC_H750IBKX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H750IBKX.build.board=GENERIC_H750IBKX
GenH7.menu.pnum.GENERIC_H750IBKX.build.product_line=STM32H750xx
GenH7.menu.pnum.GENERIC_H750IBKX.build.variant=STM32H7xx/H742I(G-I)(K-T)_H743I(G-I)(K-T)_H750IB(K-T)_H753II(K-T)
GenH7.menu.pnum.GENERIC_H750IBKX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32H7xx/STM32H750.svd

# Generic H750IBTx
GenH7.menu.pnum.GENERIC_H750IBTX=Generic H750IBTx
GenH7.menu.pnum.GENERIC_H750IBTX.upload.maximum_size=131072
GenH7.menu.pnum.GENERIC_H750IBTX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H750IBTX.build.board=GENERIC_H750IBTX
GenH7.menu.pnum.GENERIC_H750IBTX.build.product_line=STM32H750xx
GenH7.menu.pnum.GENERIC_H750IBTX.build.variant=STM32H7xx/H742I(G-I)(K-T)_H743I(G-I)(K-T)_H750IB(K-T)_H753II(K-T)
GenH7.menu.pnum.GENERIC_H750IBTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32H7xx/STM32H750.svd

# Generic H750VBTx
GenH7.menu.pnum.GENERIC_H750VBTX=Generic H750VBTx
GenH7.menu.pnum.GENERIC_H750VBTX.upload.maximum_size=131072
GenH7.menu.pnum.GENERIC_H750VBTX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H750VBTX.build.board=GENERIC_H750VBTX
GenH7.menu.pnum.GENERIC_H750VBTX.build.product_line=STM32H750xx
GenH7.menu.pnum.GENERIC_H750VBTX.build.variant=STM32H7xx/H742V(G-I)(H-T)_H743V(G-I)(H-T)_H750VBT_H753VI(H-T)
GenH7.menu.pnum.GENERIC_H750VBTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32H7xx/STM32H750.svd

# Generic H750XBHx
GenH7.menu.pnum.GENERIC_H750XBHX=Generic H750XBHx
GenH7.menu.pnum.GENERIC_H750XBHX.upload.maximum_size=131072
GenH7.menu.pnum.GENERIC_H750XBHX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H750XBHX.build.board=GENERIC_H750XBHX
GenH7.menu.pnum.GENERIC_H750XBHX.build.product_line=STM32H750xx
GenH7.menu.pnum.GENERIC_H750XBHX.build.variant=STM32H7xx/H742X(G-I)H_H743X(G-I)H_H745X(G-I)H_H747X(G-I)H_H750XBH_H753XIH_H755XIH_H757XIH
GenH7.menu.pnum.GENERIC_H750XBHX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32H7xx/STM32H750.svd

# Generic H750ZBTx
GenH7.menu.pnum.GENERIC_H750ZBTX=Generic H750ZBTx
GenH7.menu.pnum.GENERIC_H750ZBTX.upload.maximum_size=131072
GenH7.menu.pnum.GENERIC_H750ZBTX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H750ZBTX.build.board=GENERIC_H750ZBTX
GenH7.menu.pnum.GENERIC_H750ZBTX.build.product_line=STM32H750xx
GenH7.menu.pnum.GENERIC_H750ZBTX.build.variant=STM32H7xx/H742Z(G-I)T_H743Z(G-I)T_H747A(G-I)I_H747I(G-I)T_H750ZBT_H753ZIT_H757AII_H757IIT
GenH7.menu.pnum.GENERIC_H750ZBTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32H7xx/STM32H750.svd

# Generic H753IIKx
GenH7.menu.pnum.GENERIC_H753IIKX=Generic H753IIKx
GenH7.menu.pnum.GENERIC_H753IIKX.upload.maximum_size=2097152
GenH7.menu.pnum.GENERIC_H753IIKX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H753IIKX.build.board=GENERIC_H753IIKX
GenH7.menu.pnum.GENERIC_H753IIKX.build.product_line=STM32H753xx
GenH7.menu.pnum.GENERIC_H753IIKX.build.variant=STM32H7xx/H742I(G-I)(K-T)_H743I(G-I)(K-T)_H750IB(K-T)_H753II(K-T)
GenH7.menu.pnum.GENERIC_H753IIKX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32H7xx/STM32H753.svd

# Generic H753IITx
GenH7.menu.pnum.GENERIC_H753IITX=Generic H753IITx
GenH7.menu.pnum.GENERIC_H753IITX.upload.maximum_size=2097152
GenH7.menu.pnum.GENERIC_H753IITX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H753IITX.build.board=GENERIC_H753IITX
GenH7.menu.pnum.GENERIC_H753IITX.build.product_line=STM32H753xx
GenH7.menu.pnum.GENERIC_H753IITX.build.variant=STM32H7xx/H742I(G-I)(K-T)_H743I(G-I)(K-T)_H750IB(K-T)_H753II(K-T)
GenH7.menu.pnum.GENERIC_H753IITX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32H7xx/STM32H753.svd

# Generic H753VIHx
GenH7.menu.pnum.GENERIC_H753VIHX=Generic H753VIHx
GenH7.menu.pnum.GENERIC_H753VIHX.upload.maximum_size=2097152
GenH7.menu.pnum.GENERIC_H753VIHX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H753VIHX.build.board=GENERIC_H753VIHX
GenH7.menu.pnum.GENERIC_H753VIHX.build.product_line=STM32H753xx
GenH7.menu.pnum.GENERIC_H753VIHX.build.variant=STM32H7xx/H742V(G-I)(H-T)_H743V(G-I)(H-T)_H750VBT_H753VI(H-T)
GenH7.menu.pnum.GENERIC_H753VIHX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32H7xx/STM32H753.svd

# Generic H753VITx
GenH7.menu.pnum.GENERIC_H753VITX=Generic H753VITx
GenH7.menu.pnum.GENERIC_H753VITX.upload.maximum_size=2097152
GenH7.menu.pnum.GENERIC_H753VITX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H753VITX.build.board=GENERIC_H753VITX
GenH7.menu.pnum.GENERIC_H753VITX.build.product_line=STM32H753xx
GenH7.menu.pnum.GENERIC_H753VITX.build.variant=STM32H7xx/H742V(G-I)(H-T)_H743V(G-I)(H-T)_H750VBT_H753VI(H-T)
GenH7.menu.pnum.GENERIC_H753VITX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32H7xx/STM32H753.svd

# Generic H753XIHx
GenH7.menu.pnum.GENERIC_H753XIHX=Generic H753XIHx
GenH7.menu.pnum.GENERIC_H753XIHX.upload.maximum_size=2097152
GenH7.menu.pnum.GENERIC_H753XIHX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H753XIHX.build.board=GENERIC_H753XIHX
GenH7.menu.pnum.GENERIC_H753XIHX.build.product_line=STM32H753xx
GenH7.menu.pnum.GENERIC_H753XIHX.build.variant=STM32H7xx/H742X(G-I)H_H743X(G-I)H_H745X(G-I)H_H747X(G-I)H_H750XBH_H753XIH_H755XIH_H757XIH
GenH7.menu.pnum.GENERIC_H753XIHX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32H7xx/STM32H753.svd

# Generic H753ZITx
GenH7.menu.pnum.GENERIC_H753ZITX=Generic H753ZITx
GenH7.menu.pnum.GENERIC_H753ZITX.upload.maximum_size=2097152
GenH7.menu.pnum.GENERIC_H753ZITX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H753ZITX.build.board=GENERIC_H753ZITX
GenH7.menu.pnum.GENERIC_H753ZITX.build.product_line=STM32H753xx
GenH7.menu.pnum.GENERIC_H753ZITX.build.variant=STM32H7xx/H742Z(G-I)T_H743Z(G-I)T_H747A(G-I)I_H747I(G-I)T_H750ZBT_H753ZIT_H757AII_H757IIT
GenH7.menu.pnum.GENERIC_H753ZITX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32H7xx/STM32H753.svd

# Generic H755XIHx
GenH7.menu.pnum.GENERIC_H755XIHX=Generic H755XIHx
GenH7.menu.pnum.GENERIC_H755XIHX.upload.maximum_size=2097152
GenH7.menu.pnum.GENERIC_H755XIHX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H755XIHX.build.board=GENERIC_H755XIHX
GenH7.menu.pnum.GENERIC_H755XIHX.build.product_line=STM32H755xx
GenH7.menu.pnum.GENERIC_H755XIHX.build.variant=STM32H7xx/H742X(G-I)H_H743X(G-I)H_H745X(G-I)H_H747X(G-I)H_H750XBH_H753XIH_H755XIH_H757XIH
GenH7.menu.pnum.GENERIC_H755XIHX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32H7xx/STM32H755_CM7.svd

# Generic H757AIIx
GenH7.menu.pnum.GENERIC_H757AIIX=Generic H757AIIx
GenH7.menu.pnum.GENERIC_H757AIIX.upload.maximum_size=2097152
GenH7.menu.pnum.GENERIC_H757AIIX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H757AIIX.build.board=GENERIC_H757AIIX
GenH7.menu.pnum.GENERIC_H757AIIX.build.product_line=STM32H757xx
GenH7.menu.pnum.GENERIC_H757AIIX.build.variant=STM32H7xx/H742Z(G-I)T_H743Z(G-I)T_H747A(G-I)I_H747I(G-I)T_H750ZBT_H753ZIT_H757AII_H757IIT
GenH7.menu.pnum.GENERIC_H757AIIX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32H7xx/STM32H757_CM7.svd

# Generic H757IITx
GenH7.menu.pnum.GENERIC_H757IITX=Generic H757IITx
GenH7.menu.pnum.GENERIC_H757IITX.upload.maximum_size=2097152
GenH7.menu.pnum.GENERIC_H757IITX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H757IITX.build.board=GENERIC_H757IITX
GenH7.menu.pnum.GENERIC_H757IITX.build.product_line=STM32H757xx
GenH7.menu.pnum.GENERIC_H757IITX.build.variant=STM32H7xx/H742Z(G-I)T_H743Z(G-I)T_H747A(G-I)I_H747I(G-I)T_H750ZBT_H753ZIT_H757AII_H757IIT
GenH7.menu.pnum.GENERIC_H757IITX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32H7xx/STM32H757_CM7.svd

# Generic H757XIHx
GenH7.menu.pnum.GENERIC_H757XIHX=Generic H757XIHx
GenH7.menu.pnum.GENERIC_H757XIHX.upload.maximum_size=2097152
GenH7.menu.pnum.GENERIC_H757XIHX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H757XIHX.build.board=GENERIC_H757XIHX
GenH7.menu.pnum.GENERIC_H757XIHX.build.product_line=STM32H757xx
GenH7.menu.pnum.GENERIC_H757XIHX.build.variant=STM32H7xx/H742X(G-I)H_H743X(G-I)H_H745X(G-I)H_H747X(G-I)H_H750XBH_H753XIH_H755XIH_H757XIH
GenH7.menu.pnum.GENERIC_H757XIHX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32H7xx/STM32H757_CM7.svd

# Generic H7A3VGHx
GenH7.menu.pnum.GENERIC_H7A3VGHX=Generic H7A3VGHx
GenH7.menu.pnum.GENERIC_H7A3VGHX.upload.maximum_size=1048576
GenH7.menu.pnum.GENERIC_H7A3VGHX.upload.maximum_data_size=1048576
GenH7.menu.pnum.GENERIC_H7A3VGHX.build.board=GENERIC_H7A3VGHX
GenH7.menu.pnum.GENERIC_H7A3VGHX.build.product_line=STM32H7A3xx
GenH7.menu.pnum.GENERIC_H7A3VGHX.build.variant=STM32H7xx/H7A3V(G-I)(H-T)_H7B0VBT_H7B3VI(H-T)
GenH7.menu.pnum.GENERIC_H7A3VGHX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32H7xx/STM32H7A3.svd

# Generic H7A3VIHx
GenH7.menu.pnum.GENERIC_H7A3VIHX=Generic H7A3VIHx
GenH7.menu.pnum.GENERIC_H7A3VIHX.upload.maximum_size=2097152
GenH7.menu.pnum.GENERIC_H7A3VIHX.upload.maximum_data_size=1048576
GenH7.menu.pnum.GENERIC_H7A3VIHX.build.board=GENERIC_H7A3VIHX
GenH7.menu.pnum.GENERIC_H7A3VIHX.build.product_line=STM32H7A3xx
GenH7.menu.pnum.GENERIC_H7A3VIHX.build.variant=STM32H7xx/H7A3V(G-I)(H-T)_H7B0VBT_H7B3VI(H-T)
GenH7.menu.pnum.GENERIC_H7A3VIHX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32H7xx/STM32H7A3.svd

# Generic H7A3VGTx
GenH7.menu.pnum.GENERIC_H7A3VGTX=Generic H7A3VGTx
GenH7.menu.pnum.GENERIC_H7A3VGTX.upload.maximum_size=1048576
GenH7.menu.pnum.GENERIC_H7A3VGTX.upload.maximum_data_size=1048576
GenH7.menu.pnum.GENERIC_H7A3VGTX.build.board=GENERIC_H7A3VGTX
GenH7.menu.pnum.GENERIC_H7A3VGTX.build.product_line=STM32H7A3xx
GenH7.menu.pnum.GENERIC_H7A3VGTX.build.variant=STM32H7xx/H7A3V(G-I)(H-T)_H7B0VBT_H7B3VI(H-T)
GenH7.menu.pnum.GENERIC_H7A3VGTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32H7xx/STM32H7A3.svd

