stm32duino/Arduino_Core_STM32/boards.txt
# Generic L062K8Tx
GenL0.menu.pnum.GENERIC_L062K8TX=Generic L062K8Tx
GenL0.menu.pnum.GENERIC_L062K8TX.upload.maximum_size=65536
GenL0.menu.pnum.GENERIC_L062K8TX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L062K8TX.build.board=GENERIC_L062K8TX
GenL0.menu.pnum.GENERIC_L062K8TX.build.product_line=STM32L062xx
GenL0.menu.pnum.GENERIC_L062K8TX.build.variant=STM32L0xx/L052K(6-8)T_L062K8T
GenL0.menu.pnum.GENERIC_L062K8TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L062.svd

# Generic L063C8Tx
GenL0.menu.pnum.GENERIC_L063C8TX=Generic L063C8Tx
GenL0.menu.pnum.GENERIC_L063C8TX.upload.maximum_size=65536
GenL0.menu.pnum.GENERIC_L063C8TX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L063C8TX.build.board=GENERIC_L063C8TX
GenL0.menu.pnum.GENERIC_L063C8TX.build.product_line=STM32L063xx
GenL0.menu.pnum.GENERIC_L063C8TX.build.variant=STM32L0xx/L052C(6-8)(T-U)_L053C(6-8)(T-U)_L062C8U_L063C8(T-U)
GenL0.menu.pnum.GENERIC_L063C8TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L063.svd

# Generic L063C8Ux
GenL0.menu.pnum.GENERIC_L063C8UX=Generic L063C8Ux
GenL0.menu.pnum.GENERIC_L063C8UX.upload.maximum_size=65536
GenL0.menu.pnum.GENERIC_L063C8UX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L063C8UX.build.board=GENERIC_L063C8UX
GenL0.menu.pnum.GENERIC_L063C8UX.build.product_line=STM32L063xx
GenL0.menu.pnum.GENERIC_L063C8UX.build.variant=STM32L0xx/L052C(6-8)(T-U)_L053C(6-8)(T-U)_L062C8U_L063C8(T-U)
GenL0.menu.pnum.GENERIC_L063C8UX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L063.svd

# Generic L063R8Tx
GenL0.menu.pnum.GENERIC_L063R8TX=Generic L063R8Tx
GenL0.menu.pnum.GENERIC_L063R8TX.upload.maximum_size=65536
GenL0.menu.pnum.GENERIC_L063R8TX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L063R8TX.build.board=GENERIC_L063R8TX
GenL0.menu.pnum.GENERIC_L063R8TX.build.product_line=STM32L063xx
GenL0.menu.pnum.GENERIC_L063R8TX.build.variant=STM32L0xx/L052R(6-8)T_L053R(6-8)T_L063R8T
GenL0.menu.pnum.GENERIC_L063R8TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L063.svd

# Generic L072CBTx
GenL0.menu.pnum.GENERIC_L072CBTX=Generic L072CBTx
GenL0.menu.pnum.GENERIC_L072CBTX.upload.maximum_size=131072
GenL0.menu.pnum.GENERIC_L072CBTX.upload.maximum_data_size=20480
GenL0.menu.pnum.GENERIC_L072CBTX.build.board=GENERIC_L072CBTX
GenL0.menu.pnum.GENERIC_L072CBTX.build.product_line=STM32L072xx
GenL0.menu.pnum.GENERIC_L072CBTX.build.variant=STM32L0xx/L072C(B-Z)(T-U)_L073C(B-Z)(T-U)_L082CZU_L083CBT_L083CZ(T-U)
GenL0.menu.pnum.GENERIC_L072CBTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L0x2.svd

# Generic L072CBUx
GenL0.menu.pnum.GENERIC_L072CBUX=Generic L072CBUx
GenL0.menu.pnum.GENERIC_L072CBUX.upload.maximum_size=131072
GenL0.menu.pnum.GENERIC_L072CBUX.upload.maximum_data_size=20480
GenL0.menu.pnum.GENERIC_L072CBUX.build.board=GENERIC_L072CBUX
GenL0.menu.pnum.GENERIC_L072CBUX.build.product_line=STM32L072xx
GenL0.menu.pnum.GENERIC_L072CBUX.build.variant=STM32L0xx/L072C(B-Z)(T-U)_L073C(B-Z)(T-U)_L082CZU_L083CBT_L083CZ(T-U)
GenL0.menu.pnum.GENERIC_L072CBUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L0x2.svd

# Generic L072CBYx
GenL0.menu.pnum.GENERIC_L072CBYX=Generic L072CBYx
GenL0.menu.pnum.GENERIC_L072CBYX.upload.maximum_size=131072
GenL0.menu.pnum.GENERIC_L072CBYX.upload.maximum_data_size=20480
GenL0.menu.pnum.GENERIC_L072CBYX.build.board=GENERIC_L072CBYX
GenL0.menu.pnum.GENERIC_L072CBYX.build.product_line=STM32L072xx
GenL0.menu.pnum.GENERIC_L072CBYX.build.variant=STM32L0xx/L072CBY_L072CZ(E-Y)_L073CZY_L082CZY
GenL0.menu.pnum.GENERIC_L072CBYX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L0x2.svd

# Generic L072CZEx
GenL0.menu.pnum.GENERIC_L072CZEX=Generic L072CZEx
GenL0.menu.pnum.GENERIC_L072CZEX.upload.maximum_size=196608
GenL0.menu.pnum.GENERIC_L072CZEX.upload.maximum_data_size=20480
GenL0.menu.pnum.GENERIC_L072CZEX.build.board=GENERIC_L072CZEX
GenL0.menu.pnum.GENERIC_L072CZEX.build.product_line=STM32L072xx
GenL0.menu.pnum.GENERIC_L072CZEX.build.variant=STM32L0xx/L072CBY_L072CZ(E-Y)_L073CZY_L082CZY
GenL0.menu.pnum.GENERIC_L072CZEX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L0x2.svd

# Generic L072CZTx
GenL0.menu.pnum.GENERIC_L072CZTX=Generic L072CZTx
GenL0.menu.pnum.GENERIC_L072CZTX.upload.maximum_size=196608
GenL0.menu.pnum.GENERIC_L072CZTX.upload.maximum_data_size=20480
GenL0.menu.pnum.GENERIC_L072CZTX.build.board=GENERIC_L072CZTX
GenL0.menu.pnum.GENERIC_L072CZTX.build.product_line=STM32L072xx
GenL0.menu.pnum.GENERIC_L072CZTX.build.variant=STM32L0xx/L072C(B-Z)(T-U)_L073C(B-Z)(T-U)_L082CZU_L083CBT_L083CZ(T-U)
GenL0.menu.pnum.GENERIC_L072CZTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L0x2.svd

# Generic L072CZUx
GenL0.menu.pnum.GENERIC_L072CZUX=Generic L072CZUx
GenL0.menu.pnum.GENERIC_L072CZUX.upload.maximum_size=196608
GenL0.menu.pnum.GENERIC_L072CZUX.upload.maximum_data_size=20480
GenL0.menu.pnum.GENERIC_L072CZUX.build.board=GENERIC_L072CZUX
GenL0.menu.pnum.GENERIC_L072CZUX.build.product_line=STM32L072xx
GenL0.menu.pnum.GENERIC_L072CZUX.build.variant=STM32L0xx/L072C(B-Z)(T-U)_L073C(B-Z)(T-U)_L082CZU_L083CBT_L083CZ(T-U)
GenL0.menu.pnum.GENERIC_L072CZUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L0x2.svd

# Generic L072CZYx
GenL0.menu.pnum.GENERIC_L072CZYX=Generic L072CZYx
GenL0.menu.pnum.GENERIC_L072CZYX.upload.maximum_size=196608
GenL0.menu.pnum.GENERIC_L072CZYX.upload.maximum_data_size=20480
GenL0.menu.pnum.GENERIC_L072CZYX.build.board=GENERIC_L072CZYX
GenL0.menu.pnum.GENERIC_L072CZYX.build.product_line=STM32L072xx
GenL0.menu.pnum.GENERIC_L072CZYX.build.variant=STM32L0xx/L072CBY_L072CZ(E-Y)_L073CZY_L082CZY
GenL0.menu.pnum.GENERIC_L072CZYX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L0x2.svd

# Generic L072KBTx
GenL0.menu.pnum.GENERIC_L072KBTX=Generic L072KBTx
GenL0.menu.pnum.GENERIC_L072KBTX.upload.maximum_size=131072
GenL0.menu.pnum.GENERIC_L072KBTX.upload.maximum_data_size=20480
GenL0.menu.pnum.GENERIC_L072KBTX.build.board=GENERIC_L072KBTX
GenL0.menu.pnum.GENERIC_L072KBTX.build.product_line=STM32L072xx
GenL0.menu.pnum.GENERIC_L072KBTX.build.variant=STM32L0xx/L072K(B-Z)T_L082K(B-Z)T
GenL0.menu.pnum.GENERIC_L072KBTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L0x2.svd

# Generic L072KBUx
GenL0.menu.pnum.GENERIC_L072KBUX=Generic L072KBUx
GenL0.menu.pnum.GENERIC_L072KBUX.upload.maximum_size=131072
GenL0.menu.pnum.GENERIC_L072KBUX.upload.maximum_data_size=20480
GenL0.menu.pnum.GENERIC_L072KBUX.build.board=GENERIC_L072KBUX
GenL0.menu.pnum.GENERIC_L072KBUX.build.product_line=STM32L072xx
GenL0.menu.pnum.GENERIC_L072KBUX.build.variant=STM32L0xx/L072K(B-Z)U_L082K(B-Z)U
GenL0.menu.pnum.GENERIC_L072KBUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L0x2.svd

# Generic L072KZTx
GenL0.menu.pnum.GENERIC_L072KZTX=Generic L072KZTx
GenL0.menu.pnum.GENERIC_L072KZTX.upload.maximum_size=196608
GenL0.menu.pnum.GENERIC_L072KZTX.upload.maximum_data_size=20480
GenL0.menu.pnum.GENERIC_L072KZTX.build.board=GENERIC_L072KZTX
GenL0.menu.pnum.GENERIC_L072KZTX.build.product_line=STM32L072xx
GenL0.menu.pnum.GENERIC_L072KZTX.build.variant=STM32L0xx/L072K(B-Z)T_L082K(B-Z)T
GenL0.menu.pnum.GENERIC_L072KZTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L0x2.svd

# Generic L072KZUx
GenL0.menu.pnum.GENERIC_L072KZUX=Generic L072KZUx
GenL0.menu.pnum.GENERIC_L072KZUX.upload.maximum_size=196608
GenL0.menu.pnum.GENERIC_L072KZUX.upload.maximum_data_size=20480
GenL0.menu.pnum.GENERIC_L072KZUX.build.board=GENERIC_L072KZUX
GenL0.menu.pnum.GENERIC_L072KZUX.build.product_line=STM32L072xx
GenL0.menu.pnum.GENERIC_L072KZUX.build.variant=STM32L0xx/L072K(B-Z)U_L082K(B-Z)U
GenL0.menu.pnum.GENERIC_L072KZUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L0x2.svd

# Generic L072RBHx
GenL0.menu.pnum.GENERIC_L072RBHX=Generic L072RBHx
GenL0.menu.pnum.GENERIC_L072RBHX.upload.maximum_size=131072
GenL0.menu.pnum.GENERIC_L072RBHX.upload.maximum_data_size=20480
GenL0.menu.pnum.GENERIC_L072RBHX.build.board=GENERIC_L072RBHX
GenL0.menu.pnum.GENERIC_L072RBHX.build.product_line=STM32L072xx
GenL0.menu.pnum.GENERIC_L072RBHX.build.variant=STM32L0xx/L072R(B-Z)(H-I)_L073RBH_L073RZ(H-I)_L083R(B-Z)H
GenL0.menu.pnum.GENERIC_L072RBHX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L0x2.svd

# Generic L072RBIx
GenL0.menu.pnum.GENERIC_L072RBIX=Generic L072RBIx
GenL0.menu.pnum.GENERIC_L072RBIX.upload.maximum_size=131072
GenL0.menu.pnum.GENERIC_L072RBIX.upload.maximum_data_size=20480
GenL0.menu.pnum.GENERIC_L072RBIX.build.board=GENERIC_L072RBIX
GenL0.menu.pnum.GENERIC_L072RBIX.build.product_line=STM32L072xx
GenL0.menu.pnum.GENERIC_L072RBIX.build.variant=STM32L0xx/L072R(B-Z)(H-I)_L073RBH_L073RZ(H-I)_L083R(B-Z)H
GenL0.menu.pnum.GENERIC_L072RBIX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L0x2.svd

# Generic L072RBTx
GenL0.menu.pnum.GENERIC_L072RBTX=Generic L072RBTx
GenL0.menu.pnum.GENERIC_L072RBTX.upload.maximum_size=131072
GenL0.menu.pnum.GENERIC_L072RBTX.upload.maximum_data_size=20480
GenL0.menu.pnum.GENERIC_L072RBTX.build.board=GENERIC_L072RBTX
GenL0.menu.pnum.GENERIC_L072RBTX.build.product_line=STM32L072xx
GenL0.menu.pnum.GENERIC_L072RBTX.build.variant=STM32L0xx/L072R(B-Z)T_L073R(B-Z)T_L083R(B-Z)T
GenL0.menu.pnum.GENERIC_L072RBTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L0x2.svd

# Generic L072RZHx
GenL0.menu.pnum.GENERIC_L072RZHX=Generic L072RZHx
GenL0.menu.pnum.GENERIC_L072RZHX.upload.maximum_size=196608
GenL0.menu.pnum.GENERIC_L072RZHX.upload.maximum_data_size=20480
GenL0.menu.pnum.GENERIC_L072RZHX.build.board=GENERIC_L072RZHX
GenL0.menu.pnum.GENERIC_L072RZHX.build.product_line=STM32L072xx
GenL0.menu.pnum.GENERIC_L072RZHX.build.variant=STM32L0xx/L072R(B-Z)(H-I)_L073RBH_L073RZ(H-I)_L083R(B-Z)H
GenL0.menu.pnum.GENERIC_L072RZHX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L0x2.svd

# Generic L072RZIx
GenL0.menu.pnum.GENERIC_L072RZIX=Generic L072RZIx
GenL0.menu.pnum.GENERIC_L072RZIX.upload.maximum_size=196608
GenL0.menu.pnum.GENERIC_L072RZIX.upload.maximum_data_size=20480
GenL0.menu.pnum.GENERIC_L072RZIX.build.board=GENERIC_L072RZIX
GenL0.menu.pnum.GENERIC_L072RZIX.build.product_line=STM32L072xx
GenL0.menu.pnum.GENERIC_L072RZIX.build.variant=STM32L0xx/L072R(B-Z)(H-I)_L073RBH_L073RZ(H-I)_L083R(B-Z)H
GenL0.menu.pnum.GENERIC_L072RZIX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L0x2.svd

# Generic L072RZTx
GenL0.menu.pnum.GENERIC_L072RZTX=Generic L072RZTx
GenL0.menu.pnum.GENERIC_L072RZTX.upload.maximum_size=196608
GenL0.menu.pnum.GENERIC_L072RZTX.upload.maximum_data_size=20480
GenL0.menu.pnum.GENERIC_L072RZTX.build.board=GENERIC_L072RZTX
GenL0.menu.pnum.GENERIC_L072RZTX.build.product_line=STM32L072xx
GenL0.menu.pnum.GENERIC_L072RZTX.build.variant=STM32L0xx/L072R(B-Z)T_L073R(B-Z)T_L083R(B-Z)T
GenL0.menu.pnum.GENERIC_L072RZTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L0x2.svd

# Generic L072VBIx
GenL0.menu.pnum.GENERIC_L072VBIX=Generic L072VBIx
GenL0.menu.pnum.GENERIC_L072VBIX.upload.maximum_size=131072
GenL0.menu.pnum.GENERIC_L072VBIX.upload.maximum_data_size=20480
GenL0.menu.pnum.GENERIC_L072VBIX.build.board=GENERIC_L072VBIX
GenL0.menu.pnum.GENERIC_L072VBIX.build.product_line=STM32L072xx
GenL0.menu.pnum.GENERIC_L072VBIX.build.variant=STM32L0xx/L072V(8-B-Z)(I-T)_L073V(8-B-Z)(I-T)_L083V(8-B-Z)(I-T)
GenL0.menu.pnum.GENERIC_L072VBIX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L0x2.svd

# Generic L072VZIx
GenL0.menu.pnum.GENERIC_L072VZIX=Generic L072VZIx
GenL0.menu.pnum.GENERIC_L072VZIX.upload.maximum_size=196608
GenL0.menu.pnum.GENERIC_L072VZIX.upload.maximum_data_size=20480
GenL0.menu.pnum.GENERIC_L072VZIX.build.board=GENERIC_L072VZIX
GenL0.menu.pnum.GENERIC_L072VZIX.build.product_line=STM32L072xx
GenL0.menu.pnum.GENERIC_L072VZIX.build.variant=STM32L0xx/L072V(8-B-Z)(I-T)_L073V(8-B-Z)(I-T)_L083V(8-B-Z)(I-T)
GenL0.menu.pnum.GENERIC_L072VZIX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L0x2.svd

# Generic L072VBTx
GenL0.menu.pnum.GENERIC_L072VBTX=Generic L072VBTx
GenL0.menu.pnum.GENERIC_L072VBTX.upload.maximum_size=131072
GenL0.menu.pnum.GENERIC_L072VBTX.upload.maximum_data_size=20480
GenL0.menu.pnum.GENERIC_L072VBTX.build.board=GENERIC_L072VBTX
GenL0.menu.pnum.GENERIC_L072VBTX.build.product_line=STM32L072xx
GenL0.menu.pnum.GENERIC_L072VBTX.build.variant=STM32L0xx/L072V(8-B-Z)(I-T)_L073V(8-B-Z)(I-T)_L083V(8-B-Z)(I-T)
GenL0.menu.pnum.GENERIC_L072VBTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L0x2.svd

# Generic L072VZTx
GenL0.menu.pnum.GENERIC_L072VZTX=Generic L072VZTx
GenL0.menu.pnum.GENERIC_L072VZTX.upload.maximum_size=196608
GenL0.menu.pnum.GENERIC_L072VZTX.upload.maximum_data_size=20480
GenL0.menu.pnum.GENERIC_L072VZTX.build.board=GENERIC_L072VZTX
GenL0.menu.pnum.GENERIC_L072VZTX.build.product_line=STM32L072xx
GenL0.menu.pnum.GENERIC_L072VZTX.build.variant=STM32L0xx/L072V(8-B-Z)(I-T)_L073V(8-B-Z)(I-T)_L083V(8-B-Z)(I-T)
GenL0.menu.pnum.GENERIC_L072VZTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L0x2.svd

# Generic L072V8Ix
GenL0.menu.pnum.GENERIC_L072V8IX=Generic L072V8Ix
GenL0.menu.pnum.GENERIC_L072V8IX.upload.maximum_size=65536
GenL0.menu.pnum.GENERIC_L072V8IX.upload.maximum_data_size=20480
GenL0.menu.pnum.GENERIC_L072V8IX.build.board=GENERIC_L072V8IX
GenL0.menu.pnum.GENERIC_L072V8IX.build.product_line=STM32L072xx
GenL0.menu.pnum.GENERIC_L072V8IX.build.variant=STM32L0xx/L072V(8-B-Z)(I-T)_L073V(8-B-Z)(I-T)_L083V(8-B-Z)(I-T)
GenL0.menu.pnum.GENERIC_L072V8IX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L0x2.svd

# Generic L072V8Tx
GenL0.menu.pnum.GENERIC_L072V8TX=Generic L072V8Tx
GenL0.menu.pnum.GENERIC_L072V8TX.upload.maximum_size=65536
GenL0.menu.pnum.GENERIC_L072V8TX.upload.maximum_data_size=20480
GenL0.menu.pnum.GENERIC_L072V8TX.build.board=GENERIC_L072V8TX
GenL0.menu.pnum.GENERIC_L072V8TX.build.product_line=STM32L072xx
GenL0.menu.pnum.GENERIC_L072V8TX.build.variant=STM32L0xx/L072V(8-B-Z)(I-T)_L073V(8-B-Z)(I-T)_L083V(8-B-Z)(I-T)
GenL0.menu.pnum.GENERIC_L072V8TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L0x2.svd

