stm32duino/Arduino_Core_STM32/boards.txt
# Generic L082CZUx
GenL0.menu.pnum.GENERIC_L082CZUX=Generic L082CZUx
GenL0.menu.pnum.GENERIC_L082CZUX.upload.maximum_size=196608
GenL0.menu.pnum.GENERIC_L082CZUX.upload.maximum_data_size=20480
GenL0.menu.pnum.GENERIC_L082CZUX.build.board=GENERIC_L082CZUX
GenL0.menu.pnum.GENERIC_L082CZUX.build.product_line=STM32L082xx
GenL0.menu.pnum.GENERIC_L082CZUX.build.variant=STM32L0xx/L072C(B-Z)(T-U)_L073C(B-Z)(T-U)_L082CZU_L083CBT_L083CZ(T-U)
GenL0.menu.pnum.GENERIC_L082CZUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L0x2.svd

# Generic L082CZYx
GenL0.menu.pnum.GENERIC_L082CZYX=Generic L082CZYx
GenL0.menu.pnum.GENERIC_L082CZYX.upload.maximum_size=196608
GenL0.menu.pnum.GENERIC_L082CZYX.upload.maximum_data_size=20480
GenL0.menu.pnum.GENERIC_L082CZYX.build.board=GENERIC_L082CZYX
GenL0.menu.pnum.GENERIC_L082CZYX.build.product_line=STM32L082xx
GenL0.menu.pnum.GENERIC_L082CZYX.build.variant=STM32L0xx/L072CBY_L072CZ(E-Y)_L073CZY_L082CZY
GenL0.menu.pnum.GENERIC_L082CZYX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L0x2.svd

# Generic L082KBTx
GenL0.menu.pnum.GENERIC_L082KBTX=Generic L082KBTx
GenL0.menu.pnum.GENERIC_L082KBTX.upload.maximum_size=131072
GenL0.menu.pnum.GENERIC_L082KBTX.upload.maximum_data_size=20480
GenL0.menu.pnum.GENERIC_L082KBTX.build.board=GENERIC_L082KBTX
GenL0.menu.pnum.GENERIC_L082KBTX.build.product_line=STM32L082xx
GenL0.menu.pnum.GENERIC_L082KBTX.build.variant=STM32L0xx/L072K(B-Z)T_L082K(B-Z)T
GenL0.menu.pnum.GENERIC_L082KBTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L0x2.svd

# Generic L082KBUx
GenL0.menu.pnum.GENERIC_L082KBUX=Generic L082KBUx
GenL0.menu.pnum.GENERIC_L082KBUX.upload.maximum_size=131072
GenL0.menu.pnum.GENERIC_L082KBUX.upload.maximum_data_size=20480
GenL0.menu.pnum.GENERIC_L082KBUX.build.board=GENERIC_L082KBUX
GenL0.menu.pnum.GENERIC_L082KBUX.build.product_line=STM32L082xx
GenL0.menu.pnum.GENERIC_L082KBUX.build.variant=STM32L0xx/L072K(B-Z)U_L082K(B-Z)U
GenL0.menu.pnum.GENERIC_L082KBUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L0x2.svd

# Generic L082KZTx
GenL0.menu.pnum.GENERIC_L082KZTX=Generic L082KZTx
GenL0.menu.pnum.GENERIC_L082KZTX.upload.maximum_size=196608
GenL0.menu.pnum.GENERIC_L082KZTX.upload.maximum_data_size=20480
GenL0.menu.pnum.GENERIC_L082KZTX.build.board=GENERIC_L082KZTX
GenL0.menu.pnum.GENERIC_L082KZTX.build.product_line=STM32L082xx
GenL0.menu.pnum.GENERIC_L082KZTX.build.variant=STM32L0xx/L072K(B-Z)T_L082K(B-Z)T
GenL0.menu.pnum.GENERIC_L082KZTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L0x2.svd

# Generic L082KZUx
GenL0.menu.pnum.GENERIC_L082KZUX=Generic L082KZUx
GenL0.menu.pnum.GENERIC_L082KZUX.upload.maximum_size=196608
GenL0.menu.pnum.GENERIC_L082KZUX.upload.maximum_data_size=20480
GenL0.menu.pnum.GENERIC_L082KZUX.build.board=GENERIC_L082KZUX
GenL0.menu.pnum.GENERIC_L082KZUX.build.product_line=STM32L082xx
GenL0.menu.pnum.GENERIC_L082KZUX.build.variant=STM32L0xx/L072K(B-Z)U_L082K(B-Z)U
GenL0.menu.pnum.GENERIC_L082KZUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L0x2.svd

# Generic L083CBTx
GenL0.menu.pnum.GENERIC_L083CBTX=Generic L083CBTx
GenL0.menu.pnum.GENERIC_L083CBTX.upload.maximum_size=131072
GenL0.menu.pnum.GENERIC_L083CBTX.upload.maximum_data_size=20480
GenL0.menu.pnum.GENERIC_L083CBTX.build.board=GENERIC_L083CBTX
GenL0.menu.pnum.GENERIC_L083CBTX.build.product_line=STM32L083xx
GenL0.menu.pnum.GENERIC_L083CBTX.build.variant=STM32L0xx/L072C(B-Z)(T-U)_L073C(B-Z)(T-U)_L082CZU_L083CBT_L083CZ(T-U)
GenL0.menu.pnum.GENERIC_L083CBTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L0x3.svd

# Generic L083CZTx
GenL0.menu.pnum.GENERIC_L083CZTX=Generic L083CZTx
GenL0.menu.pnum.GENERIC_L083CZTX.upload.maximum_size=196608
GenL0.menu.pnum.GENERIC_L083CZTX.upload.maximum_data_size=20480
GenL0.menu.pnum.GENERIC_L083CZTX.build.board=GENERIC_L083CZTX
GenL0.menu.pnum.GENERIC_L083CZTX.build.product_line=STM32L083xx
GenL0.menu.pnum.GENERIC_L083CZTX.build.variant=STM32L0xx/L072C(B-Z)(T-U)_L073C(B-Z)(T-U)_L082CZU_L083CBT_L083CZ(T-U)
GenL0.menu.pnum.GENERIC_L083CZTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L0x3.svd

# Generic L083CZUx
GenL0.menu.pnum.GENERIC_L083CZUX=Generic L083CZUx
GenL0.menu.pnum.GENERIC_L083CZUX.upload.maximum_size=196608
GenL0.menu.pnum.GENERIC_L083CZUX.upload.maximum_data_size=20480
GenL0.menu.pnum.GENERIC_L083CZUX.build.board=GENERIC_L083CZUX
GenL0.menu.pnum.GENERIC_L083CZUX.build.product_line=STM32L083xx
GenL0.menu.pnum.GENERIC_L083CZUX.build.variant=STM32L0xx/L072C(B-Z)(T-U)_L073C(B-Z)(T-U)_L082CZU_L083CBT_L083CZ(T-U)
GenL0.menu.pnum.GENERIC_L083CZUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L0x3.svd

# Generic L083RBHx
GenL0.menu.pnum.GENERIC_L083RBHX=Generic L083RBHx
GenL0.menu.pnum.GENERIC_L083RBHX.upload.maximum_size=131072
GenL0.menu.pnum.GENERIC_L083RBHX.upload.maximum_data_size=20480
GenL0.menu.pnum.GENERIC_L083RBHX.build.board=GENERIC_L083RBHX
GenL0.menu.pnum.GENERIC_L083RBHX.build.product_line=STM32L083xx
GenL0.menu.pnum.GENERIC_L083RBHX.build.variant=STM32L0xx/L072R(B-Z)(H-I)_L073RBH_L073RZ(H-I)_L083R(B-Z)H
GenL0.menu.pnum.GENERIC_L083RBHX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L0x3.svd

# Generic L083RBTx
GenL0.menu.pnum.GENERIC_L083RBTX=Generic L083RBTx
GenL0.menu.pnum.GENERIC_L083RBTX.upload.maximum_size=131072
GenL0.menu.pnum.GENERIC_L083RBTX.upload.maximum_data_size=20480
GenL0.menu.pnum.GENERIC_L083RBTX.build.board=GENERIC_L083RBTX
GenL0.menu.pnum.GENERIC_L083RBTX.build.product_line=STM32L083xx
GenL0.menu.pnum.GENERIC_L083RBTX.build.variant=STM32L0xx/L072R(B-Z)T_L073R(B-Z)T_L083R(B-Z)T
GenL0.menu.pnum.GENERIC_L083RBTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L0x3.svd

# Generic L083RZHx
GenL0.menu.pnum.GENERIC_L083RZHX=Generic L083RZHx
GenL0.menu.pnum.GENERIC_L083RZHX.upload.maximum_size=196608
GenL0.menu.pnum.GENERIC_L083RZHX.upload.maximum_data_size=20480
GenL0.menu.pnum.GENERIC_L083RZHX.build.board=GENERIC_L083RZHX
GenL0.menu.pnum.GENERIC_L083RZHX.build.product_line=STM32L083xx
GenL0.menu.pnum.GENERIC_L083RZHX.build.variant=STM32L0xx/L072R(B-Z)(H-I)_L073RBH_L073RZ(H-I)_L083R(B-Z)H
GenL0.menu.pnum.GENERIC_L083RZHX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L0x3.svd

# Generic L083RZTx
GenL0.menu.pnum.GENERIC_L083RZTX=Generic L083RZTx
GenL0.menu.pnum.GENERIC_L083RZTX.upload.maximum_size=196608
GenL0.menu.pnum.GENERIC_L083RZTX.upload.maximum_data_size=20480
GenL0.menu.pnum.GENERIC_L083RZTX.build.board=GENERIC_L083RZTX
GenL0.menu.pnum.GENERIC_L083RZTX.build.product_line=STM32L083xx
GenL0.menu.pnum.GENERIC_L083RZTX.build.variant=STM32L0xx/L072R(B-Z)T_L073R(B-Z)T_L083R(B-Z)T
GenL0.menu.pnum.GENERIC_L083RZTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L0x3.svd

