stm32duino/Arduino_Core_STM32/boards.txt
# Generic L151C6TxA
GenL1.menu.pnum.GENERIC_L151C6TXA=Generic L151C6TxA
GenL1.menu.pnum.GENERIC_L151C6TXA.upload.maximum_size=32768
GenL1.menu.pnum.GENERIC_L151C6TXA.upload.maximum_data_size=16384
GenL1.menu.pnum.GENERIC_L151C6TXA.build.board=GENERIC_L151C6TXA
GenL1.menu.pnum.GENERIC_L151C6TXA.build.product_line=STM32L151xBA
GenL1.menu.pnum.GENERIC_L151C6TXA.build.variant=STM32L1xx/L100C6Ux(A)_L151C(6-8-B)(T-U)x(A)_L152C(6-8-B)(T-U)x(A)
GenL1.menu.pnum.GENERIC_L151C6TXA.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L1xx/STM32L151.svd

# Generic L151C8TxA
GenL1.menu.pnum.GENERIC_L151C8TXA=Generic L151C8TxA
GenL1.menu.pnum.GENERIC_L151C8TXA.upload.maximum_size=65536
GenL1.menu.pnum.GENERIC_L151C8TXA.upload.maximum_data_size=32768
GenL1.menu.pnum.GENERIC_L151C8TXA.build.board=GENERIC_L151C8TXA
GenL1.menu.pnum.GENERIC_L151C8TXA.build.product_line=STM32L151xBA
GenL1.menu.pnum.GENERIC_L151C8TXA.build.variant=STM32L1xx/L100C6Ux(A)_L151C(6-8-B)(T-U)x(A)_L152C(6-8-B)(T-U)x(A)
GenL1.menu.pnum.GENERIC_L151C8TXA.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L1xx/STM32L151.svd

# Generic L151CBTxA
GenL1.menu.pnum.GENERIC_L151CBTXA=Generic L151CBTxA
GenL1.menu.pnum.GENERIC_L151CBTXA.upload.maximum_size=131072
GenL1.menu.pnum.GENERIC_L151CBTXA.upload.maximum_data_size=32768
GenL1.menu.pnum.GENERIC_L151CBTXA.build.board=GENERIC_L151CBTXA
GenL1.menu.pnum.GENERIC_L151CBTXA.build.product_line=STM32L151xBA
GenL1.menu.pnum.GENERIC_L151CBTXA.build.variant=STM32L1xx/L100C6Ux(A)_L151C(6-8-B)(T-U)x(A)_L152C(6-8-B)(T-U)x(A)
GenL1.menu.pnum.GENERIC_L151CBTXA.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L1xx/STM32L151.svd

# Generic L151C6Ux
GenL1.menu.pnum.GENERIC_L151C6UX=Generic L151C6Ux
GenL1.menu.pnum.GENERIC_L151C6UX.upload.maximum_size=32768
GenL1.menu.pnum.GENERIC_L151C6UX.upload.maximum_data_size=10240
GenL1.menu.pnum.GENERIC_L151C6UX.build.board=GENERIC_L151C6UX
GenL1.menu.pnum.GENERIC_L151C6UX.build.product_line=STM32L151xB
GenL1.menu.pnum.GENERIC_L151C6UX.build.variant=STM32L1xx/L100C6Ux(A)_L151C(6-8-B)(T-U)x(A)_L152C(6-8-B)(T-U)x(A)
GenL1.menu.pnum.GENERIC_L151C6UX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L1xx/STM32L151.svd

# Generic L151C8Ux
GenL1.menu.pnum.GENERIC_L151C8UX=Generic L151C8Ux
GenL1.menu.pnum.GENERIC_L151C8UX.upload.maximum_size=65536
GenL1.menu.pnum.GENERIC_L151C8UX.upload.maximum_data_size=10240
GenL1.menu.pnum.GENERIC_L151C8UX.build.board=GENERIC_L151C8UX
GenL1.menu.pnum.GENERIC_L151C8UX.build.product_line=STM32L151xB
GenL1.menu.pnum.GENERIC_L151C8UX.build.variant=STM32L1xx/L100C6Ux(A)_L151C(6-8-B)(T-U)x(A)_L152C(6-8-B)(T-U)x(A)
GenL1.menu.pnum.GENERIC_L151C8UX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L1xx/STM32L151.svd

# Generic L151CBUx
GenL1.menu.pnum.GENERIC_L151CBUX=Generic L151CBUx
GenL1.menu.pnum.GENERIC_L151CBUX.upload.maximum_size=131072
GenL1.menu.pnum.GENERIC_L151CBUX.upload.maximum_data_size=16384
GenL1.menu.pnum.GENERIC_L151CBUX.build.board=GENERIC_L151CBUX
GenL1.menu.pnum.GENERIC_L151CBUX.build.product_line=STM32L151xB
GenL1.menu.pnum.GENERIC_L151CBUX.build.variant=STM32L1xx/L100C6Ux(A)_L151C(6-8-B)(T-U)x(A)_L152C(6-8-B)(T-U)x(A)
GenL1.menu.pnum.GENERIC_L151CBUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L1xx/STM32L151.svd

# Generic L151C6UxA
GenL1.menu.pnum.GENERIC_L151C6UXA=Generic L151C6UxA
GenL1.menu.pnum.GENERIC_L151C6UXA.upload.maximum_size=32768
GenL1.menu.pnum.GENERIC_L151C6UXA.upload.maximum_data_size=16384
GenL1.menu.pnum.GENERIC_L151C6UXA.build.board=GENERIC_L151C6UXA
GenL1.menu.pnum.GENERIC_L151C6UXA.build.product_line=STM32L151xBA
GenL1.menu.pnum.GENERIC_L151C6UXA.build.variant=STM32L1xx/L100C6Ux(A)_L151C(6-8-B)(T-U)x(A)_L152C(6-8-B)(T-U)x(A)
GenL1.menu.pnum.GENERIC_L151C6UXA.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L1xx/STM32L151.svd

# Generic L151C8UxA
GenL1.menu.pnum.GENERIC_L151C8UXA=Generic L151C8UxA
GenL1.menu.pnum.GENERIC_L151C8UXA.upload.maximum_size=65536
GenL1.menu.pnum.GENERIC_L151C8UXA.upload.maximum_data_size=32768
GenL1.menu.pnum.GENERIC_L151C8UXA.build.board=GENERIC_L151C8UXA
GenL1.menu.pnum.GENERIC_L151C8UXA.build.product_line=STM32L151xBA
GenL1.menu.pnum.GENERIC_L151C8UXA.build.variant=STM32L1xx/L100C6Ux(A)_L151C(6-8-B)(T-U)x(A)_L152C(6-8-B)(T-U)x(A)
GenL1.menu.pnum.GENERIC_L151C8UXA.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L1xx/STM32L151.svd

# Generic L151CBUxA
GenL1.menu.pnum.GENERIC_L151CBUXA=Generic L151CBUxA
GenL1.menu.pnum.GENERIC_L151CBUXA.upload.maximum_size=131072
GenL1.menu.pnum.GENERIC_L151CBUXA.upload.maximum_data_size=32768
GenL1.menu.pnum.GENERIC_L151CBUXA.build.board=GENERIC_L151CBUXA
GenL1.menu.pnum.GENERIC_L151CBUXA.build.product_line=STM32L151xBA
GenL1.menu.pnum.GENERIC_L151CBUXA.build.variant=STM32L1xx/L100C6Ux(A)_L151C(6-8-B)(T-U)x(A)_L152C(6-8-B)(T-U)x(A)
GenL1.menu.pnum.GENERIC_L151CBUXA.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L1xx/STM32L151.svd

# Generic L151ZDTx
GenL1.menu.pnum.GENERIC_L151ZDTX=Generic L151ZDTx
GenL1.menu.pnum.GENERIC_L151ZDTX.upload.maximum_size=393216
GenL1.menu.pnum.GENERIC_L151ZDTX.upload.maximum_data_size=49152
GenL1.menu.pnum.GENERIC_L151ZDTX.build.board=GENERIC_L151ZDTX
GenL1.menu.pnum.GENERIC_L151ZDTX.build.product_line=STM32L151xD
GenL1.menu.pnum.GENERIC_L151ZDTX.build.variant=STM32L1xx/L151ZDT_L152ZDT_L162ZDT
GenL1.menu.pnum.GENERIC_L151ZDTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L1xx/STM32L151.svd

# Generic L152C6Tx
GenL1.menu.pnum.GENERIC_L152C6TX=Generic L152C6Tx
GenL1.menu.pnum.GENERIC_L152C6TX.upload.maximum_size=32768
GenL1.menu.pnum.GENERIC_L152C6TX.upload.maximum_data_size=10240
GenL1.menu.pnum.GENERIC_L152C6TX.build.board=GENERIC_L152C6TX
GenL1.menu.pnum.GENERIC_L152C6TX.build.product_line=STM32L152xB
GenL1.menu.pnum.GENERIC_L152C6TX.build.variant=STM32L1xx/L100C6Ux(A)_L151C(6-8-B)(T-U)x(A)_L152C(6-8-B)(T-U)x(A)
GenL1.menu.pnum.GENERIC_L152C6TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L1xx/STM32L152.svd

# Generic L152C8Tx
GenL1.menu.pnum.GENERIC_L152C8TX=Generic L152C8Tx
GenL1.menu.pnum.GENERIC_L152C8TX.upload.maximum_size=65536
GenL1.menu.pnum.GENERIC_L152C8TX.upload.maximum_data_size=10240
GenL1.menu.pnum.GENERIC_L152C8TX.build.board=GENERIC_L152C8TX
GenL1.menu.pnum.GENERIC_L152C8TX.build.product_line=STM32L152xB
GenL1.menu.pnum.GENERIC_L152C8TX.build.variant=STM32L1xx/L100C6Ux(A)_L151C(6-8-B)(T-U)x(A)_L152C(6-8-B)(T-U)x(A)
GenL1.menu.pnum.GENERIC_L152C8TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L1xx/STM32L152.svd

# Generic L152CBTx
GenL1.menu.pnum.GENERIC_L152CBTX=Generic L152CBTx
GenL1.menu.pnum.GENERIC_L152CBTX.upload.maximum_size=131072
GenL1.menu.pnum.GENERIC_L152CBTX.upload.maximum_data_size=16384
GenL1.menu.pnum.GENERIC_L152CBTX.build.board=GENERIC_L152CBTX
GenL1.menu.pnum.GENERIC_L152CBTX.build.product_line=STM32L152xB
GenL1.menu.pnum.GENERIC_L152CBTX.build.variant=STM32L1xx/L100C6Ux(A)_L151C(6-8-B)(T-U)x(A)_L152C(6-8-B)(T-U)x(A)
GenL1.menu.pnum.GENERIC_L152CBTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L1xx/STM32L152.svd

# Generic L152C6TxA
GenL1.menu.pnum.GENERIC_L152C6TXA=Generic L152C6TxA
GenL1.menu.pnum.GENERIC_L152C6TXA.upload.maximum_size=32768
GenL1.menu.pnum.GENERIC_L152C6TXA.upload.maximum_data_size=16384
GenL1.menu.pnum.GENERIC_L152C6TXA.build.board=GENERIC_L152C6TXA
GenL1.menu.pnum.GENERIC_L152C6TXA.build.product_line=STM32L152xBA
GenL1.menu.pnum.GENERIC_L152C6TXA.build.variant=STM32L1xx/L100C6Ux(A)_L151C(6-8-B)(T-U)x(A)_L152C(6-8-B)(T-U)x(A)
GenL1.menu.pnum.GENERIC_L152C6TXA.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L1xx/STM32L152.svd

# Generic L152C8TxA
GenL1.menu.pnum.GENERIC_L152C8TXA=Generic L152C8TxA
GenL1.menu.pnum.GENERIC_L152C8TXA.upload.maximum_size=65536
GenL1.menu.pnum.GENERIC_L152C8TXA.upload.maximum_data_size=32768
GenL1.menu.pnum.GENERIC_L152C8TXA.build.board=GENERIC_L152C8TXA
GenL1.menu.pnum.GENERIC_L152C8TXA.build.product_line=STM32L152xBA
GenL1.menu.pnum.GENERIC_L152C8TXA.build.variant=STM32L1xx/L100C6Ux(A)_L151C(6-8-B)(T-U)x(A)_L152C(6-8-B)(T-U)x(A)
GenL1.menu.pnum.GENERIC_L152C8TXA.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L1xx/STM32L152.svd

# Generic L152CBTxA
GenL1.menu.pnum.GENERIC_L152CBTXA=Generic L152CBTxA
GenL1.menu.pnum.GENERIC_L152CBTXA.upload.maximum_size=131072
GenL1.menu.pnum.GENERIC_L152CBTXA.upload.maximum_data_size=32768
GenL1.menu.pnum.GENERIC_L152CBTXA.build.board=GENERIC_L152CBTXA
GenL1.menu.pnum.GENERIC_L152CBTXA.build.product_line=STM32L152xBA
GenL1.menu.pnum.GENERIC_L152CBTXA.build.variant=STM32L1xx/L100C6Ux(A)_L151C(6-8-B)(T-U)x(A)_L152C(6-8-B)(T-U)x(A)
GenL1.menu.pnum.GENERIC_L152CBTXA.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L1xx/STM32L152.svd

# Generic L152C6Ux
GenL1.menu.pnum.GENERIC_L152C6UX=Generic L152C6Ux
GenL1.menu.pnum.GENERIC_L152C6UX.upload.maximum_size=32768
GenL1.menu.pnum.GENERIC_L152C6UX.upload.maximum_data_size=10240
GenL1.menu.pnum.GENERIC_L152C6UX.build.board=GENERIC_L152C6UX
GenL1.menu.pnum.GENERIC_L152C6UX.build.product_line=STM32L152xB
GenL1.menu.pnum.GENERIC_L152C6UX.build.variant=STM32L1xx/L100C6Ux(A)_L151C(6-8-B)(T-U)x(A)_L152C(6-8-B)(T-U)x(A)
GenL1.menu.pnum.GENERIC_L152C6UX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L1xx/STM32L152.svd

