stm32duino/Arduino_Core_STM32/boards.txt
# Generic L152C8Ux
GenL1.menu.pnum.GENERIC_L152C8UX=Generic L152C8Ux
GenL1.menu.pnum.GENERIC_L152C8UX.upload.maximum_size=65536
GenL1.menu.pnum.GENERIC_L152C8UX.upload.maximum_data_size=10240
GenL1.menu.pnum.GENERIC_L152C8UX.build.board=GENERIC_L152C8UX
GenL1.menu.pnum.GENERIC_L152C8UX.build.product_line=STM32L152xB
GenL1.menu.pnum.GENERIC_L152C8UX.build.variant=STM32L1xx/L100C6Ux(A)_L151C(6-8-B)(T-U)x(A)_L152C(6-8-B)(T-U)x(A)
GenL1.menu.pnum.GENERIC_L152C8UX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L1xx/STM32L152.svd

# Generic L152CBUx
GenL1.menu.pnum.GENERIC_L152CBUX=Generic L152CBUx
GenL1.menu.pnum.GENERIC_L152CBUX.upload.maximum_size=131072
GenL1.menu.pnum.GENERIC_L152CBUX.upload.maximum_data_size=16384
GenL1.menu.pnum.GENERIC_L152CBUX.build.board=GENERIC_L152CBUX
GenL1.menu.pnum.GENERIC_L152CBUX.build.product_line=STM32L152xB
GenL1.menu.pnum.GENERIC_L152CBUX.build.variant=STM32L1xx/L100C6Ux(A)_L151C(6-8-B)(T-U)x(A)_L152C(6-8-B)(T-U)x(A)
GenL1.menu.pnum.GENERIC_L152CBUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L1xx/STM32L152.svd

# Generic L152C6UxA
GenL1.menu.pnum.GENERIC_L152C6UXA=Generic L152C6UxA
GenL1.menu.pnum.GENERIC_L152C6UXA.upload.maximum_size=32768
GenL1.menu.pnum.GENERIC_L152C6UXA.upload.maximum_data_size=16384
GenL1.menu.pnum.GENERIC_L152C6UXA.build.board=GENERIC_L152C6UXA
GenL1.menu.pnum.GENERIC_L152C6UXA.build.product_line=STM32L152xBA
GenL1.menu.pnum.GENERIC_L152C6UXA.build.variant=STM32L1xx/L100C6Ux(A)_L151C(6-8-B)(T-U)x(A)_L152C(6-8-B)(T-U)x(A)
GenL1.menu.pnum.GENERIC_L152C6UXA.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L1xx/STM32L152.svd

# Generic L152C8UxA
GenL1.menu.pnum.GENERIC_L152C8UXA=Generic L152C8UxA
GenL1.menu.pnum.GENERIC_L152C8UXA.upload.maximum_size=65536
GenL1.menu.pnum.GENERIC_L152C8UXA.upload.maximum_data_size=32768
GenL1.menu.pnum.GENERIC_L152C8UXA.build.board=GENERIC_L152C8UXA
GenL1.menu.pnum.GENERIC_L152C8UXA.build.product_line=STM32L152xBA
GenL1.menu.pnum.GENERIC_L152C8UXA.build.variant=STM32L1xx/L100C6Ux(A)_L151C(6-8-B)(T-U)x(A)_L152C(6-8-B)(T-U)x(A)
GenL1.menu.pnum.GENERIC_L152C8UXA.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L1xx/STM32L152.svd

# Generic L152CBUxA
GenL1.menu.pnum.GENERIC_L152CBUXA=Generic L152CBUxA
GenL1.menu.pnum.GENERIC_L152CBUXA.upload.maximum_size=131072
GenL1.menu.pnum.GENERIC_L152CBUXA.upload.maximum_data_size=32768
GenL1.menu.pnum.GENERIC_L152CBUXA.build.board=GENERIC_L152CBUXA
GenL1.menu.pnum.GENERIC_L152CBUXA.build.product_line=STM32L152xBA
GenL1.menu.pnum.GENERIC_L152CBUXA.build.variant=STM32L1xx/L100C6Ux(A)_L151C(6-8-B)(T-U)x(A)_L152C(6-8-B)(T-U)x(A)
GenL1.menu.pnum.GENERIC_L152CBUXA.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L1xx/STM32L152.svd

# Generic L151RETx
GenL1.menu.pnum.GENERIC_L151RETX=Generic L151RETx
GenL1.menu.pnum.GENERIC_L151RETX.upload.maximum_size=524288
GenL1.menu.pnum.GENERIC_L151RETX.upload.maximum_data_size=81920
GenL1.menu.pnum.GENERIC_L151RETX.build.board=GENERIC_L151RETX
GenL1.menu.pnum.GENERIC_L151RETX.build.product_line=STM32L151xE
GenL1.menu.pnum.GENERIC_L151RETX.build.variant=STM32L1xx/L151RET_L152RET_L162RET
GenL1.menu.pnum.GENERIC_L151RETX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L1xx/STM32L151.svd

# Generic L152RETx
GenL1.menu.pnum.GENERIC_L152RETX=Generic L152RETx
GenL1.menu.pnum.GENERIC_L152RETX.upload.maximum_size=524288
GenL1.menu.pnum.GENERIC_L152RETX.upload.maximum_data_size=81920
GenL1.menu.pnum.GENERIC_L152RETX.build.board=GENERIC_L152RETX
GenL1.menu.pnum.GENERIC_L152RETX.build.product_line=STM32L152xE
GenL1.menu.pnum.GENERIC_L152RETX.build.variant=STM32L1xx/L151RET_L152RET_L162RET
GenL1.menu.pnum.GENERIC_L152RETX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L1xx/STM32L152.svd

# Generic L152ZDTx
GenL1.menu.pnum.GENERIC_L152ZDTX=Generic L152ZDTx
GenL1.menu.pnum.GENERIC_L152ZDTX.upload.maximum_size=393216
GenL1.menu.pnum.GENERIC_L152ZDTX.upload.maximum_data_size=49152
GenL1.menu.pnum.GENERIC_L152ZDTX.build.board=GENERIC_L152ZDTX
GenL1.menu.pnum.GENERIC_L152ZDTX.build.product_line=STM32L152xD
GenL1.menu.pnum.GENERIC_L152ZDTX.build.variant=STM32L1xx/L151ZDT_L152ZDT_L162ZDT
GenL1.menu.pnum.GENERIC_L152ZDTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L1xx/STM32L152.svd

# Generic L162RETx
GenL1.menu.pnum.GENERIC_L162RETX=Generic L162RETx
GenL1.menu.pnum.GENERIC_L162RETX.upload.maximum_size=524288
GenL1.menu.pnum.GENERIC_L162RETX.upload.maximum_data_size=81920
GenL1.menu.pnum.GENERIC_L162RETX.build.board=GENERIC_L162RETX
GenL1.menu.pnum.GENERIC_L162RETX.build.product_line=STM32L162xE
GenL1.menu.pnum.GENERIC_L162RETX.build.variant=STM32L1xx/L151RET_L152RET_L162RET
GenL1.menu.pnum.GENERIC_L162RETX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L1xx/STM32L162.svd

# Generic L162ZDTx
GenL1.menu.pnum.GENERIC_L162ZDTX=Generic L162ZDTx
GenL1.menu.pnum.GENERIC_L162ZDTX.upload.maximum_size=393216
GenL1.menu.pnum.GENERIC_L162ZDTX.upload.maximum_data_size=49152
GenL1.menu.pnum.GENERIC_L162ZDTX.build.board=GENERIC_L162ZDTX
GenL1.menu.pnum.GENERIC_L162ZDTX.build.product_line=STM32L162xD
GenL1.menu.pnum.GENERIC_L162ZDTX.build.variant=STM32L1xx/L151ZDT_L152ZDT_L162ZDT
GenL1.menu.pnum.GENERIC_L162ZDTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L1xx/STM32L162.svd

# Upload menu
GenL1.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenL1.menu.upload_method.swdMethod.upload.protocol=swd
GenL1.menu.upload_method.swdMethod.upload.options=
GenL1.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenL1.menu.upload_method.jlinkMethod=STM32CubeProgrammer (J-Link)
GenL1.menu.upload_method.jlinkMethod.upload.protocol=jlink
GenL1.menu.upload_method.jlinkMethod.upload.options=
GenL1.menu.upload_method.jlinkMethod.upload.tool=stm32CubeProg

GenL1.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenL1.menu.upload_method.serialMethod.upload.protocol=serial
GenL1.menu.upload_method.serialMethod.upload.options=-c {serial.port.file}
GenL1.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

