stm32duino/Arduino_Core_STM32/boards.txt
GenL1.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenL1.menu.upload_method.dfuMethod.upload.protocol=dfu
GenL1.menu.upload_method.dfuMethod.upload.options=-v {upload.vid} -p {upload.pid}
GenL1.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

GenL1.menu.upload_method.bmpMethod=BMP (Black Magic Probe)
GenL1.menu.upload_method.bmpMethod.upload.protocol=gdb_bmp
GenL1.menu.upload_method.bmpMethod.upload.tool=bmp_upload

GenL1.menu.upload_method.OpenOCDSTLink=OpenOCD STLink (SWD)
GenL1.menu.upload_method.OpenOCDSTLink.upload.protocol=stlink
GenL1.menu.upload_method.OpenOCDSTLink.upload.tool=openocd_upload

GenL1.menu.upload_method.OpenOCDDapLink=OpenOCD DapLink (SWD)
GenL1.menu.upload_method.OpenOCDDapLink.upload.protocol=cmsis-dap
GenL1.menu.upload_method.OpenOCDDapLink.upload.tool=openocd_upload

################################################################################
# Generic L4
GenL4.name=Generic STM32L4 series

GenL4.build.core=arduino
GenL4.build.board=GenL4
GenL4.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
GenL4.build.mcu=cortex-m4
GenL4.build.fpu=-mfpu=fpv4-sp-d16
GenL4.build.float-abi=-mfloat-abi=hard
GenL4.build.series=STM32L4xx
GenL4.build.flash_offset=0x0
GenL4.upload.maximum_size=0
GenL4.upload.maximum_data_size=0
GenL4.openocd.target=stm32l4x
GenL4.vid.0=0x0483
GenL4.pid.0=0x5740

# Leafony AP03
GenL4.menu.pnum.LEAFONY_AP03=Leafony AP03
GenL4.menu.pnum.LEAFONY_AP03.upload.maximum_size=524288
GenL4.menu.pnum.LEAFONY_AP03.upload.maximum_data_size=163840
GenL4.menu.pnum.LEAFONY_AP03.build.board=LEAFONY_AP03
GenL4.menu.pnum.LEAFONY_AP03.build.product_line=STM32L452xx
GenL4.menu.pnum.LEAFONY_AP03.build.variant=STM32L4xx/L452RC(I-T-Y)_L452RE(I-T-Y)x(P)_L462RE(I-T-Y)
GenL4.menu.pnum.LEAFONY_AP03.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
GenL4.menu.pnum.LEAFONY_AP03.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L452.svd

# Generic L412K8Tx
GenL4.menu.pnum.GENERIC_L412K8TX=Generic L412K8Tx
GenL4.menu.pnum.GENERIC_L412K8TX.upload.maximum_size=65536
GenL4.menu.pnum.GENERIC_L412K8TX.upload.maximum_data_size=40960
GenL4.menu.pnum.GENERIC_L412K8TX.build.board=GENERIC_L412K8TX
GenL4.menu.pnum.GENERIC_L412K8TX.build.product_line=STM32L412xx
GenL4.menu.pnum.GENERIC_L412K8TX.build.variant=STM32L4xx/L412K(8-B)(T-U)_L422KB(T-U)
GenL4.menu.pnum.GENERIC_L412K8TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L412.svd

# Generic L412K8Ux
GenL4.menu.pnum.GENERIC_L412K8UX=Generic L412K8Ux
GenL4.menu.pnum.GENERIC_L412K8UX.upload.maximum_size=65536
GenL4.menu.pnum.GENERIC_L412K8UX.upload.maximum_data_size=40960
GenL4.menu.pnum.GENERIC_L412K8UX.build.board=GENERIC_L412K8UX
GenL4.menu.pnum.GENERIC_L412K8UX.build.product_line=STM32L412xx
GenL4.menu.pnum.GENERIC_L412K8UX.build.variant=STM32L4xx/L412K(8-B)(T-U)_L422KB(T-U)
GenL4.menu.pnum.GENERIC_L412K8UX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L412.svd

# Generic L412KBTx
GenL4.menu.pnum.GENERIC_L412KBTX=Generic L412KBTx
GenL4.menu.pnum.GENERIC_L412KBTX.upload.maximum_size=131072
GenL4.menu.pnum.GENERIC_L412KBTX.upload.maximum_data_size=40960
GenL4.menu.pnum.GENERIC_L412KBTX.build.board=GENERIC_L412KBTX
GenL4.menu.pnum.GENERIC_L412KBTX.build.product_line=STM32L412xx
GenL4.menu.pnum.GENERIC_L412KBTX.build.variant=STM32L4xx/L412K(8-B)(T-U)_L422KB(T-U)
GenL4.menu.pnum.GENERIC_L412KBTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L412.svd

# Generic L412KBUx
GenL4.menu.pnum.GENERIC_L412KBUX=Generic L412KBUx
GenL4.menu.pnum.GENERIC_L412KBUX.upload.maximum_size=131072
GenL4.menu.pnum.GENERIC_L412KBUX.upload.maximum_data_size=40960
GenL4.menu.pnum.GENERIC_L412KBUX.build.board=GENERIC_L412KBUX
GenL4.menu.pnum.GENERIC_L412KBUX.build.product_line=STM32L412xx
GenL4.menu.pnum.GENERIC_L412KBUX.build.variant=STM32L4xx/L412K(8-B)(T-U)_L422KB(T-U)
GenL4.menu.pnum.GENERIC_L412KBUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L412.svd

# Generic L412RBIxP
GenL4.menu.pnum.GENERIC_L412RBIXP=Generic L412RBIxP
GenL4.menu.pnum.GENERIC_L412RBIXP.upload.maximum_size=131072
GenL4.menu.pnum.GENERIC_L412RBIXP.upload.maximum_data_size=40960
GenL4.menu.pnum.GENERIC_L412RBIXP.build.board=GENERIC_L412RBIXP
GenL4.menu.pnum.GENERIC_L412RBIXP.build.product_line=STM32L412xx
GenL4.menu.pnum.GENERIC_L412RBIXP.build.variant=STM32L4xx/L412RB(I-T)xP
GenL4.menu.pnum.GENERIC_L412RBIXP.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L412.svd

# Generic L412RBTxP
GenL4.menu.pnum.GENERIC_L412RBTXP=Generic L412RBTxP
GenL4.menu.pnum.GENERIC_L412RBTXP.upload.maximum_size=131072
GenL4.menu.pnum.GENERIC_L412RBTXP.upload.maximum_data_size=40960
GenL4.menu.pnum.GENERIC_L412RBTXP.build.board=GENERIC_L412RBTXP
GenL4.menu.pnum.GENERIC_L412RBTXP.build.product_line=STM32L412xx
GenL4.menu.pnum.GENERIC_L412RBTXP.build.variant=STM32L4xx/L412RB(I-T)xP
GenL4.menu.pnum.GENERIC_L412RBTXP.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L412.svd

# Generic L422KBTx
GenL4.menu.pnum.GENERIC_L422KBTX=Generic L422KBTx
GenL4.menu.pnum.GENERIC_L422KBTX.upload.maximum_size=131072
GenL4.menu.pnum.GENERIC_L422KBTX.upload.maximum_data_size=40960
GenL4.menu.pnum.GENERIC_L422KBTX.build.board=GENERIC_L422KBTX
GenL4.menu.pnum.GENERIC_L422KBTX.build.product_line=STM32L422xx
GenL4.menu.pnum.GENERIC_L422KBTX.build.variant=STM32L4xx/L412K(8-B)(T-U)_L422KB(T-U)
GenL4.menu.pnum.GENERIC_L422KBTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L422.svd

# Generic L422KBUx
GenL4.menu.pnum.GENERIC_L422KBUX=Generic L422KBUx
GenL4.menu.pnum.GENERIC_L422KBUX.upload.maximum_size=131072
GenL4.menu.pnum.GENERIC_L422KBUX.upload.maximum_data_size=40960
GenL4.menu.pnum.GENERIC_L422KBUX.build.board=GENERIC_L422KBUX
GenL4.menu.pnum.GENERIC_L422KBUX.build.product_line=STM32L422xx
GenL4.menu.pnum.GENERIC_L422KBUX.build.variant=STM32L4xx/L412K(8-B)(T-U)_L422KB(T-U)
GenL4.menu.pnum.GENERIC_L422KBUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L422.svd

# Generic L431CBTx
GenL4.menu.pnum.GENERIC_L431CBTX=Generic L431CBTx
GenL4.menu.pnum.GENERIC_L431CBTX.upload.maximum_size=131072
GenL4.menu.pnum.GENERIC_L431CBTX.upload.maximum_data_size=65536
GenL4.menu.pnum.GENERIC_L431CBTX.build.board=GENERIC_L431CBTX
GenL4.menu.pnum.GENERIC_L431CBTX.build.product_line=STM32L431xx
GenL4.menu.pnum.GENERIC_L431CBTX.build.variant=STM32L4xx/L431C(B-C)(T-U)
GenL4.menu.pnum.GENERIC_L431CBTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L431.svd

