stm32duino/Arduino_Core_STM32/boards.txt
# Generic L431CBUx
GenL4.menu.pnum.GENERIC_L431CBUX=Generic L431CBUx
GenL4.menu.pnum.GENERIC_L431CBUX.upload.maximum_size=131072
GenL4.menu.pnum.GENERIC_L431CBUX.upload.maximum_data_size=65536
GenL4.menu.pnum.GENERIC_L431CBUX.build.board=GENERIC_L431CBUX
GenL4.menu.pnum.GENERIC_L431CBUX.build.product_line=STM32L431xx
GenL4.menu.pnum.GENERIC_L431CBUX.build.variant=STM32L4xx/L431C(B-C)(T-U)
GenL4.menu.pnum.GENERIC_L431CBUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L431.svd

# Generic L431CCTx
GenL4.menu.pnum.GENERIC_L431CCTX=Generic L431CCTx
GenL4.menu.pnum.GENERIC_L431CCTX.upload.maximum_size=262144
GenL4.menu.pnum.GENERIC_L431CCTX.upload.maximum_data_size=65536
GenL4.menu.pnum.GENERIC_L431CCTX.build.board=GENERIC_L431CCTX
GenL4.menu.pnum.GENERIC_L431CCTX.build.product_line=STM32L431xx
GenL4.menu.pnum.GENERIC_L431CCTX.build.variant=STM32L4xx/L431C(B-C)(T-U)
GenL4.menu.pnum.GENERIC_L431CCTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L431.svd

# Generic L431CCUx
GenL4.menu.pnum.GENERIC_L431CCUX=Generic L431CCUx
GenL4.menu.pnum.GENERIC_L431CCUX.upload.maximum_size=262144
GenL4.menu.pnum.GENERIC_L431CCUX.upload.maximum_data_size=65536
GenL4.menu.pnum.GENERIC_L431CCUX.build.board=GENERIC_L431CCUX
GenL4.menu.pnum.GENERIC_L431CCUX.build.product_line=STM32L431xx
GenL4.menu.pnum.GENERIC_L431CCUX.build.variant=STM32L4xx/L431C(B-C)(T-U)
GenL4.menu.pnum.GENERIC_L431CCUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L431.svd

# Generic L431RBIx
GenL4.menu.pnum.GENERIC_L431RBIX=Generic L431RBIx
GenL4.menu.pnum.GENERIC_L431RBIX.upload.maximum_size=131072
GenL4.menu.pnum.GENERIC_L431RBIX.upload.maximum_data_size=65536
GenL4.menu.pnum.GENERIC_L431RBIX.build.board=GENERIC_L431RBIX
GenL4.menu.pnum.GENERIC_L431RBIX.build.product_line=STM32L431xx
GenL4.menu.pnum.GENERIC_L431RBIX.build.variant=STM32L4xx/L431R(B-C)(I-T-Y)
GenL4.menu.pnum.GENERIC_L431RBIX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L431.svd

# Generic L431RCIx
GenL4.menu.pnum.GENERIC_L431RCIX=Generic L431RCIx
GenL4.menu.pnum.GENERIC_L431RCIX.upload.maximum_size=262144
GenL4.menu.pnum.GENERIC_L431RCIX.upload.maximum_data_size=65536
GenL4.menu.pnum.GENERIC_L431RCIX.build.board=GENERIC_L431RCIX
GenL4.menu.pnum.GENERIC_L431RCIX.build.product_line=STM32L431xx
GenL4.menu.pnum.GENERIC_L431RCIX.build.variant=STM32L4xx/L431R(B-C)(I-T-Y)
GenL4.menu.pnum.GENERIC_L431RCIX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L431.svd

# Generic L431RBTx
GenL4.menu.pnum.GENERIC_L431RBTX=Generic L431RBTx
GenL4.menu.pnum.GENERIC_L431RBTX.upload.maximum_size=131072
GenL4.menu.pnum.GENERIC_L431RBTX.upload.maximum_data_size=65536
GenL4.menu.pnum.GENERIC_L431RBTX.build.board=GENERIC_L431RBTX
GenL4.menu.pnum.GENERIC_L431RBTX.build.product_line=STM32L431xx
GenL4.menu.pnum.GENERIC_L431RBTX.build.variant=STM32L4xx/L431R(B-C)(I-T-Y)
GenL4.menu.pnum.GENERIC_L431RBTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L431.svd

# Generic L431RCTx
GenL4.menu.pnum.GENERIC_L431RCTX=Generic L431RCTx
GenL4.menu.pnum.GENERIC_L431RCTX.upload.maximum_size=262144
GenL4.menu.pnum.GENERIC_L431RCTX.upload.maximum_data_size=65536
GenL4.menu.pnum.GENERIC_L431RCTX.build.board=GENERIC_L431RCTX
GenL4.menu.pnum.GENERIC_L431RCTX.build.product_line=STM32L431xx
GenL4.menu.pnum.GENERIC_L431RCTX.build.variant=STM32L4xx/L431R(B-C)(I-T-Y)
GenL4.menu.pnum.GENERIC_L431RCTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L431.svd

# Generic L431RBYx
GenL4.menu.pnum.GENERIC_L431RBYX=Generic L431RBYx
GenL4.menu.pnum.GENERIC_L431RBYX.upload.maximum_size=131072
GenL4.menu.pnum.GENERIC_L431RBYX.upload.maximum_data_size=65536
GenL4.menu.pnum.GENERIC_L431RBYX.build.board=GENERIC_L431RBYX
GenL4.menu.pnum.GENERIC_L431RBYX.build.product_line=STM32L431xx
GenL4.menu.pnum.GENERIC_L431RBYX.build.variant=STM32L4xx/L431R(B-C)(I-T-Y)
GenL4.menu.pnum.GENERIC_L431RBYX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L431.svd

# Generic L431RCYx
GenL4.menu.pnum.GENERIC_L431RCYX=Generic L431RCYx
GenL4.menu.pnum.GENERIC_L431RCYX.upload.maximum_size=262144
GenL4.menu.pnum.GENERIC_L431RCYX.upload.maximum_data_size=65536
GenL4.menu.pnum.GENERIC_L431RCYX.build.board=GENERIC_L431RCYX
GenL4.menu.pnum.GENERIC_L431RCYX.build.product_line=STM32L431xx
GenL4.menu.pnum.GENERIC_L431RCYX.build.variant=STM32L4xx/L431R(B-C)(I-T-Y)
GenL4.menu.pnum.GENERIC_L431RCYX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L431.svd

# Generic L432KBUx
GenL4.menu.pnum.GENERIC_L432KBUX=Generic L432KBUx
GenL4.menu.pnum.GENERIC_L432KBUX.upload.maximum_size=131072
GenL4.menu.pnum.GENERIC_L432KBUX.upload.maximum_data_size=65536
GenL4.menu.pnum.GENERIC_L432KBUX.build.board=GENERIC_L432KBUX
GenL4.menu.pnum.GENERIC_L432KBUX.build.product_line=STM32L432xx
GenL4.menu.pnum.GENERIC_L432KBUX.build.variant=STM32L4xx/L432K(B-C)U_L442KCU
GenL4.menu.pnum.GENERIC_L432KBUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L432.svd

# Generic L432KCUx
GenL4.menu.pnum.GENERIC_L432KCUX=Generic L432KCUx
GenL4.menu.pnum.GENERIC_L432KCUX.upload.maximum_size=262144
GenL4.menu.pnum.GENERIC_L432KCUX.upload.maximum_data_size=65536
GenL4.menu.pnum.GENERIC_L432KCUX.build.board=GENERIC_L432KCUX
GenL4.menu.pnum.GENERIC_L432KCUX.build.product_line=STM32L432xx
GenL4.menu.pnum.GENERIC_L432KCUX.build.variant=STM32L4xx/L432K(B-C)U_L442KCU
GenL4.menu.pnum.GENERIC_L432KCUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L432.svd

# Generic L442KCUx
GenL4.menu.pnum.GENERIC_L442KCUX=Generic L442KCUx
GenL4.menu.pnum.GENERIC_L442KCUX.upload.maximum_size=262144
GenL4.menu.pnum.GENERIC_L442KCUX.upload.maximum_data_size=65536
GenL4.menu.pnum.GENERIC_L442KCUX.build.board=GENERIC_L442KCUX
GenL4.menu.pnum.GENERIC_L442KCUX.build.product_line=STM32L442xx
GenL4.menu.pnum.GENERIC_L442KCUX.build.variant=STM32L4xx/L432K(B-C)U_L442KCU
GenL4.menu.pnum.GENERIC_L442KCUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L442.svd

# Generic L433CBTx
GenL4.menu.pnum.GENERIC_L433CBTX=Generic L433CBTx
GenL4.menu.pnum.GENERIC_L433CBTX.upload.maximum_size=131072
GenL4.menu.pnum.GENERIC_L433CBTX.upload.maximum_data_size=65536
GenL4.menu.pnum.GENERIC_L433CBTX.build.board=GENERIC_L433CBTX
GenL4.menu.pnum.GENERIC_L433CBTX.build.product_line=STM32L433xx
GenL4.menu.pnum.GENERIC_L433CBTX.build.variant=STM32L4xx/L433C(B-C)(T-U)_L443CC(T-U)
GenL4.menu.pnum.GENERIC_L433CBTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L433.svd

# Generic L433CCTx
GenL4.menu.pnum.GENERIC_L433CCTX=Generic L433CCTx
GenL4.menu.pnum.GENERIC_L433CCTX.upload.maximum_size=262144
GenL4.menu.pnum.GENERIC_L433CCTX.upload.maximum_data_size=65536
GenL4.menu.pnum.GENERIC_L433CCTX.build.board=GENERIC_L433CCTX
GenL4.menu.pnum.GENERIC_L433CCTX.build.product_line=STM32L433xx
GenL4.menu.pnum.GENERIC_L433CCTX.build.variant=STM32L4xx/L433C(B-C)(T-U)_L443CC(T-U)
GenL4.menu.pnum.GENERIC_L433CCTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L433.svd

