stm32duino/Arduino_Core_STM32/boards.txt
# Generic L452RCYx
GenL4.menu.pnum.GENERIC_L452RCYX=Generic L452RCYx
GenL4.menu.pnum.GENERIC_L452RCYX.upload.maximum_size=262144
GenL4.menu.pnum.GENERIC_L452RCYX.upload.maximum_data_size=163840
GenL4.menu.pnum.GENERIC_L452RCYX.build.board=GENERIC_L452RCYX
GenL4.menu.pnum.GENERIC_L452RCYX.build.product_line=STM32L452xx
GenL4.menu.pnum.GENERIC_L452RCYX.build.variant=STM32L4xx/L452RC(I-T-Y)_L452RE(I-T-Y)x(P)_L462RE(I-T-Y)
GenL4.menu.pnum.GENERIC_L452RCYX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L452.svd

# Generic L452REYx
GenL4.menu.pnum.GENERIC_L452REYX=Generic L452REYx
GenL4.menu.pnum.GENERIC_L452REYX.upload.maximum_size=524288
GenL4.menu.pnum.GENERIC_L452REYX.upload.maximum_data_size=163840
GenL4.menu.pnum.GENERIC_L452REYX.build.board=GENERIC_L452REYX
GenL4.menu.pnum.GENERIC_L452REYX.build.product_line=STM32L452xx
GenL4.menu.pnum.GENERIC_L452REYX.build.variant=STM32L4xx/L452RC(I-T-Y)_L452RE(I-T-Y)x(P)_L462RE(I-T-Y)
GenL4.menu.pnum.GENERIC_L452REYX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L452.svd

# Generic L452RETxP
GenL4.menu.pnum.GENERIC_L452RETXP=Generic L452RETxP
GenL4.menu.pnum.GENERIC_L452RETXP.upload.maximum_size=524288
GenL4.menu.pnum.GENERIC_L452RETXP.upload.maximum_data_size=163840
GenL4.menu.pnum.GENERIC_L452RETXP.build.board=GENERIC_L452RETXP
GenL4.menu.pnum.GENERIC_L452RETXP.build.product_line=STM32L452xx
GenL4.menu.pnum.GENERIC_L452RETXP.build.variant=STM32L4xx/L452RETxP
GenL4.menu.pnum.GENERIC_L452RETXP.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L452.svd

# Generic L462REIx
GenL4.menu.pnum.GENERIC_L462REIX=Generic L462REIx
GenL4.menu.pnum.GENERIC_L462REIX.upload.maximum_size=524288
GenL4.menu.pnum.GENERIC_L462REIX.upload.maximum_data_size=163840
GenL4.menu.pnum.GENERIC_L462REIX.build.board=GENERIC_L462REIX
GenL4.menu.pnum.GENERIC_L462REIX.build.product_line=STM32L462xx
GenL4.menu.pnum.GENERIC_L462REIX.build.variant=STM32L4xx/L452RC(I-T-Y)_L452RE(I-T-Y)x(P)_L462RE(I-T-Y)
GenL4.menu.pnum.GENERIC_L462REIX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L462.svd

# Generic L462RETx
GenL4.menu.pnum.GENERIC_L462RETX=Generic L462RETx
GenL4.menu.pnum.GENERIC_L462RETX.upload.maximum_size=524288
GenL4.menu.pnum.GENERIC_L462RETX.upload.maximum_data_size=163840
GenL4.menu.pnum.GENERIC_L462RETX.build.board=GENERIC_L462RETX
GenL4.menu.pnum.GENERIC_L462RETX.build.product_line=STM32L462xx
GenL4.menu.pnum.GENERIC_L462RETX.build.variant=STM32L4xx/L452RC(I-T-Y)_L452RE(I-T-Y)x(P)_L462RE(I-T-Y)
GenL4.menu.pnum.GENERIC_L462RETX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L462.svd

# Generic L462REYx
GenL4.menu.pnum.GENERIC_L462REYX=Generic L462REYx
GenL4.menu.pnum.GENERIC_L462REYX.upload.maximum_size=524288
GenL4.menu.pnum.GENERIC_L462REYX.upload.maximum_data_size=163840
GenL4.menu.pnum.GENERIC_L462REYX.build.board=GENERIC_L462REYX
GenL4.menu.pnum.GENERIC_L462REYX.build.product_line=STM32L462xx
GenL4.menu.pnum.GENERIC_L462REYX.build.variant=STM32L4xx/L452RC(I-T-Y)_L452RE(I-T-Y)x(P)_L462RE(I-T-Y)
GenL4.menu.pnum.GENERIC_L462REYX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L4x2.svd

# Generic L475RCTx
GenL4.menu.pnum.GENERIC_L475RCTX=Generic L475RCTx
GenL4.menu.pnum.GENERIC_L475RCTX.upload.maximum_size=262144
GenL4.menu.pnum.GENERIC_L475RCTX.upload.maximum_data_size=98304
GenL4.menu.pnum.GENERIC_L475RCTX.build.board=GENERIC_L475RCTX
GenL4.menu.pnum.GENERIC_L475RCTX.build.product_line=STM32L475xx
GenL4.menu.pnum.GENERIC_L475RCTX.build.variant=STM32L4xx/L475R(C-E-G)T_L476R(C-E-G)T_L486RGT
GenL4.menu.pnum.GENERIC_L475RCTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L475.svd

# Generic L475RETx
GenL4.menu.pnum.GENERIC_L475RETX=Generic L475RETx
GenL4.menu.pnum.GENERIC_L475RETX.upload.maximum_size=524288
GenL4.menu.pnum.GENERIC_L475RETX.upload.maximum_data_size=98304
GenL4.menu.pnum.GENERIC_L475RETX.build.board=GENERIC_L475RETX
GenL4.menu.pnum.GENERIC_L475RETX.build.product_line=STM32L475xx
GenL4.menu.pnum.GENERIC_L475RETX.build.variant=STM32L4xx/L475R(C-E-G)T_L476R(C-E-G)T_L486RGT
GenL4.menu.pnum.GENERIC_L475RETX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L475.svd

# Generic L475RGTx
GenL4.menu.pnum.GENERIC_L475RGTX=Generic L475RGTx
GenL4.menu.pnum.GENERIC_L475RGTX.upload.maximum_size=1048576
GenL4.menu.pnum.GENERIC_L475RGTX.upload.maximum_data_size=98304
GenL4.menu.pnum.GENERIC_L475RGTX.build.board=GENERIC_L475RGTX
GenL4.menu.pnum.GENERIC_L475RGTX.build.product_line=STM32L475xx
GenL4.menu.pnum.GENERIC_L475RGTX.build.variant=STM32L4xx/L475R(C-E-G)T_L476R(C-E-G)T_L486RGT
GenL4.menu.pnum.GENERIC_L475RGTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L475.svd

# Generic L475VCTx
GenL4.menu.pnum.GENERIC_L475VCTX=Generic L475VCTx
GenL4.menu.pnum.GENERIC_L475VCTX.upload.maximum_size=262144
GenL4.menu.pnum.GENERIC_L475VCTX.upload.maximum_data_size=98304
GenL4.menu.pnum.GENERIC_L475VCTX.build.board=GENERIC_L475VCTX
GenL4.menu.pnum.GENERIC_L475VCTX.build.product_line=STM32L475xx
GenL4.menu.pnum.GENERIC_L475VCTX.build.variant=STM32L4xx/L475V(C-E-G)T_L476V(C-E-G)T_L486VGT
GenL4.menu.pnum.GENERIC_L475VCTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L475.svd

# Generic L475VETx
GenL4.menu.pnum.GENERIC_L475VETX=Generic L475VETx
GenL4.menu.pnum.GENERIC_L475VETX.upload.maximum_size=524288
GenL4.menu.pnum.GENERIC_L475VETX.upload.maximum_data_size=98304
GenL4.menu.pnum.GENERIC_L475VETX.build.board=GENERIC_L475VETX
GenL4.menu.pnum.GENERIC_L475VETX.build.product_line=STM32L475xx
GenL4.menu.pnum.GENERIC_L475VETX.build.variant=STM32L4xx/L475V(C-E-G)T_L476V(C-E-G)T_L486VGT
GenL4.menu.pnum.GENERIC_L475VETX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L475.svd

# Generic L475VGTx
GenL4.menu.pnum.GENERIC_L475VGTX=Generic L475VGTx
GenL4.menu.pnum.GENERIC_L475VGTX.upload.maximum_size=1048576
GenL4.menu.pnum.GENERIC_L475VGTX.upload.maximum_data_size=98304
GenL4.menu.pnum.GENERIC_L475VGTX.build.board=GENERIC_L475VGTX
GenL4.menu.pnum.GENERIC_L475VGTX.build.product_line=STM32L475xx
GenL4.menu.pnum.GENERIC_L475VGTX.build.variant=STM32L4xx/L475V(C-E-G)T_L476V(C-E-G)T_L486VGT
GenL4.menu.pnum.GENERIC_L475VGTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L475.svd

# Generic L476RCTx
GenL4.menu.pnum.GENERIC_L476RCTX=Generic L476RCTx
GenL4.menu.pnum.GENERIC_L476RCTX.upload.maximum_size=262144
GenL4.menu.pnum.GENERIC_L476RCTX.upload.maximum_data_size=98304
GenL4.menu.pnum.GENERIC_L476RCTX.build.board=GENERIC_L476RCTX
GenL4.menu.pnum.GENERIC_L476RCTX.build.product_line=STM32L476xx
GenL4.menu.pnum.GENERIC_L476RCTX.build.variant=STM32L4xx/L475R(C-E-G)T_L476R(C-E-G)T_L486RGT
GenL4.menu.pnum.GENERIC_L476RCTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L476.svd

