stm32duino/Arduino_Core_STM32/boards.txt
# Generic L476RETx
GenL4.menu.pnum.GENERIC_L476RETX=Generic L476RETx
GenL4.menu.pnum.GENERIC_L476RETX.upload.maximum_size=524288
GenL4.menu.pnum.GENERIC_L476RETX.upload.maximum_data_size=98304
GenL4.menu.pnum.GENERIC_L476RETX.build.board=GENERIC_L476RETX
GenL4.menu.pnum.GENERIC_L476RETX.build.product_line=STM32L476xx
GenL4.menu.pnum.GENERIC_L476RETX.build.variant=STM32L4xx/L475R(C-E-G)T_L476R(C-E-G)T_L486RGT
GenL4.menu.pnum.GENERIC_L476RETX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L476.svd

# Generic L476RGTx
GenL4.menu.pnum.GENERIC_L476RGTX=Generic L476RGTx
GenL4.menu.pnum.GENERIC_L476RGTX.upload.maximum_size=1048576
GenL4.menu.pnum.GENERIC_L476RGTX.upload.maximum_data_size=98304
GenL4.menu.pnum.GENERIC_L476RGTX.build.board=GENERIC_L476RGTX
GenL4.menu.pnum.GENERIC_L476RGTX.build.product_line=STM32L476xx
GenL4.menu.pnum.GENERIC_L476RGTX.build.variant=STM32L4xx/L475R(C-E-G)T_L476R(C-E-G)T_L486RGT
GenL4.menu.pnum.GENERIC_L476RGTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L476.svd

# Generic L476VCTx
GenL4.menu.pnum.GENERIC_L476VCTX=Generic L476VCTx
GenL4.menu.pnum.GENERIC_L476VCTX.upload.maximum_size=262144
GenL4.menu.pnum.GENERIC_L476VCTX.upload.maximum_data_size=98304
GenL4.menu.pnum.GENERIC_L476VCTX.build.board=GENERIC_L476VCTX
GenL4.menu.pnum.GENERIC_L476VCTX.build.product_line=STM32L476xx
GenL4.menu.pnum.GENERIC_L476VCTX.build.variant=STM32L4xx/L475V(C-E-G)T_L476V(C-E-G)T_L486VGT
GenL4.menu.pnum.GENERIC_L476VCTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L476.svd

# Generic L476VETx
GenL4.menu.pnum.GENERIC_L476VETX=Generic L476VETx
GenL4.menu.pnum.GENERIC_L476VETX.upload.maximum_size=524288
GenL4.menu.pnum.GENERIC_L476VETX.upload.maximum_data_size=98304
GenL4.menu.pnum.GENERIC_L476VETX.build.board=GENERIC_L476VETX
GenL4.menu.pnum.GENERIC_L476VETX.build.product_line=STM32L476xx
GenL4.menu.pnum.GENERIC_L476VETX.build.variant=STM32L4xx/L475V(C-E-G)T_L476V(C-E-G)T_L486VGT
GenL4.menu.pnum.GENERIC_L476VETX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L476.svd

# Generic L476VGTx
GenL4.menu.pnum.GENERIC_L476VGTX=Generic L476VGTx
GenL4.menu.pnum.GENERIC_L476VGTX.upload.maximum_size=1048576
GenL4.menu.pnum.GENERIC_L476VGTX.upload.maximum_data_size=98304
GenL4.menu.pnum.GENERIC_L476VGTX.build.board=GENERIC_L476VGTX
GenL4.menu.pnum.GENERIC_L476VGTX.build.product_line=STM32L476xx
GenL4.menu.pnum.GENERIC_L476VGTX.build.variant=STM32L4xx/L475V(C-E-G)T_L476V(C-E-G)T_L486VGT
GenL4.menu.pnum.GENERIC_L476VGTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L476.svd

# Generic L486RGTx
GenL4.menu.pnum.GENERIC_L486RGTX=Generic L486RGTx
GenL4.menu.pnum.GENERIC_L486RGTX.upload.maximum_size=1048576
GenL4.menu.pnum.GENERIC_L486RGTX.upload.maximum_data_size=98304
GenL4.menu.pnum.GENERIC_L486RGTX.build.board=GENERIC_L486RGTX
GenL4.menu.pnum.GENERIC_L486RGTX.build.product_line=STM32L486xx
GenL4.menu.pnum.GENERIC_L486RGTX.build.variant=STM32L4xx/L475R(C-E-G)T_L476R(C-E-G)T_L486RGT
GenL4.menu.pnum.GENERIC_L486RGTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L486.svd

# Generic L486VGTx
GenL4.menu.pnum.GENERIC_L486VGTX=Generic L486VGTx
GenL4.menu.pnum.GENERIC_L486VGTX.upload.maximum_size=1048576
GenL4.menu.pnum.GENERIC_L486VGTX.upload.maximum_data_size=98304
GenL4.menu.pnum.GENERIC_L486VGTX.build.board=GENERIC_L486VGTX
GenL4.menu.pnum.GENERIC_L486VGTX.build.product_line=STM32L486xx
GenL4.menu.pnum.GENERIC_L486VGTX.build.variant=STM32L4xx/L475V(C-E-G)T_L476V(C-E-G)T_L486VGT
GenL4.menu.pnum.GENERIC_L486VGTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L486.svd

# Generic L496ZETx
GenL4.menu.pnum.GENERIC_L496ZETX=Generic L496ZETx
GenL4.menu.pnum.GENERIC_L496ZETX.upload.maximum_size=524288
GenL4.menu.pnum.GENERIC_L496ZETX.upload.maximum_data_size=327680
GenL4.menu.pnum.GENERIC_L496ZETX.build.board=GENERIC_L496ZETX
GenL4.menu.pnum.GENERIC_L496ZETX.build.product_line=STM32L496xx
GenL4.menu.pnum.GENERIC_L496ZETX.build.variant=STM32L4xx/L496Z(E-G)T_L4A6ZGT
GenL4.menu.pnum.GENERIC_L496ZETX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L496.svd

# Generic L496ZGTx
GenL4.menu.pnum.GENERIC_L496ZGTX=Generic L496ZGTx
GenL4.menu.pnum.GENERIC_L496ZGTX.upload.maximum_size=1048576
GenL4.menu.pnum.GENERIC_L496ZGTX.upload.maximum_data_size=327680
GenL4.menu.pnum.GENERIC_L496ZGTX.build.board=GENERIC_L496ZGTX
GenL4.menu.pnum.GENERIC_L496ZGTX.build.product_line=STM32L496xx
GenL4.menu.pnum.GENERIC_L496ZGTX.build.variant=STM32L4xx/L496Z(E-G)T_L4A6ZGT
GenL4.menu.pnum.GENERIC_L496ZGTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L496.svd

# Generic L496ZGTxP
GenL4.menu.pnum.GENERIC_L496ZGTXP=Generic L496ZGTxP
GenL4.menu.pnum.GENERIC_L496ZGTXP.upload.maximum_size=1048576
GenL4.menu.pnum.GENERIC_L496ZGTXP.upload.maximum_data_size=327680
GenL4.menu.pnum.GENERIC_L496ZGTXP.build.board=GENERIC_L496ZGTXP
GenL4.menu.pnum.GENERIC_L496ZGTXP.build.product_line=STM32L496xx
GenL4.menu.pnum.GENERIC_L496ZGTXP.build.variant=STM32L4xx/L496ZGTxP_L4A6ZGTxP
GenL4.menu.pnum.GENERIC_L496ZGTXP.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L496.svd

# Generic L4A6ZGTx
GenL4.menu.pnum.GENERIC_L4A6ZGTX=Generic L4A6ZGTx
GenL4.menu.pnum.GENERIC_L4A6ZGTX.upload.maximum_size=1048576
GenL4.menu.pnum.GENERIC_L4A6ZGTX.upload.maximum_data_size=327680
GenL4.menu.pnum.GENERIC_L4A6ZGTX.build.board=GENERIC_L4A6ZGTX
GenL4.menu.pnum.GENERIC_L4A6ZGTX.build.product_line=STM32L4A6xx
GenL4.menu.pnum.GENERIC_L4A6ZGTX.build.variant=STM32L4xx/L496Z(E-G)T_L4A6ZGT
GenL4.menu.pnum.GENERIC_L4A6ZGTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L4A6.svd

# Generic L4A6ZGTxP
GenL4.menu.pnum.GENERIC_L4A6ZGTXP=Generic L4A6ZGTxP
GenL4.menu.pnum.GENERIC_L4A6ZGTXP.upload.maximum_size=1048576
GenL4.menu.pnum.GENERIC_L4A6ZGTXP.upload.maximum_data_size=327680
GenL4.menu.pnum.GENERIC_L4A6ZGTXP.build.board=GENERIC_L4A6ZGTXP
GenL4.menu.pnum.GENERIC_L4A6ZGTXP.build.product_line=STM32L4A6xx
GenL4.menu.pnum.GENERIC_L4A6ZGTXP.build.variant=STM32L4xx/L496ZGTxP_L4A6ZGTxP
GenL4.menu.pnum.GENERIC_L4A6ZGTXP.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L4A6.svd

