stm32duino/Arduino_Core_STM32/boards.txt
GenL4.menu.upload_method.jlinkMethod=STM32CubeProgrammer (J-Link)
GenL4.menu.upload_method.jlinkMethod.upload.protocol=jlink
GenL4.menu.upload_method.jlinkMethod.upload.options=
GenL4.menu.upload_method.jlinkMethod.upload.tool=stm32CubeProg

GenL4.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenL4.menu.upload_method.serialMethod.upload.protocol=serial
GenL4.menu.upload_method.serialMethod.upload.options=-c {serial.port.file}
GenL4.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenL4.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenL4.menu.upload_method.dfuMethod.upload.protocol=dfu
GenL4.menu.upload_method.dfuMethod.upload.options=-v {upload.vid} -p {upload.pid}
GenL4.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

GenL4.menu.upload_method.bmpMethod=BMP (Black Magic Probe)
GenL4.menu.upload_method.bmpMethod.upload.protocol=gdb_bmp
GenL4.menu.upload_method.bmpMethod.upload.tool=bmp_upload

GenL4.menu.upload_method.OpenOCDSTLink=OpenOCD STLink (SWD)
GenL4.menu.upload_method.OpenOCDSTLink.upload.protocol=stlink
GenL4.menu.upload_method.OpenOCDSTLink.upload.tool=openocd_upload

GenL4.menu.upload_method.OpenOCDDapLink=OpenOCD DapLink (SWD)
GenL4.menu.upload_method.OpenOCDDapLink.upload.protocol=cmsis-dap
GenL4.menu.upload_method.OpenOCDDapLink.upload.tool=openocd_upload

################################################################################
# Generic L5
GenL5.name=Generic STM32L5 series

GenL5.build.core=arduino
GenL5.build.board=GenL5
GenL5.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
GenL5.build.mcu=cortex-m33
GenL5.build.fpu=-mfpu=fpv4-sp-d16
GenL5.build.float-abi=-mfloat-abi=hard
GenL5.build.series=STM32L5xx
GenL5.build.flash_offset=0x0
GenL5.upload.maximum_size=0
GenL5.upload.maximum_data_size=0
GenL5.openocd.target=stm32l5x
GenL5.vid.0=0x0483
GenL5.pid.0=0x5740

# Generic L552QCIxQ
GenL5.menu.pnum.GENERIC_L552QCIXQ=Generic L552QCIxQ
GenL5.menu.pnum.GENERIC_L552QCIXQ.upload.maximum_size=262144
GenL5.menu.pnum.GENERIC_L552QCIXQ.upload.maximum_data_size=262144
GenL5.menu.pnum.GENERIC_L552QCIXQ.build.board=GENERIC_L552QCIXQ
GenL5.menu.pnum.GENERIC_L552QCIXQ.build.product_line=STM32L552xx
GenL5.menu.pnum.GENERIC_L552QCIXQ.build.variant=STM32L5xx/L552Q(C-E)IxQ_L562QEIxQ
GenL5.menu.pnum.GENERIC_L552QCIXQ.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L5xx/STM32L552.svd

# Generic L552QEIxQ
GenL5.menu.pnum.GENERIC_L552QEIXQ=Generic L552QEIxQ
GenL5.menu.pnum.GENERIC_L552QEIXQ.upload.maximum_size=524288
GenL5.menu.pnum.GENERIC_L552QEIXQ.upload.maximum_data_size=262144
GenL5.menu.pnum.GENERIC_L552QEIXQ.build.board=GENERIC_L552QEIXQ
GenL5.menu.pnum.GENERIC_L552QEIXQ.build.product_line=STM32L552xx
GenL5.menu.pnum.GENERIC_L552QEIXQ.build.variant=STM32L5xx/L552Q(C-E)IxQ_L562QEIxQ
GenL5.menu.pnum.GENERIC_L552QEIXQ.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L5xx/STM32L552.svd

# Generic L552ZCTxQ
GenL5.menu.pnum.GENERIC_L552ZCTXQ=Generic L552ZCTxQ
GenL5.menu.pnum.GENERIC_L552ZCTXQ.upload.maximum_size=262144
GenL5.menu.pnum.GENERIC_L552ZCTXQ.upload.maximum_data_size=196608
GenL5.menu.pnum.GENERIC_L552ZCTXQ.build.board=GENERIC_L552ZCTXQ
GenL5.menu.pnum.GENERIC_L552ZCTXQ.build.product_line=STM32L552xx
GenL5.menu.pnum.GENERIC_L552ZCTXQ.build.variant=STM32L5xx/L552Z(C-E)TxQ_L562ZETxQ
GenL5.menu.pnum.GENERIC_L552ZCTXQ.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L5xx/STM32L552.svd

# Generic L552ZETxQ
GenL5.menu.pnum.GENERIC_L552ZETXQ=Generic L552ZETxQ
GenL5.menu.pnum.GENERIC_L552ZETXQ.upload.maximum_size=524288
GenL5.menu.pnum.GENERIC_L552ZETXQ.upload.maximum_data_size=196608
GenL5.menu.pnum.GENERIC_L552ZETXQ.build.board=GENERIC_L552ZETXQ
GenL5.menu.pnum.GENERIC_L552ZETXQ.build.product_line=STM32L552xx
GenL5.menu.pnum.GENERIC_L552ZETXQ.build.variant=STM32L5xx/L552Z(C-E)TxQ_L562ZETxQ
GenL5.menu.pnum.GENERIC_L552ZETXQ.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L5xx/STM32L552.svd

# Generic L562QC-EIxQ
GenL5.menu.pnum.GENERIC_L562QEIXQ=Generic L562QC-EIxQ
GenL5.menu.pnum.GENERIC_L562QEIXQ.upload.maximum_size=524288
GenL5.menu.pnum.GENERIC_L562QEIXQ.upload.maximum_data_size=196608
GenL5.menu.pnum.GENERIC_L562QEIXQ.build.board=GENERIC_L562QEIXQ
GenL5.menu.pnum.GENERIC_L562QEIXQ.build.product_line=STM32L562xx
GenL5.menu.pnum.GENERIC_L562QEIXQ.build.variant=STM32L5xx/L552Q(C-E)IxQ_L562QEIxQ
GenL5.menu.pnum.GENERIC_L562QEIXQ.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L5xx/STM32L562.svd

# Generic L562ZETxQ
GenL5.menu.pnum.GENERIC_L562ZETXQ=Generic L562ZETxQ
GenL5.menu.pnum.GENERIC_L562ZETXQ.upload.maximum_size=524288
GenL5.menu.pnum.GENERIC_L562ZETXQ.upload.maximum_data_size=196608
GenL5.menu.pnum.GENERIC_L562ZETXQ.build.board=GENERIC_L562ZETXQ
GenL5.menu.pnum.GENERIC_L562ZETXQ.build.product_line=STM32L562xx
GenL5.menu.pnum.GENERIC_L562ZETXQ.build.variant=STM32L5xx/L552Z(C-E)TxQ_L562ZETxQ
GenL5.menu.pnum.GENERIC_L562ZETXQ.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L5xx/STM32L562.svd

# Upload menu
GenL5.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenL5.menu.upload_method.swdMethod.upload.protocol=swd
GenL5.menu.upload_method.swdMethod.upload.options=
GenL5.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenL5.menu.upload_method.jlinkMethod=STM32CubeProgrammer (J-Link)
GenL5.menu.upload_method.jlinkMethod.upload.protocol=jlink
GenL5.menu.upload_method.jlinkMethod.upload.options=
GenL5.menu.upload_method.jlinkMethod.upload.tool=stm32CubeProg

GenL5.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenL5.menu.upload_method.serialMethod.upload.protocol=serial
GenL5.menu.upload_method.serialMethod.upload.options=-c {serial.port.file}
GenL5.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenL5.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenL5.menu.upload_method.dfuMethod.upload.protocol=dfu
GenL5.menu.upload_method.dfuMethod.upload.options=-v {upload.vid} -p {upload.pid}
GenL5.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

