stm32duino/Arduino_Core_STM32/boards.txt
GenL5.menu.upload_method.bmpMethod=BMP (Black Magic Probe)
GenL5.menu.upload_method.bmpMethod.upload.protocol=gdb_bmp
GenL5.menu.upload_method.bmpMethod.upload.tool=bmp_upload

GenL5.menu.upload_method.OpenOCDSTLink=OpenOCD STLink (SWD)
GenL5.menu.upload_method.OpenOCDSTLink.upload.protocol=stlink
GenL5.menu.upload_method.OpenOCDSTLink.upload.tool=openocd_upload

GenL5.menu.upload_method.OpenOCDDapLink=OpenOCD DapLink (SWD)
GenL5.menu.upload_method.OpenOCDDapLink.upload.protocol=cmsis-dap
GenL5.menu.upload_method.OpenOCDDapLink.upload.tool=openocd_upload

###############################
# Generic U0
GenU0.name=Generic STM32U0 series

GenU0.build.core=arduino
GenU0.build.board=GenG0
GenU0.build.mcu=cortex-m0plus
GenU0.build.series=STM32U0xx
GenU0.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} -D__CORTEX_SC=0
GenU0.build.flash_offset=0x0
GenU0.upload.maximum_size=0
GenU0.upload.maximum_data_size=0
GenU0.openocd.target=stm32u0x
GenU0.vid.0=0x0483
GenU0.pid.0=0x5740

# Generic U073C8Tx
GenU0.menu.pnum.GENERIC_U073C8TX=Generic U073C8Tx
GenU0.menu.pnum.GENERIC_U073C8TX.upload.maximum_size=65536
GenU0.menu.pnum.GENERIC_U073C8TX.upload.maximum_data_size=40960
GenU0.menu.pnum.GENERIC_U073C8TX.build.board=GENERIC_U073C8TX
GenU0.menu.pnum.GENERIC_U073C8TX.build.product_line=STM32U073xx
GenU0.menu.pnum.GENERIC_U073C8TX.build.variant=STM32U0xx/U073C(8-B-C)(T-U)_U083CC(T-U)
GenU0.menu.pnum.GENERIC_U073C8TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32U0xx/STM32U073.svd

# Generic U073C8Ux
GenU0.menu.pnum.GENERIC_U073C8UX=Generic U073C8Ux
GenU0.menu.pnum.GENERIC_U073C8UX.upload.maximum_size=65536
GenU0.menu.pnum.GENERIC_U073C8UX.upload.maximum_data_size=40960
GenU0.menu.pnum.GENERIC_U073C8UX.build.board=GENERIC_U073C8UX
GenU0.menu.pnum.GENERIC_U073C8UX.build.product_line=STM32U073xx
GenU0.menu.pnum.GENERIC_U073C8UX.build.variant=STM32U0xx/U073C(8-B-C)(T-U)_U083CC(T-U)
GenU0.menu.pnum.GENERIC_U073C8UX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32U0xx/STM32U073.svd

# Generic U073CBTx
GenU0.menu.pnum.GENERIC_U073CBTX=Generic U073CBTx
GenU0.menu.pnum.GENERIC_U073CBTX.upload.maximum_size=131072
GenU0.menu.pnum.GENERIC_U073CBTX.upload.maximum_data_size=40960
GenU0.menu.pnum.GENERIC_U073CBTX.build.board=GENERIC_U073CBTX
GenU0.menu.pnum.GENERIC_U073CBTX.build.product_line=STM32U073xx
GenU0.menu.pnum.GENERIC_U073CBTX.build.variant=STM32U0xx/U073C(8-B-C)(T-U)_U083CC(T-U)
GenU0.menu.pnum.GENERIC_U073CBTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32U0xx/STM32U073.svd

# Generic U073CBUx
GenU0.menu.pnum.GENERIC_U073CBUX=Generic U073CBUx
GenU0.menu.pnum.GENERIC_U073CBUX.upload.maximum_size=131072
GenU0.menu.pnum.GENERIC_U073CBUX.upload.maximum_data_size=40960
GenU0.menu.pnum.GENERIC_U073CBUX.build.board=GENERIC_U073CBUX
GenU0.menu.pnum.GENERIC_U073CBUX.build.product_line=STM32U073xx
GenU0.menu.pnum.GENERIC_U073CBUX.build.variant=STM32U0xx/U073C(8-B-C)(T-U)_U083CC(T-U)
GenU0.menu.pnum.GENERIC_U073CBUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32U0xx/STM32U073.svd

# Generic U073CCTx
GenU0.menu.pnum.GENERIC_U073CCTX=Generic U073CCTx
GenU0.menu.pnum.GENERIC_U073CCTX.upload.maximum_size=262144
GenU0.menu.pnum.GENERIC_U073CCTX.upload.maximum_data_size=40960
GenU0.menu.pnum.GENERIC_U073CCTX.build.board=GENERIC_U073CCTX
GenU0.menu.pnum.GENERIC_U073CCTX.build.product_line=STM32U073xx
GenU0.menu.pnum.GENERIC_U073CCTX.build.variant=STM32U0xx/U073C(8-B-C)(T-U)_U083CC(T-U)
GenU0.menu.pnum.GENERIC_U073CCTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32U0xx/STM32U073.svd

# Generic U073CCUx
GenU0.menu.pnum.GENERIC_U073CCUX=Generic U073CCUx
GenU0.menu.pnum.GENERIC_U073CCUX.upload.maximum_size=262144
GenU0.menu.pnum.GENERIC_U073CCUX.upload.maximum_data_size=40960
GenU0.menu.pnum.GENERIC_U073CCUX.build.board=GENERIC_U073CCUX
GenU0.menu.pnum.GENERIC_U073CCUX.build.product_line=STM32U073xx
GenU0.menu.pnum.GENERIC_U073CCUX.build.variant=STM32U0xx/U073C(8-B-C)(T-U)_U083CC(T-U)
GenU0.menu.pnum.GENERIC_U073CCUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32U0xx/STM32U073.svd

# Generic U073R8Ix
GenU0.menu.pnum.GENERIC_U073R8IX=Generic U073R8Ix
GenU0.menu.pnum.GENERIC_U073R8IX.upload.maximum_size=65536
GenU0.menu.pnum.GENERIC_U073R8IX.upload.maximum_data_size=40960
GenU0.menu.pnum.GENERIC_U073R8IX.build.board=GENERIC_U073R8IX
GenU0.menu.pnum.GENERIC_U073R8IX.build.product_line=STM32U073xx
GenU0.menu.pnum.GENERIC_U073R8IX.build.variant=STM32U0xx/U073R(8-B-C)(I-T)_U083RC(I-T)
GenU0.menu.pnum.GENERIC_U073R8IX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32U0xx/STM32U073.svd

# Generic U073R8Tx
GenU0.menu.pnum.GENERIC_U073R8TX=Generic U073R8Tx
GenU0.menu.pnum.GENERIC_U073R8TX.upload.maximum_size=65536
GenU0.menu.pnum.GENERIC_U073R8TX.upload.maximum_data_size=40960
GenU0.menu.pnum.GENERIC_U073R8TX.build.board=GENERIC_U073R8TX
GenU0.menu.pnum.GENERIC_U073R8TX.build.product_line=STM32U073xx
GenU0.menu.pnum.GENERIC_U073R8TX.build.variant=STM32U0xx/U073R(8-B-C)(I-T)_U083RC(I-T)
GenU0.menu.pnum.GENERIC_U073R8TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32U0xx/STM32U073.svd

# Generic U073RBIx
GenU0.menu.pnum.GENERIC_U073RBIX=Generic U073RBIx
GenU0.menu.pnum.GENERIC_U073RBIX.upload.maximum_size=131072
GenU0.menu.pnum.GENERIC_U073RBIX.upload.maximum_data_size=40960
GenU0.menu.pnum.GENERIC_U073RBIX.build.board=GENERIC_U073RBIX
GenU0.menu.pnum.GENERIC_U073RBIX.build.product_line=STM32U073xx
GenU0.menu.pnum.GENERIC_U073RBIX.build.variant=STM32U0xx/U073R(8-B-C)(I-T)_U083RC(I-T)
GenU0.menu.pnum.GENERIC_U073RBIX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32U0xx/STM32U073.svd

# Generic U073RBTx
GenU0.menu.pnum.GENERIC_U073RBTX=Generic U073RBTx
GenU0.menu.pnum.GENERIC_U073RBTX.upload.maximum_size=131072
GenU0.menu.pnum.GENERIC_U073RBTX.upload.maximum_data_size=40960
GenU0.menu.pnum.GENERIC_U073RBTX.build.board=GENERIC_U073RBTX
GenU0.menu.pnum.GENERIC_U073RBTX.build.product_line=STM32U073xx
GenU0.menu.pnum.GENERIC_U073RBTX.build.variant=STM32U0xx/U073R(8-B-C)(I-T)_U083RC(I-T)
GenU0.menu.pnum.GENERIC_U073RBTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32U0xx/STM32U073.svd

# Generic U073RCIx
GenU0.menu.pnum.GENERIC_U073RCIX=Generic U073RCIx
GenU0.menu.pnum.GENERIC_U073RCIX.upload.maximum_size=262144
GenU0.menu.pnum.GENERIC_U073RCIX.upload.maximum_data_size=40960
GenU0.menu.pnum.GENERIC_U073RCIX.build.board=GENERIC_U073RCIX
GenU0.menu.pnum.GENERIC_U073RCIX.build.product_line=STM32U073xx
GenU0.menu.pnum.GENERIC_U073RCIX.build.variant=STM32U0xx/U073R(8-B-C)(I-T)_U083RC(I-T)
GenU0.menu.pnum.GENERIC_U073RCIX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32U0xx/STM32U073.svd

# Generic U073RCTx
GenU0.menu.pnum.GENERIC_U073RCTX=Generic U073RCTx
GenU0.menu.pnum.GENERIC_U073RCTX.upload.maximum_size=262144
GenU0.menu.pnum.GENERIC_U073RCTX.upload.maximum_data_size=40960
GenU0.menu.pnum.GENERIC_U073RCTX.build.board=GENERIC_U073RCTX
GenU0.menu.pnum.GENERIC_U073RCTX.build.product_line=STM32U073xx
GenU0.menu.pnum.GENERIC_U073RCTX.build.variant=STM32U0xx/U073R(8-B-C)(I-T)_U083RC(I-T)
GenU0.menu.pnum.GENERIC_U073RCTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32U0xx/STM32U073.svd

# Generic U083CCTx
GenU0.menu.pnum.GENERIC_U083CCTX=Generic U083CCTx
GenU0.menu.pnum.GENERIC_U083CCTX.upload.maximum_size=262144
GenU0.menu.pnum.GENERIC_U083CCTX.upload.maximum_data_size=40960
GenU0.menu.pnum.GENERIC_U083CCTX.build.board=GENERIC_U083CCTX
GenU0.menu.pnum.GENERIC_U083CCTX.build.product_line=STM32U083xx
GenU0.menu.pnum.GENERIC_U083CCTX.build.variant=STM32U0xx/U073C(8-B-C)(T-U)_U083CC(T-U)
GenU0.menu.pnum.GENERIC_U083CCTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32U0xx/STM32U083.svd

# Generic U083CCUx
GenU0.menu.pnum.GENERIC_U083CCUX=Generic U083CCUx
GenU0.menu.pnum.GENERIC_U083CCUX.upload.maximum_size=262144
GenU0.menu.pnum.GENERIC_U083CCUX.upload.maximum_data_size=40960
GenU0.menu.pnum.GENERIC_U083CCUX.build.board=GENERIC_U083CCUX
GenU0.menu.pnum.GENERIC_U083CCUX.build.product_line=STM32U083xx
GenU0.menu.pnum.GENERIC_U083CCUX.build.variant=STM32U0xx/U073C(8-B-C)(T-U)_U083CC(T-U)
GenU0.menu.pnum.GENERIC_U083CCUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32U0xx/STM32U083.svd

