stm32duino/Arduino_Core_STM32/boards.txt
# Generic U083RCIx
GenU0.menu.pnum.GENERIC_U083RCIX=Generic U083RCIx
GenU0.menu.pnum.GENERIC_U083RCIX.upload.maximum_size=262144
GenU0.menu.pnum.GENERIC_U083RCIX.upload.maximum_data_size=40960
GenU0.menu.pnum.GENERIC_U083RCIX.build.board=GENERIC_U083RCIX
GenU0.menu.pnum.GENERIC_U083RCIX.build.product_line=STM32U083xx
GenU0.menu.pnum.GENERIC_U083RCIX.build.variant=STM32U0xx/U073R(8-B-C)(I-T)_U083RC(I-T)
GenU0.menu.pnum.GENERIC_U083RCIX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32U0xx/STM32U083.svd

# Generic U083RCTx
GenU0.menu.pnum.GENERIC_U083RCTX=Generic U083RCTx
GenU0.menu.pnum.GENERIC_U083RCTX.upload.maximum_size=262144
GenU0.menu.pnum.GENERIC_U083RCTX.upload.maximum_data_size=40960
GenU0.menu.pnum.GENERIC_U083RCTX.build.board=GENERIC_U083RCTX
GenU0.menu.pnum.GENERIC_U083RCTX.build.product_line=STM32U083xx
GenU0.menu.pnum.GENERIC_U083RCTX.build.variant=STM32U0xx/U073R(8-B-C)(I-T)_U083RC(I-T)
GenU0.menu.pnum.GENERIC_U083RCTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32U0xx/STM32U083.svd

# Upload menu
GenU0.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenU0.menu.upload_method.swdMethod.upload.protocol=swd
GenU0.menu.upload_method.swdMethod.upload.options=
GenU0.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenU0.menu.upload_method.jlinkMethod=STM32CubeProgrammer (J-Link)
GenU0.menu.upload_method.jlinkMethod.upload.protocol=jlink
GenU0.menu.upload_method.jlinkMethod.upload.options=
GenU0.menu.upload_method.jlinkMethod.upload.tool=stm32CubeProg

GenU0.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenU0.menu.upload_method.serialMethod.upload.protocol=serial
GenU0.menu.upload_method.serialMethod.upload.options=-c {serial.port.file}
GenU0.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenU0.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenU0.menu.upload_method.dfuMethod.upload.protocol=dfu
GenU0.menu.upload_method.dfuMethod.upload.options=-v {upload.vid} -p {upload.pid}
GenU0.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

#GenU0.menu.upload_method.OpenOCDSTLink=OpenOCD STLink (SWD)
#GenU0.menu.upload_method.OpenOCDSTLink.upload.protocol=stlink
#GenU0.menu.upload_method.OpenOCDSTLink.upload.tool=openocd_upload

#GenU0.menu.upload_method.OpenOCDDapLink=OpenOCD DapLink (SWD)
#GenU0.menu.upload_method.OpenOCDDapLink.upload.protocol=cmsis-dap
#GenU0.menu.upload_method.OpenOCDDapLink.upload.tool=openocd_upload

################################################################################
# Generic U3
GenU3.name=Generic STM32U3 series

GenU3.build.core=arduino
GenU3.build.board=GenU3
GenU3.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
GenU3.build.mcu=cortex-m33
GenU3.build.fpu=-mfpu=fpv4-sp-d16
GenU3.build.float-abi=-mfloat-abi=hard
GenU3.build.series=STM32U3xx
GenU3.build.flash_offset=0x0
GenU3.upload.maximum_size=0
GenU3.upload.maximum_data_size=0
# GenU3.openocd.target=stm32u3x
GenU3.vid.0=0x0483
GenU3.pid.0=0x5740

# Generic U375RETxQ
GenU3.menu.pnum.GENERIC_U375RETXQ=Generic U375RETxQ
GenU3.menu.pnum.GENERIC_U375RETXQ.upload.maximum_size=524288
GenU3.menu.pnum.GENERIC_U375RETXQ.upload.maximum_data_size=262144
GenU3.menu.pnum.GENERIC_U375RETXQ.build.board=GENERIC_U375RETXQ
GenU3.menu.pnum.GENERIC_U375RETXQ.build.product_line=STM32U375xx
GenU3.menu.pnum.GENERIC_U375RETXQ.build.variant=STM32U3xx/U375R(E-G)TxQ_U385RGTxQ
GenU3.menu.pnum.GENERIC_U375RETXQ.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32U3xx/STM32U375.svd

# Generic U375RGTxQ
GenU3.menu.pnum.GENERIC_U375RGTXQ=Generic U375RGTxQ
GenU3.menu.pnum.GENERIC_U375RGTXQ.upload.maximum_size=1048576
GenU3.menu.pnum.GENERIC_U375RGTXQ.upload.maximum_data_size=262144
GenU3.menu.pnum.GENERIC_U375RGTXQ.build.board=GENERIC_U375RGTXQ
GenU3.menu.pnum.GENERIC_U375RGTXQ.build.product_line=STM32U375xx
GenU3.menu.pnum.GENERIC_U375RGTXQ.build.variant=STM32U3xx/U375R(E-G)TxQ_U385RGTxQ
GenU3.menu.pnum.GENERIC_U375RGTXQ.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32U3xx/STM32U375.svd

# Generic U375VEIx
GenU3.menu.pnum.GENERIC_U375VEIX=Generic U375VEIx
GenU3.menu.pnum.GENERIC_U375VEIX.upload.maximum_size=524288
GenU3.menu.pnum.GENERIC_U375VEIX.upload.maximum_data_size=262144
GenU3.menu.pnum.GENERIC_U375VEIX.build.board=GENERIC_U375VEIX
GenU3.menu.pnum.GENERIC_U375VEIX.build.product_line=STM32U375xx
GenU3.menu.pnum.GENERIC_U375VEIX.build.variant=STM32U3xx/U375V(E-G)I_U385VGI
GenU3.menu.pnum.GENERIC_U375VEIX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32U3xx/STM32U375.svd

# Generic U375VEIxQ
GenU3.menu.pnum.GENERIC_U375VEIXQ=Generic U375VEIxQ
GenU3.menu.pnum.GENERIC_U375VEIXQ.upload.maximum_size=524288
GenU3.menu.pnum.GENERIC_U375VEIXQ.upload.maximum_data_size=262144
GenU3.menu.pnum.GENERIC_U375VEIXQ.build.board=GENERIC_U375VEIXQ
GenU3.menu.pnum.GENERIC_U375VEIXQ.build.product_line=STM32U375xx
GenU3.menu.pnum.GENERIC_U375VEIXQ.build.variant=STM32U3xx/U375V(E-G)IxQ_U385VGIxQ
GenU3.menu.pnum.GENERIC_U375VEIXQ.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32U3xx/STM32U375.svd

# Generic U375VGIx
GenU3.menu.pnum.GENERIC_U375VGIX=Generic U375VGIx
GenU3.menu.pnum.GENERIC_U375VGIX.upload.maximum_size=1048576
GenU3.menu.pnum.GENERIC_U375VGIX.upload.maximum_data_size=262144
GenU3.menu.pnum.GENERIC_U375VGIX.build.board=GENERIC_U375VGIX
GenU3.menu.pnum.GENERIC_U375VGIX.build.product_line=STM32U375xx
GenU3.menu.pnum.GENERIC_U375VGIX.build.variant=STM32U3xx/U375V(E-G)I_U385VGI
GenU3.menu.pnum.GENERIC_U375VGIX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32U3xx/STM32U375.svd

# Generic U375VGIxQ
GenU3.menu.pnum.GENERIC_U375VGIXQ=Generic U375VGIxQ
GenU3.menu.pnum.GENERIC_U375VGIXQ.upload.maximum_size=1048576
GenU3.menu.pnum.GENERIC_U375VGIXQ.upload.maximum_data_size=262144
GenU3.menu.pnum.GENERIC_U375VGIXQ.build.board=GENERIC_U375VGIXQ
GenU3.menu.pnum.GENERIC_U375VGIXQ.build.product_line=STM32U375xx
GenU3.menu.pnum.GENERIC_U375VGIXQ.build.variant=STM32U3xx/U375V(E-G)IxQ_U385VGIxQ
GenU3.menu.pnum.GENERIC_U375VGIXQ.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32U3xx/STM32U375.svd

# Generic U385RGTxQ
GenU3.menu.pnum.GENERIC_U385RGTXQ=Generic U385RGTxQ
GenU3.menu.pnum.GENERIC_U385RGTXQ.upload.maximum_size=1048576
GenU3.menu.pnum.GENERIC_U385RGTXQ.upload.maximum_data_size=262144
GenU3.menu.pnum.GENERIC_U385RGTXQ.build.board=GENERIC_U385RGTXQ
GenU3.menu.pnum.GENERIC_U385RGTXQ.build.product_line=STM32U385xx
GenU3.menu.pnum.GENERIC_U385RGTXQ.build.variant=STM32U3xx/U375R(E-G)TxQ_U385RGTxQ
GenU3.menu.pnum.GENERIC_U385RGTXQ.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32U3xx/STM32U385.svd

# Generic U385VGIx
GenU3.menu.pnum.GENERIC_U385VGIX=Generic U385VGIx
GenU3.menu.pnum.GENERIC_U385VGIX.upload.maximum_size=1048576
GenU3.menu.pnum.GENERIC_U385VGIX.upload.maximum_data_size=262144
GenU3.menu.pnum.GENERIC_U385VGIX.build.board=GENERIC_U385VGIX
GenU3.menu.pnum.GENERIC_U385VGIX.build.product_line=STM32U385xx
GenU3.menu.pnum.GENERIC_U385VGIX.build.variant=STM32U3xx/U375V(E-G)I_U385VGI
GenU3.menu.pnum.GENERIC_U385VGIX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32U3xx/STM32U385.svd

# Generic U385VGIxQ
GenU3.menu.pnum.GENERIC_U385VGIXQ=Generic U385VGIxQ
GenU3.menu.pnum.GENERIC_U385VGIXQ.upload.maximum_size=1048576
GenU3.menu.pnum.GENERIC_U385VGIXQ.upload.maximum_data_size=262144
GenU3.menu.pnum.GENERIC_U385VGIXQ.build.board=GENERIC_U385VGIXQ
GenU3.menu.pnum.GENERIC_U385VGIXQ.build.product_line=STM32U385xx
GenU3.menu.pnum.GENERIC_U385VGIXQ.build.variant=STM32U3xx/U375V(E-G)IxQ_U385VGIxQ
GenU3.menu.pnum.GENERIC_U385VGIXQ.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32U3xx/STM32U385.svd

# Upload menu
GenU3.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenU3.menu.upload_method.swdMethod.upload.protocol=swd
GenU3.menu.upload_method.swdMethod.upload.options=
GenU3.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

