stm32duino/Arduino_Core_STM32/boards.txt
# Generic U599ZITxQ
GenU5.menu.pnum.GENERIC_U599ZITXQ=Generic U599ZITxQ
GenU5.menu.pnum.GENERIC_U599ZITXQ.upload.maximum_size=2097152
GenU5.menu.pnum.GENERIC_U599ZITXQ.upload.maximum_data_size=2555904
GenU5.menu.pnum.GENERIC_U599ZITXQ.build.board=GENERIC_U599ZITXQ
GenU5.menu.pnum.GENERIC_U599ZITXQ.build.product_line=STM32U599xx
GenU5.menu.pnum.GENERIC_U599ZITXQ.build.variant=STM32U5xx/U595Z(I-J)TxQ_U599Z(I-J)TxQ_U5A5ZJTxQ_U5A9ZJTxQ
GenU5.menu.pnum.GENERIC_U599ZITXQ.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32U5xx/STM32U599.svd

# Generic U599ZJTxQ
GenU5.menu.pnum.GENERIC_U599ZJTXQ=Generic U599ZJTxQ
GenU5.menu.pnum.GENERIC_U599ZJTXQ.upload.maximum_size=4194304
GenU5.menu.pnum.GENERIC_U599ZJTXQ.upload.maximum_data_size=2555904
GenU5.menu.pnum.GENERIC_U599ZJTXQ.build.board=GENERIC_U599ZJTXQ
GenU5.menu.pnum.GENERIC_U599ZJTXQ.build.product_line=STM32U599xx
GenU5.menu.pnum.GENERIC_U599ZJTXQ.build.variant=STM32U5xx/U595Z(I-J)TxQ_U599Z(I-J)TxQ_U5A5ZJTxQ_U5A9ZJTxQ
GenU5.menu.pnum.GENERIC_U599ZJTXQ.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32U5xx/STM32U599.svd

# Generic U5A5ZJTxQ
GenU5.menu.pnum.GENERIC_U5A5ZJTXQ=Generic U5A5ZJTxQ
GenU5.menu.pnum.GENERIC_U5A5ZJTXQ.upload.maximum_size=4194304
GenU5.menu.pnum.GENERIC_U5A5ZJTXQ.upload.maximum_data_size=2555904
GenU5.menu.pnum.GENERIC_U5A5ZJTXQ.build.board=GENERIC_U5A5ZJTXQ
GenU5.menu.pnum.GENERIC_U5A5ZJTXQ.build.product_line=STM32U5A5xx
GenU5.menu.pnum.GENERIC_U5A5ZJTXQ.build.variant=STM32U5xx/U595Z(I-J)TxQ_U599Z(I-J)TxQ_U5A5ZJTxQ_U5A9ZJTxQ
GenU5.menu.pnum.GENERIC_U5A5ZJTXQ.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32U5xx/STM32U5A5.svd

# Generic U5A9ZJTxQ
GenU5.menu.pnum.GENERIC_U5A9ZJTXQ=Generic U5A9ZJTxQ
GenU5.menu.pnum.GENERIC_U5A9ZJTXQ.upload.maximum_size=4194304
GenU5.menu.pnum.GENERIC_U5A9ZJTXQ.upload.maximum_data_size=2555904
GenU5.menu.pnum.GENERIC_U5A9ZJTXQ.build.board=GENERIC_U5A9ZJTXQ
GenU5.menu.pnum.GENERIC_U5A9ZJTXQ.build.product_line=STM32U5A9xx
GenU5.menu.pnum.GENERIC_U5A9ZJTXQ.build.variant=STM32U5xx/U595Z(I-J)TxQ_U599Z(I-J)TxQ_U5A5ZJTxQ_U5A9ZJTxQ
GenU5.menu.pnum.GENERIC_U5A9ZJTXQ.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32U5xx/STM32U5A9.svd

# Upload menu
GenU5.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenU5.menu.upload_method.swdMethod.upload.protocol=swd
GenU5.menu.upload_method.swdMethod.upload.options=
GenU5.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenU5.menu.upload_method.jlinkMethod=STM32CubeProgrammer (J-Link)
GenU5.menu.upload_method.jlinkMethod.upload.protocol=jlink
GenU5.menu.upload_method.jlinkMethod.upload.options=
GenU5.menu.upload_method.jlinkMethod.upload.tool=stm32CubeProg

GenU5.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenU5.menu.upload_method.serialMethod.upload.protocol=serial
GenU5.menu.upload_method.serialMethod.upload.options=-c {serial.port.file}
GenU5.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenU5.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenU5.menu.upload_method.dfuMethod.upload.protocol=dfu
GenU5.menu.upload_method.dfuMethod.upload.options=-v {upload.vid} -p {upload.pid}
GenU5.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

GenU5.menu.upload_method.bmpMethod=BMP (Black Magic Probe)
GenU5.menu.upload_method.bmpMethod.upload.protocol=gdb_bmp
GenU5.menu.upload_method.bmpMethod.upload.tool=bmp_upload

GenU5.menu.upload_method.OpenOCDSTLink=OpenOCD STLink (SWD)
GenU5.menu.upload_method.OpenOCDSTLink.upload.protocol=stlink
GenU5.menu.upload_method.OpenOCDSTLink.upload.tool=openocd_upload

GenU5.menu.upload_method.OpenOCDDapLink=OpenOCD DapLink (SWD)
GenU5.menu.upload_method.OpenOCDDapLink.upload.protocol=cmsis-dap
GenU5.menu.upload_method.OpenOCDDapLink.upload.tool=openocd_upload

################################################################################
# Generic WB
GenWB.name=Generic STM32WB series

GenWB.build.core=arduino
GenWB.build.board=GenWB
GenWB.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
GenWB.build.mcu=cortex-m4
GenWB.build.fpu=-mfpu=fpv4-sp-d16
GenWB.build.float-abi=-mfloat-abi=hard
GenWB.build.series=STM32WBxx
GenWB.build.flash_offset=0x0
GenWB.upload.maximum_size=0
GenWB.upload.maximum_data_size=0
GenWB.openocd.target=stm32wbx
GenWB.vid.0=0x0483
GenWB.pid.0=0x5740

# Generic WB15CCUx
GenWB.menu.pnum.GENERIC_WB15CCUX=Generic WB15CCUx
GenWB.menu.pnum.GENERIC_WB15CCUX.upload.maximum_size=131072
GenWB.menu.pnum.GENERIC_WB15CCUX.upload.maximum_data_size=12288
GenWB.menu.pnum.GENERIC_WB15CCUX.build.board=GENERIC_WB15CCUX
GenWB.menu.pnum.GENERIC_WB15CCUX.build.product_line=STM32WB15xx
GenWB.menu.pnum.GENERIC_WB15CCUX.build.variant=STM32WBxx/WB15CCU
GenWB.menu.pnum.GENERIC_WB15CCUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32WBxx/STM32WB15_CM4.svd

# Generic WB55CCUx
GenWB.menu.pnum.GENERIC_WB55CCUX=Generic WB55CCUx
GenWB.menu.pnum.GENERIC_WB55CCUX.upload.maximum_size=131072
GenWB.menu.pnum.GENERIC_WB55CCUX.upload.maximum_data_size=65536
GenWB.menu.pnum.GENERIC_WB55CCUX.build.board=GENERIC_WB55CCUX
GenWB.menu.pnum.GENERIC_WB55CCUX.build.product_line=STM32WB55xx
GenWB.menu.pnum.GENERIC_WB55CCUX.build.variant=STM32WBxx/WB35C(C-E)UxA_WB55C(C-E-G)U
GenWB.menu.pnum.GENERIC_WB55CCUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32WBxx/STM32WB55_CM4.svd

# Generic WB55CEUx
GenWB.menu.pnum.GENERIC_WB55CEUX=Generic WB55CEUx
GenWB.menu.pnum.GENERIC_WB55CEUX.upload.maximum_size=262144
GenWB.menu.pnum.GENERIC_WB55CEUX.upload.maximum_data_size=196608
GenWB.menu.pnum.GENERIC_WB55CEUX.build.board=GENERIC_WB55CEUX
GenWB.menu.pnum.GENERIC_WB55CEUX.build.product_line=STM32WB55xx
GenWB.menu.pnum.GENERIC_WB55CEUX.build.variant=STM32WBxx/WB35C(C-E)UxA_WB55C(C-E-G)U
GenWB.menu.pnum.GENERIC_WB55CEUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32WBxx/STM32WB55_CM4.svd

# Generic WB55CGUx
GenWB.menu.pnum.GENERIC_WB55CGUX=Generic WB55CGUx
GenWB.menu.pnum.GENERIC_WB55CGUX.upload.maximum_size=524288
GenWB.menu.pnum.GENERIC_WB55CGUX.upload.maximum_data_size=196608
GenWB.menu.pnum.GENERIC_WB55CGUX.build.board=GENERIC_WB55CGUX
GenWB.menu.pnum.GENERIC_WB55CGUX.build.product_line=STM32WB55xx
GenWB.menu.pnum.GENERIC_WB55CGUX.build.variant=STM32WBxx/WB35C(C-E)UxA_WB55C(C-E-G)U
GenWB.menu.pnum.GENERIC_WB55CGUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32WBxx/STM32WB55_CM4.svd

# Generic WB5MMGHx
GenWB.menu.pnum.GENERIC_WB5MMGHX=Generic WB5MMGHx
GenWB.menu.pnum.GENERIC_WB5MMGHX.upload.maximum_size=827392
GenWB.menu.pnum.GENERIC_WB5MMGHX.upload.maximum_data_size=196608
GenWB.menu.pnum.GENERIC_WB5MMGHX.build.board=GENERIC_WB5MMGHX
GenWB.menu.pnum.GENERIC_WB5MMGHX.build.product_line=STM32WB5Mxx
GenWB.menu.pnum.GENERIC_WB5MMGHX.build.variant=STM32WBxx/WB5MMGH
GenWB.menu.pnum.GENERIC_WB5MMGHX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32WBxx/STM32WB55_CM4.svd

# Generic WB55RCVx
GenWB.menu.pnum.GENERIC_WB55RCVX=Generic WB55RCVx
GenWB.menu.pnum.GENERIC_WB55RCVX.upload.maximum_size=131072
GenWB.menu.pnum.GENERIC_WB55RCVX.upload.maximum_data_size=65536
GenWB.menu.pnum.GENERIC_WB55RCVX.build.board=GENERIC_WB55RCVX
GenWB.menu.pnum.GENERIC_WB55RCVX.build.product_line=STM32WB55xx
GenWB.menu.pnum.GENERIC_WB55RCVX.build.variant=STM32WBxx/WB55R(C-E-G)V
GenWB.menu.pnum.GENERIC_WB55RCVX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32WBxx/STM32WB55_CM4.svd

# Generic WB55REVx
GenWB.menu.pnum.GENERIC_WB55REVX=Generic WB55REVx
GenWB.menu.pnum.GENERIC_WB55REVX.upload.maximum_size=262144
GenWB.menu.pnum.GENERIC_WB55REVX.upload.maximum_data_size=196608
GenWB.menu.pnum.GENERIC_WB55REVX.build.board=GENERIC_WB55REVX
GenWB.menu.pnum.GENERIC_WB55REVX.build.product_line=STM32WB55xx
GenWB.menu.pnum.GENERIC_WB55REVX.build.variant=STM32WBxx/WB55R(C-E-G)V
GenWB.menu.pnum.GENERIC_WB55REVX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32WBxx/STM32WB55_CM4.svd

# Generic WB55RGVx
GenWB.menu.pnum.GENERIC_WB55RGVX=Generic WB55RGVx
GenWB.menu.pnum.GENERIC_WB55RGVX.upload.maximum_size=524288
GenWB.menu.pnum.GENERIC_WB55RGVX.upload.maximum_data_size=196608
GenWB.menu.pnum.GENERIC_WB55RGVX.build.board=GENERIC_WB55RGVX
GenWB.menu.pnum.GENERIC_WB55RGVX.build.product_line=STM32WB55xx
GenWB.menu.pnum.GENERIC_WB55RGVX.build.variant=STM32WBxx/WB55R(C-E-G)V
GenWB.menu.pnum.GENERIC_WB55RGVX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32WBxx/STM32WB55_CM4.svd

# Generic WB55VCQx
GenWB.menu.pnum.GENERIC_WB55VCQX=Generic WB55VCQx
GenWB.menu.pnum.GENERIC_WB55VCQX.upload.maximum_size=131072
GenWB.menu.pnum.GENERIC_WB55VCQX.upload.maximum_data_size=65536
GenWB.menu.pnum.GENERIC_WB55VCQX.build.board=GENERIC_WB55VCQX
GenWB.menu.pnum.GENERIC_WB55VCQX.build.product_line=STM32WB55xx
GenWB.menu.pnum.GENERIC_WB55VCQX.build.variant=STM32WBxx/WB55V(C-E-G)(Q-Y)_WB55VYY
GenWB.menu.pnum.GENERIC_WB55VCQX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32WBxx/STM32WB55_CM4.svd

# Generic WB55VCYx
GenWB.menu.pnum.GENERIC_WB55VCYX=Generic WB55VCYx
GenWB.menu.pnum.GENERIC_WB55VCYX.upload.maximum_size=131072
GenWB.menu.pnum.GENERIC_WB55VCYX.upload.maximum_data_size=65536
GenWB.menu.pnum.GENERIC_WB55VCYX.build.board=GENERIC_WB55VCYX
GenWB.menu.pnum.GENERIC_WB55VCYX.build.product_line=STM32WB55xx
GenWB.menu.pnum.GENERIC_WB55VCYX.build.variant=STM32WBxx/WB55V(C-E-G)(Q-Y)_WB55VYY
GenWB.menu.pnum.GENERIC_WB55VCYX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32WBxx/STM32WB55_CM4.svd

# Generic WB55VEQx
GenWB.menu.pnum.GENERIC_WB55VEQX=Generic WB55VEQx
GenWB.menu.pnum.GENERIC_WB55VEQX.upload.maximum_size=262144
GenWB.menu.pnum.GENERIC_WB55VEQX.upload.maximum_data_size=131072
GenWB.menu.pnum.GENERIC_WB55VEQX.build.board=GENERIC_WB55VEQX
GenWB.menu.pnum.GENERIC_WB55VEQX.build.product_line=STM32WB55xx
GenWB.menu.pnum.GENERIC_WB55VEQX.build.variant=STM32WBxx/WB55V(C-E-G)(Q-Y)_WB55VYY
GenWB.menu.pnum.GENERIC_WB55VEQX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32WBxx/STM32WB55_CM4.svd

# Generic WB55VEYx
GenWB.menu.pnum.GENERIC_WB55VEYX=Generic WB55VEYx
GenWB.menu.pnum.GENERIC_WB55VEYX.upload.maximum_size=262144
GenWB.menu.pnum.GENERIC_WB55VEYX.upload.maximum_data_size=196608
GenWB.menu.pnum.GENERIC_WB55VEYX.build.board=GENERIC_WB55VEYX
GenWB.menu.pnum.GENERIC_WB55VEYX.build.product_line=STM32WB55xx
GenWB.menu.pnum.GENERIC_WB55VEYX.build.variant=STM32WBxx/WB55V(C-E-G)(Q-Y)_WB55VYY
GenWB.menu.pnum.GENERIC_WB55VEYX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32WBxx/STM32WB55_CM4.svd

# Generic WB55VGQx
GenWB.menu.pnum.GENERIC_WB55VGQX=Generic WB55VGQx
GenWB.menu.pnum.GENERIC_WB55VGQX.upload.maximum_size=524288
GenWB.menu.pnum.GENERIC_WB55VGQX.upload.maximum_data_size=131072
GenWB.menu.pnum.GENERIC_WB55VGQX.build.board=GENERIC_WB55VGQX
GenWB.menu.pnum.GENERIC_WB55VGQX.build.product_line=STM32WB55xx
GenWB.menu.pnum.GENERIC_WB55VGQX.build.variant=STM32WBxx/WB55V(C-E-G)(Q-Y)_WB55VYY
GenWB.menu.pnum.GENERIC_WB55VGQX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32WBxx/STM32WB55_CM4.svd

# Generic WB55VGYx
GenWB.menu.pnum.GENERIC_WB55VGYX=Generic WB55VGYx
GenWB.menu.pnum.GENERIC_WB55VGYX.upload.maximum_size=524288
GenWB.menu.pnum.GENERIC_WB55VGYX.upload.maximum_data_size=196608
GenWB.menu.pnum.GENERIC_WB55VGYX.build.board=GENERIC_WB55VGYX
GenWB.menu.pnum.GENERIC_WB55VGYX.build.product_line=STM32WB55xx
GenWB.menu.pnum.GENERIC_WB55VGYX.build.variant=STM32WBxx/WB55V(C-E-G)(Q-Y)_WB55VYY
GenWB.menu.pnum.GENERIC_WB55VGYX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32WBxx/STM32WB55_CM4.svd

# Generic WB55VYYx
GenWB.menu.pnum.GENERIC_WB55VYYX=Generic WB55VYYx
GenWB.menu.pnum.GENERIC_WB55VYYX.upload.maximum_size=327680
GenWB.menu.pnum.GENERIC_WB55VYYX.upload.maximum_data_size=196608
GenWB.menu.pnum.GENERIC_WB55VYYX.build.board=GENERIC_WB55VYYX
GenWB.menu.pnum.GENERIC_WB55VYYX.build.product_line=STM32WB55xx
GenWB.menu.pnum.GENERIC_WB55VYYX.build.variant=STM32WBxx/WB55V(C-E-G)(Q-Y)_WB55VYY
GenWB.menu.pnum.GENERIC_WB55VYYX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32WBxx/STM32WB55_CM4.svd


# Upload menu
GenWB.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenWB.menu.upload_method.swdMethod.upload.protocol=swd
GenWB.menu.upload_method.swdMethod.upload.options=
GenWB.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

