stm32duino/Arduino_Core_STM32/boards.txt
GenWB.menu.upload_method.jlinkMethod=STM32CubeProgrammer (J-Link)
GenWB.menu.upload_method.jlinkMethod.upload.protocol=jlink
GenWB.menu.upload_method.jlinkMethod.upload.options=
GenWB.menu.upload_method.jlinkMethod.upload.tool=stm32CubeProg

GenWB.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenWB.menu.upload_method.serialMethod.upload.protocol=serial
GenWB.menu.upload_method.serialMethod.upload.options=-c {serial.port.file}
GenWB.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenWB.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenWB.menu.upload_method.dfuMethod.upload.protocol=dfu
GenWB.menu.upload_method.dfuMethod.upload.options=-v {upload.vid} -p {upload.pid}
GenWB.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

GenWB.menu.upload_method.bmpMethod=BMP (Black Magic Probe)
GenWB.menu.upload_method.bmpMethod.upload.protocol=gdb_bmp
GenWB.menu.upload_method.bmpMethod.upload.tool=bmp_upload

GenWB.menu.upload_method.OpenOCDSTLink=OpenOCD STLink (SWD)
GenWB.menu.upload_method.OpenOCDSTLink.upload.protocol=stlink
GenWB.menu.upload_method.OpenOCDSTLink.upload.tool=openocd_upload

GenWB.menu.upload_method.OpenOCDDapLink=OpenOCD DapLink (SWD)
GenWB.menu.upload_method.OpenOCDDapLink.upload.protocol=cmsis-dap
GenWB.menu.upload_method.OpenOCDDapLink.upload.tool=openocd_upload

################################################################################
# Generic WB0
GenWB0.name=Generic STM32WB0 series

GenWB0.build.core=arduino
GenWB0.build.board=GenWB0
GenWB0.build.st_extra_flags=-D{build.product_line} {build.xSerial} -D__CORTEX_SC=0
GenWB0.build.mcu=cortex-m0plus
GenWB0.build.series=STM32WB0x
GenWB0.build.flash_offset=0x0
GenWB0.upload.maximum_size=0
GenWB0.upload.maximum_data_size=0
GenWB0.openocd.target=stm32wb0x
GenWB0.upload.address=0x10040000
GenWB0.upload.mode=hwRstPulse
GenWB0.upload.start=0x10000000

# Generic WB05KZVx
GenWB0.menu.pnum.GENERIC_WB05KZVX=Generic WB05KZVx
GenWB0.menu.pnum.GENERIC_WB05KZVX.upload.maximum_size=196608
GenWB0.menu.pnum.GENERIC_WB05KZVX.upload.maximum_data_size=24576
GenWB0.menu.pnum.GENERIC_WB05KZVX.build.board=GENERIC_WB05KZVX
GenWB0.menu.pnum.GENERIC_WB05KZVX.build.product_line=STM32WB05
GenWB0.menu.pnum.GENERIC_WB05KZVX.build.variant=STM32WB0x/WB05KZV_WB05TZF_WB09KEV_WB09TEF
GenWB0.menu.pnum.GENERIC_WB05KZVX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32WB0x/STM32WB05.svd

# Generic WB05TZFx
GenWB0.menu.pnum.GENERIC_WB05TZFX=Generic WB05TZFx
GenWB0.menu.pnum.GENERIC_WB05TZFX.upload.maximum_size=196608
GenWB0.menu.pnum.GENERIC_WB05TZFX.upload.maximum_data_size=24576
GenWB0.menu.pnum.GENERIC_WB05TZFX.build.board=GENERIC_WB05TZFX
GenWB0.menu.pnum.GENERIC_WB05TZFX.build.product_line=STM32WB05
GenWB0.menu.pnum.GENERIC_WB05TZFX.build.variant=STM32WB0x/WB05KZV_WB05TZF_WB09KEV_WB09TEF
GenWB0.menu.pnum.GENERIC_WB05TZFX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32WB0x/STM32WB05.svd

# Generic WB09KEVx
GenWB0.menu.pnum.GENERIC_WB09KEVX=Generic WB09KEVx
GenWB0.menu.pnum.GENERIC_WB09KEVX.upload.maximum_size=524288
GenWB0.menu.pnum.GENERIC_WB09KEVX.upload.maximum_data_size=65536
GenWB0.menu.pnum.GENERIC_WB09KEVX.build.board=GENERIC_WB09KEVX
GenWB0.menu.pnum.GENERIC_WB09KEVX.build.product_line=STM32WB09
GenWB0.menu.pnum.GENERIC_WB09KEVX.build.variant=STM32WB0x/WB05KZV_WB05TZF_WB09KEV_WB09TEF
GenWB0.menu.pnum.GENERIC_WB09KEVX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32WB0x/STM32WB09.svd

# Generic WB09TEFx
GenWB0.menu.pnum.GENERIC_WB09TEFX=Generic WB09TEFx
GenWB0.menu.pnum.GENERIC_WB09TEFX.upload.maximum_size=524288
GenWB0.menu.pnum.GENERIC_WB09TEFX.upload.maximum_data_size=65536
GenWB0.menu.pnum.GENERIC_WB09TEFX.build.board=GENERIC_WB09TEFX
GenWB0.menu.pnum.GENERIC_WB09TEFX.build.product_line=STM32WB09
GenWB0.menu.pnum.GENERIC_WB09TEFX.build.variant=STM32WB0x/WB05KZV_WB05TZF_WB09KEV_WB09TEF
GenWB0.menu.pnum.GENERIC_WB09TEFX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32WB0x/STM32WB09.svd

# Upload menu
GenWB0.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenWB0.menu.upload_method.swdMethod.upload.protocol=swd
GenWB0.menu.upload_method.swdMethod.upload.options=-a {upload.address} -m {upload.mode} -s {upload.start}
GenWB0.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenWB0.menu.upload_method.jlinkMethod=STM32CubeProgrammer (J-Link)
GenWB0.menu.upload_method.jlinkMethod.upload.protocol=jlink
GenWB0.menu.upload_method.jlinkMethod.upload.options=
GenWB0.menu.upload_method.jlinkMethod.upload.tool=stm32CubeProg

GenWB0.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenWB0.menu.upload_method.serialMethod.upload.protocol=serial
GenWB0.menu.upload_method.serialMethod.upload.options=-c {serial.port.file}
GenWB0.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenWB0.menu.upload_method.OpenOCDSTLink=OpenOCD STLink (SWD)
GenWB0.menu.upload_method.OpenOCDSTLink.upload.protocol=stlink
GenWB0.menu.upload_method.OpenOCDSTLink.upload.tool=openocd_upload

GenWB0.menu.upload_method.OpenOCDDapLink=OpenOCD DapLink (SWD)
GenWB0.menu.upload_method.OpenOCDDapLink.upload.protocol=cmsis-dap
GenWB0.menu.upload_method.OpenOCDDapLink.upload.tool=openocd_upload

################################################################################
# Generic WBA
GenWBA.name=Generic STM32WBA series

GenWBA.build.core=arduino
GenWBA.build.board=GenWBA
GenWBA.build.st_extra_flags=-D{build.product_line} {build.xSerial}
GenWBA.build.mcu=cortex-m33
GenWBA.build.fpu=-mfpu=fpv4-sp-d16
GenWBA.build.float-abi=-mfloat-abi=hard
GenWBA.build.series=STM32WBAxx
GenWBA.build.flash_offset=0x0
GenWBA.upload.maximum_size=0
GenWBA.upload.maximum_data_size=0
GenWBA.openocd.target=stm32wbax

# Generic WBA55CEUx
GenWBA.menu.pnum.GENERIC_WBA55CEUX=Generic WBA55CEUx
GenWBA.menu.pnum.GENERIC_WBA55CEUX.upload.maximum_size=524288
GenWBA.menu.pnum.GENERIC_WBA55CEUX.upload.maximum_data_size=98304
GenWBA.menu.pnum.GENERIC_WBA55CEUX.build.board=GENERIC_WBA55CEUX
GenWBA.menu.pnum.GENERIC_WBA55CEUX.build.product_line=STM32WBA55xx
GenWBA.menu.pnum.GENERIC_WBA55CEUX.build.variant=STM32WBAxx/WBA55C(E-G)U
GenWBA.menu.pnum.GENERIC_WBA55CEUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32WBAxx/STM32WBA55.svd

# Generic WBA55CGUx
GenWBA.menu.pnum.GENERIC_WBA55CGUX=Generic WBA55CGUx
GenWBA.menu.pnum.GENERIC_WBA55CGUX.upload.maximum_size=1048576
GenWBA.menu.pnum.GENERIC_WBA55CGUX.upload.maximum_data_size=131072
GenWBA.menu.pnum.GENERIC_WBA55CGUX.build.board=GENERIC_WBA55CGUX
GenWBA.menu.pnum.GENERIC_WBA55CGUX.build.product_line=STM32WBA55xx
GenWBA.menu.pnum.GENERIC_WBA55CGUX.build.variant=STM32WBAxx/WBA55C(E-G)U
GenWBA.menu.pnum.GENERIC_WBA55CGUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32WBAxx/STM32WBA55.svd

# Upload menu
GenWBA.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenWBA.menu.upload_method.swdMethod.upload.protocol=swd
GenWBA.menu.upload_method.swdMethod.upload.options=
GenWBA.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenWBA.menu.upload_method.jlinkMethod=STM32CubeProgrammer (J-Link)
GenWBA.menu.upload_method.jlinkMethod.upload.protocol=jlink
GenWBA.menu.upload_method.jlinkMethod.upload.options=
GenWBA.menu.upload_method.jlinkMethod.upload.tool=stm32CubeProg

GenWBA.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenWBA.menu.upload_method.serialMethod.upload.protocol=serial
GenWBA.menu.upload_method.serialMethod.upload.options=-c {serial.port.file}
GenWBA.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenWBA.menu.upload_method.OpenOCDSTLink=OpenOCD STLink (SWD)
GenWBA.menu.upload_method.OpenOCDSTLink.upload.protocol=stlink
GenWBA.menu.upload_method.OpenOCDSTLink.upload.tool=openocd_upload

GenWBA.menu.upload_method.OpenOCDDapLink=OpenOCD DapLink (SWD)
GenWBA.menu.upload_method.OpenOCDDapLink.upload.protocol=cmsis-dap
GenWBA.menu.upload_method.OpenOCDDapLink.upload.tool=openocd_upload

################################################################################
# Generic WL
GenWL.name=Generic STM32WL series

GenWL.build.core=arduino
GenWL.build.board=GenWL
GenWL.build.st_extra_flags=-D{build.product_line} -DUSE_CM4_STARTUP_FILE {build.xSerial}
GenWL.build.mcu=cortex-m4
#GenWL.build.fpu=-mfpu=fpv4-sp-d16
#GenWL.build.float-abi=-mfloat-abi=hard
GenWL.build.series=STM32WLxx
GenWL.build.flash_offset=0x0
GenWL.upload.maximum_size=0
GenWL.upload.maximum_data_size=0
GenWL.openocd.target=stm32wlx

# Generic WL54CCUx
GenWL.menu.pnum.GENERIC_WL54CCUX=Generic WL54CCUx
GenWL.menu.pnum.GENERIC_WL54CCUX.upload.maximum_size=262144
GenWL.menu.pnum.GENERIC_WL54CCUX.upload.maximum_data_size=65536
GenWL.menu.pnum.GENERIC_WL54CCUX.build.board=GENERIC_WL54CCUX
GenWL.menu.pnum.GENERIC_WL54CCUX.build.product_line=STM32WL54xx
GenWL.menu.pnum.GENERIC_WL54CCUX.build.variant=STM32WLxx/WL54CCU_WL55CCU_WLE4C(8-B-C)U_WLE5C(8-B-C)U
GenWL.menu.pnum.GENERIC_WL54CCUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32WLxx/STM32WL5x_CM4.svd

