stm32duino/Arduino_Core_STM32/boards.txt
# Generic WL54JCIx
GenWL.menu.pnum.GENERIC_WL54JCIX=Generic WL54JCIx
GenWL.menu.pnum.GENERIC_WL54JCIX.upload.maximum_size=262144
GenWL.menu.pnum.GENERIC_WL54JCIX.upload.maximum_data_size=65536
GenWL.menu.pnum.GENERIC_WL54JCIX.build.board=GENERIC_WL54JCIX
GenWL.menu.pnum.GENERIC_WL54JCIX.build.product_line=STM32WL54xx
GenWL.menu.pnum.GENERIC_WL54JCIX.build.variant=STM32WLxx/WL54JCI_WL55JCI_WLE4J(8-B-C)I_WLE5J(8-B-C)I
GenWL.menu.pnum.GENERIC_WL54JCIX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32WLxx/STM32WL5x_CM4.svd

# Generic WL55CCUx
GenWL.menu.pnum.GENERIC_WL55CCUX=Generic WL55CCUx
GenWL.menu.pnum.GENERIC_WL55CCUX.upload.maximum_size=262144
GenWL.menu.pnum.GENERIC_WL55CCUX.upload.maximum_data_size=65536
GenWL.menu.pnum.GENERIC_WL55CCUX.build.board=GENERIC_WL55CCUX
GenWL.menu.pnum.GENERIC_WL55CCUX.build.product_line=STM32WL55xx
GenWL.menu.pnum.GENERIC_WL55CCUX.build.variant=STM32WLxx/WL54CCU_WL55CCU_WLE4C(8-B-C)U_WLE5C(8-B-C)U
GenWL.menu.pnum.GENERIC_WL55CCUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32WLxx/STM32WL5x_CM4.svd

# Generic WL55JCIx
GenWL.menu.pnum.GENERIC_WL55JCIX=Generic WL55JCIx
GenWL.menu.pnum.GENERIC_WL55JCIX.upload.maximum_size=262144
GenWL.menu.pnum.GENERIC_WL55JCIX.upload.maximum_data_size=65536
GenWL.menu.pnum.GENERIC_WL55JCIX.build.board=GENERIC_WL55JCIX
GenWL.menu.pnum.GENERIC_WL55JCIX.build.product_line=STM32WL55xx
GenWL.menu.pnum.GENERIC_WL55JCIX.build.variant=STM32WLxx/WL54JCI_WL55JCI_WLE4J(8-B-C)I_WLE5J(8-B-C)I
GenWL.menu.pnum.GENERIC_WL55JCIX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32WLxx/STM32WL5x_CM4.svd

# Generic WLE4C8Ux
GenWL.menu.pnum.GENERIC_WLE4C8UX=Generic WLE4C8Ux
GenWL.menu.pnum.GENERIC_WLE4C8UX.upload.maximum_size=65536
GenWL.menu.pnum.GENERIC_WLE4C8UX.upload.maximum_data_size=20480
GenWL.menu.pnum.GENERIC_WLE4C8UX.build.board=GENERIC_WLE4C8UX
GenWL.menu.pnum.GENERIC_WLE4C8UX.build.product_line=STM32WLE4xx
GenWL.menu.pnum.GENERIC_WLE4C8UX.build.variant=STM32WLxx/WL54CCU_WL55CCU_WLE4C(8-B-C)U_WLE5C(8-B-C)U
GenWL.menu.pnum.GENERIC_WLE4C8UX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32WLxx/STM32WLE5_CM4.svd

# Generic WLE4CBUx
GenWL.menu.pnum.GENERIC_WLE4CBUX=Generic WLE4CBUx
GenWL.menu.pnum.GENERIC_WLE4CBUX.upload.maximum_size=131072
GenWL.menu.pnum.GENERIC_WLE4CBUX.upload.maximum_data_size=49152
GenWL.menu.pnum.GENERIC_WLE4CBUX.build.board=GENERIC_WLE4CBUX
GenWL.menu.pnum.GENERIC_WLE4CBUX.build.product_line=STM32WLE4xx
GenWL.menu.pnum.GENERIC_WLE4CBUX.build.variant=STM32WLxx/WL54CCU_WL55CCU_WLE4C(8-B-C)U_WLE5C(8-B-C)U
GenWL.menu.pnum.GENERIC_WLE4CBUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32WLxx/STM32WLE5_CM4.svd

# Generic WLE4CCUx
GenWL.menu.pnum.GENERIC_WLE4CCUX=Generic WLE4CCUx
GenWL.menu.pnum.GENERIC_WLE4CCUX.upload.maximum_size=262144
GenWL.menu.pnum.GENERIC_WLE4CCUX.upload.maximum_data_size=65536
GenWL.menu.pnum.GENERIC_WLE4CCUX.build.board=GENERIC_WLE4CCUX
GenWL.menu.pnum.GENERIC_WLE4CCUX.build.product_line=STM32WLE4xx
GenWL.menu.pnum.GENERIC_WLE4CCUX.build.variant=STM32WLxx/WL54CCU_WL55CCU_WLE4C(8-B-C)U_WLE5C(8-B-C)U
GenWL.menu.pnum.GENERIC_WLE4CCUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32WLxx/STM32WLE5_CM4.svd

# Generic WLE4J8Ix
GenWL.menu.pnum.GENERIC_WLE4J8IX=Generic WLE4J8Ix
GenWL.menu.pnum.GENERIC_WLE4J8IX.upload.maximum_size=65536
GenWL.menu.pnum.GENERIC_WLE4J8IX.upload.maximum_data_size=20480
GenWL.menu.pnum.GENERIC_WLE4J8IX.build.board=GENERIC_WLE4J8IX
GenWL.menu.pnum.GENERIC_WLE4J8IX.build.product_line=STM32WLE4xx
GenWL.menu.pnum.GENERIC_WLE4J8IX.build.variant=STM32WLxx/WL54JCI_WL55JCI_WLE4J(8-B-C)I_WLE5J(8-B-C)I
GenWL.menu.pnum.GENERIC_WLE4J8IX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32WLxx/STM32WLE5_CM4.svd

# Generic WLE4JBIx
GenWL.menu.pnum.GENERIC_WLE4JBIX=Generic WLE4JBIx
GenWL.menu.pnum.GENERIC_WLE4JBIX.upload.maximum_size=131072
GenWL.menu.pnum.GENERIC_WLE4JBIX.upload.maximum_data_size=49152
GenWL.menu.pnum.GENERIC_WLE4JBIX.build.board=GENERIC_WLE4JBIX
GenWL.menu.pnum.GENERIC_WLE4JBIX.build.product_line=STM32WLE4xx
GenWL.menu.pnum.GENERIC_WLE4JBIX.build.variant=STM32WLxx/WL54JCI_WL55JCI_WLE4J(8-B-C)I_WLE5J(8-B-C)I
GenWL.menu.pnum.GENERIC_WLE4JBIX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32WLxx/STM32WLE5_CM4.svd

# Generic WLE4JCIx
GenWL.menu.pnum.GENERIC_WLE4JCIX=Generic WLE4JCIx
GenWL.menu.pnum.GENERIC_WLE4JCIX.upload.maximum_size=262144
GenWL.menu.pnum.GENERIC_WLE4JCIX.upload.maximum_data_size=65536
GenWL.menu.pnum.GENERIC_WLE4JCIX.build.board=GENERIC_WLE4JCIX
GenWL.menu.pnum.GENERIC_WLE4JCIX.build.product_line=STM32WLE4xx
GenWL.menu.pnum.GENERIC_WLE4JCIX.build.variant=STM32WLxx/WL54JCI_WL55JCI_WLE4J(8-B-C)I_WLE5J(8-B-C)I
GenWL.menu.pnum.GENERIC_WLE4JCIX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32WLxx/STM32WLE5_CM4.svd

# Generic WLE5C8Ux
GenWL.menu.pnum.GENERIC_WLE5C8UX=Generic WLE5C8Ux
GenWL.menu.pnum.GENERIC_WLE5C8UX.upload.maximum_size=65536
GenWL.menu.pnum.GENERIC_WLE5C8UX.upload.maximum_data_size=20480
GenWL.menu.pnum.GENERIC_WLE5C8UX.build.board=GENERIC_WLE5C8UX
GenWL.menu.pnum.GENERIC_WLE5C8UX.build.product_line=STM32WLE5xx
GenWL.menu.pnum.GENERIC_WLE5C8UX.build.variant=STM32WLxx/WL54CCU_WL55CCU_WLE4C(8-B-C)U_WLE5C(8-B-C)U
GenWL.menu.pnum.GENERIC_WLE5C8UX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32WLxx/STM32WLE5_CM4.svd

# Generic WLE5CBUx
GenWL.menu.pnum.GENERIC_WLE5CBUX=Generic WLE5CBUx
GenWL.menu.pnum.GENERIC_WLE5CBUX.upload.maximum_size=131072
GenWL.menu.pnum.GENERIC_WLE5CBUX.upload.maximum_data_size=49152
GenWL.menu.pnum.GENERIC_WLE5CBUX.build.board=GENERIC_WLE5CBUX
GenWL.menu.pnum.GENERIC_WLE5CBUX.build.product_line=STM32WLE5xx
GenWL.menu.pnum.GENERIC_WLE5CBUX.build.variant=STM32WLxx/WL54CCU_WL55CCU_WLE4C(8-B-C)U_WLE5C(8-B-C)U
GenWL.menu.pnum.GENERIC_WLE5CBUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32WLxx/STM32WLE5_CM4.svd

# Generic WLE5CCUx
GenWL.menu.pnum.GENERIC_WLE5CCUX=Generic WLE5CCUx
GenWL.menu.pnum.GENERIC_WLE5CCUX.upload.maximum_size=262144
GenWL.menu.pnum.GENERIC_WLE5CCUX.upload.maximum_data_size=65536
GenWL.menu.pnum.GENERIC_WLE5CCUX.build.board=GENERIC_WLE5CCUX
GenWL.menu.pnum.GENERIC_WLE5CCUX.build.product_line=STM32WLE5xx
GenWL.menu.pnum.GENERIC_WLE5CCUX.build.variant=STM32WLxx/WL54CCU_WL55CCU_WLE4C(8-B-C)U_WLE5C(8-B-C)U
GenWL.menu.pnum.GENERIC_WLE5CCUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32WLxx/STM32WLE5_CM4.svd

