stm32duino/Arduino_Core_STM32/boards.txt
# IoT continuum Dev Kit Board
IotContinuum.menu.pnum.DEVKIT_IOT_CONTINUUM=IoT continuum Dev Kit
IotContinuum.menu.pnum.DEVKIT_IOT_CONTINUUM.upload.maximum_size=2097152
IotContinuum.menu.pnum.DEVKIT_IOT_CONTINUUM.upload.maximum_data_size=786432
IotContinuum.menu.pnum.DEVKIT_IOT_CONTINUUM.build.mcu=cortex-m33
IotContinuum.menu.pnum.DEVKIT_IOT_CONTINUUM.build.fpu=-mfpu=fpv4-sp-d16
IotContinuum.menu.pnum.DEVKIT_IOT_CONTINUUM.build.float-abi=-mfloat-abi=hard
IotContinuum.menu.pnum.DEVKIT_IOT_CONTINUUM.build.board=DEVKIT_IOT_CONTINUUM
IotContinuum.menu.pnum.DEVKIT_IOT_CONTINUUM.build.series=STM32U5xx
IotContinuum.menu.pnum.DEVKIT_IOT_CONTINUUM.build.product_line=STM32U585xx
IotContinuum.menu.pnum.DEVKIT_IOT_CONTINUUM.build.variant=STM32U5xx/U575C(G-I)(T-U)_U585CI(T-U)
IotContinuum.menu.pnum.DEVKIT_IOT_CONTINUUM.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
IotContinuum.menu.pnum.DEVKIT_IOT_CONTINUUM.openocd.target=stm32u5x
IotContinuum.menu.pnum.DEVKIT_IOT_CONTINUUM.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32U5xx/STM32U585.svd

# Upload menu
IotContinuum.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
IotContinuum.menu.upload_method.swdMethod.upload.protocol=swd
IotContinuum.menu.upload_method.swdMethod.upload.options=
IotContinuum.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

IotContinuum.menu.upload_method.jlinkMethod=STM32CubeProgrammer (J-Link)
IotContinuum.menu.upload_method.jlinkMethod.upload.protocol=jlink
IotContinuum.menu.upload_method.jlinkMethod.upload.options=
IotContinuum.menu.upload_method.jlinkMethod.upload.tool=stm32CubeProg

IotContinuum.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
IotContinuum.menu.upload_method.serialMethod.upload.protocol=serial
IotContinuum.menu.upload_method.serialMethod.upload.options=-c {serial.port.file}
IotContinuum.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

IotContinuum.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
IotContinuum.menu.upload_method.dfuMethod.upload.protocol=dfu
IotContinuum.menu.upload_method.dfuMethod.upload.options=-v {upload.vid} -p {upload.pid}
IotContinuum.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

IotContinuum.menu.upload_method.bmpMethod=BMP (Black Magic Probe)
IotContinuum.menu.upload_method.bmpMethod.upload.protocol=gdb_bmp
IotContinuum.menu.upload_method.bmpMethod.upload.tool=bmp_upload

IotContinuum.menu.upload_method.OpenOCDSTLink=OpenOCD STLink (SWD)
IotContinuum.menu.upload_method.OpenOCDSTLink.upload.protocol=stlink
IotContinuum.menu.upload_method.OpenOCDSTLink.upload.tool=openocd_upload

IotContinuum.menu.upload_method.OpenOCDDapLink=OpenOCD DapLink (SWD)
IotContinuum.menu.upload_method.OpenOCDDapLink.upload.protocol=cmsis-dap
IotContinuum.menu.upload_method.OpenOCDDapLink.upload.tool=openocd_upload

################################################################################
# LoRa boards

LoRa.name=LoRa boards
LoRa.build.core=arduino
LoRa.build.board=LoRa
LoRa.build.variant_h=variant_{build.board}.h
LoRa.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
LoRa.build.flash_offset=0x0
LoRa.upload.maximum_size=0
LoRa.upload.maximum_data_size=0
LoRa.vid.0=0x0483
LoRa.pid.0=0x5740

# ACSIP S76S board
LoRa.menu.pnum.ACSIP_S76S=ACSIP S76S
LoRa.menu.pnum.ACSIP_S76S.upload.maximum_size=196608
LoRa.menu.pnum.ACSIP_S76S.upload.maximum_data_size=20480
LoRa.menu.pnum.ACSIP_S76S.build.mcu=cortex-m0plus
LoRa.menu.pnum.ACSIP_S76S.build.board=ACSIP_S76S
LoRa.menu.pnum.ACSIP_S76S.build.series=STM32L0xx
LoRa.menu.pnum.ACSIP_S76S.build.product_line=STM32L073xx
LoRa.menu.pnum.ACSIP_S76S.build.variant=STM32L0xx/L072R(B-Z)T_L073R(B-Z)T_L083R(B-Z)T
LoRa.menu.pnum.ACSIP_S76S.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
LoRa.menu.pnum.ACSIP_S76S.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} -D__CORTEX_SC=0
LoRa.menu.pnum.ACSIP_S76S.openocd.target=stm32l0
LoRa.menu.pnum.ACSIP_S76S.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L0x3.svd

# Generic node SE by The Things Industries
LoRa.menu.pnum.GENERIC_NODE_SE_TTI=Generic Node SE (TTI)
LoRa.menu.pnum.GENERIC_NODE_SE_TTI.upload.maximum_size=262144
LoRa.menu.pnum.GENERIC_NODE_SE_TTI.upload.maximum_data_size=65536
LoRa.menu.pnum.GENERIC_NODE_SE_TTI.build.mcu=cortex-m4
LoRa.menu.pnum.GENERIC_NODE_SE_TTI.build.board=GENERIC_NODE_SE_TTI
LoRa.menu.pnum.GENERIC_NODE_SE_TTI.build.series=STM32WLxx
LoRa.menu.pnum.GENERIC_NODE_SE_TTI.build.product_line=STM32WL55xx
LoRa.menu.pnum.GENERIC_NODE_SE_TTI.build.variant=STM32WLxx/WL54CCU_WL55CCU_WLE4C(8-B-C)U_WLE5C(8-B-C)U
LoRa.menu.pnum.GENERIC_NODE_SE_TTI.build.variant_h=variant_GENERIC_NODE_SE_TTI.h
LoRa.menu.pnum.GENERIC_NODE_SE_TTI.build.st_extra_flags=-D{build.product_line} -DUSE_CM4_STARTUP_FILE {build.xSerial}
LoRa.menu.pnum.GENERIC_NODE_SE_TTI.openocd.target=stm32wlx
LoRa.menu.pnum.GENERIC_NODE_SE_TTI.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32WLxx/STM32WL5x_CM4.svd

# LORA_E5_MINI board
LoRa.menu.pnum.LORA_E5_MINI=LoRa-E5 mini
LoRa.menu.pnum.LORA_E5_MINI.upload.maximum_size=262144
LoRa.menu.pnum.LORA_E5_MINI.upload.maximum_data_size=65536
LoRa.menu.pnum.LORA_E5_MINI.build.mcu=cortex-m4
LoRa.menu.pnum.LORA_E5_MINI.build.board=LORA_E5_MINI
LoRa.menu.pnum.LORA_E5_MINI.build.series=STM32WLxx
LoRa.menu.pnum.LORA_E5_MINI.build.product_line=STM32WLE5xx
LoRa.menu.pnum.LORA_E5_MINI.build.variant=STM32WLxx/WL54JCI_WL55JCI_WLE4J(8-B-C)I_WLE5J(8-B-C)I
LoRa.menu.pnum.LORA_E5_MINI.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
LoRa.menu.pnum.LORA_E5_MINI.build.variant_h=variant_LORA_E5_MINI.h
LoRa.menu.pnum.LORA_E5_MINI.openocd.target=stm32wlx
LoRa.menu.pnum.LORA_E5_MINI.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32WLxx/STM32WLE5_CM4.svd

# RAK3172 module
LoRa.menu.pnum.RAK3172_MODULE=RAK3172 Module
LoRa.menu.pnum.RAK3172_MODULE.upload.maximum_size=262144
LoRa.menu.pnum.RAK3172_MODULE.upload.maximum_data_size=65536
LoRa.menu.pnum.RAK3172_MODULE.build.mcu=cortex-m4
LoRa.menu.pnum.RAK3172_MODULE.build.board=RAK3172_MODULE
LoRa.menu.pnum.RAK3172_MODULE.build.series=STM32WLxx
LoRa.menu.pnum.RAK3172_MODULE.build.product_line=STM32WLE5xx
LoRa.menu.pnum.RAK3172_MODULE.build.variant=STM32WLxx/WL54CCU_WL55CCU_WLE4C(8-B-C)U_WLE5C(8-B-C)U
LoRa.menu.pnum.RAK3172_MODULE.build.variant_h=variant_RAK3172_MODULE.h
LoRa.menu.pnum.RAK3172_MODULE.openocd.target=stm32wlx
LoRa.menu.pnum.RAK3172_MODULE.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32WLxx/STM32WLE5_CM4.svd

