stm32duino/Arduino_Core_STM32/boards.txt
# RAK3172T module
LoRa.menu.pnum.RAK3172T_MODULE=RAK3172T Module
LoRa.menu.pnum.RAK3172T_MODULE.upload.maximum_size=262144
LoRa.menu.pnum.RAK3172T_MODULE.upload.maximum_data_size=65536
LoRa.menu.pnum.RAK3172T_MODULE.build.mcu=cortex-m4
LoRa.menu.pnum.RAK3172T_MODULE.build.board=RAK3172T_MODULE
LoRa.menu.pnum.RAK3172T_MODULE.build.series=STM32WLxx
LoRa.menu.pnum.RAK3172T_MODULE.build.product_line=STM32WLE5xx
LoRa.menu.pnum.RAK3172T_MODULE.build.variant=STM32WLxx/WL54CCU_WL55CCU_WLE4C(8-B-C)U_WLE5C(8-B-C)U
LoRa.menu.pnum.RAK3172T_MODULE.build.variant_h=variant_RAK3172_MODULE.h
LoRa.menu.pnum.RAK3172T_MODULE.openocd.target=stm32wlx
LoRa.menu.pnum.RAK3172T_MODULE.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32WLxx/STM32WLE5_CM4.svd

# RAK811_TRACKER board
LoRa.menu.pnum.RAK811_TRACKER=RAK811 LoRa Tracker (16kb RAM)
LoRa.menu.pnum.RAK811_TRACKER.upload.maximum_size=131072
LoRa.menu.pnum.RAK811_TRACKER.upload.maximum_data_size=16384
LoRa.menu.pnum.RAK811_TRACKER.build.mcu=cortex-m3
LoRa.menu.pnum.RAK811_TRACKER.build.board=RAK811_TRACKER
LoRa.menu.pnum.RAK811_TRACKER.build.series=STM32L1xx
LoRa.menu.pnum.RAK811_TRACKER.build.product_line=STM32L151xB
LoRa.menu.pnum.RAK811_TRACKER.build.variant=STM32L1xx/L100C6Ux(A)_L151C(6-8-B)(T-U)x(A)_L152C(6-8-B)(T-U)x(A)
LoRa.menu.pnum.RAK811_TRACKER.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
LoRa.menu.pnum.RAK811_TRACKER.openocd.target=stm32l1
LoRa.menu.pnum.RAK811_TRACKER.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L1xx/STM32L151.svd

LoRa.menu.pnum.RAK811_TRACKERA=RAK811 LoRa Tracker (32kb RAM)
LoRa.menu.pnum.RAK811_TRACKERA.upload.maximum_size=131072
LoRa.menu.pnum.RAK811_TRACKERA.upload.maximum_data_size=32768
LoRa.menu.pnum.RAK811_TRACKERA.build.mcu=cortex-m3
LoRa.menu.pnum.RAK811_TRACKERA.build.board=RAK811_TRACKERA
LoRa.menu.pnum.RAK811_TRACKERA.build.series=STM32L1xx
LoRa.menu.pnum.RAK811_TRACKERA.build.product_line=STM32L151xBA
LoRa.menu.pnum.RAK811_TRACKERA.build.variant=STM32L1xx/L100C6Ux(A)_L151C(6-8-B)(T-U)x(A)_L152C(6-8-B)(T-U)x(A)
LoRa.menu.pnum.RAK811_TRACKERA.build.variant_h=variant_RAK811_TRACKER.h
LoRa.menu.pnum.RAK811_TRACKERA.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
LoRa.menu.pnum.RAK811_TRACKERA.openocd.target=stm32l1

# RHF76_052 board
LoRa.menu.pnum.RHF76_052=RHF76 052
LoRa.menu.pnum.RHF76_052.upload.maximum_size=65536
LoRa.menu.pnum.RHF76_052.upload.maximum_data_size=8192
LoRa.menu.pnum.RHF76_052.build.mcu=cortex-m0plus
LoRa.menu.pnum.RHF76_052.build.board=RHF76_052
LoRa.menu.pnum.RHF76_052.build.series=STM32L0xx
LoRa.menu.pnum.RHF76_052.build.product_line=STM32L051xx
LoRa.menu.pnum.RHF76_052.build.variant=STM32L0xx/L051C(6-8)(T-U)
LoRa.menu.pnum.RHF76_052.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
LoRa.menu.pnum.RHF76_052.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} -D__CORTEX_SC=0
LoRa.menu.pnum.RHF76_052.openocd.target=stm32l0
LoRa.menu.pnum.RHF76_052.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L0x1.svd

# ELEKTOR_F072C8
LoRa.menu.pnum.ELEKTOR_F072C8=Elektor LoRa Node Core F072C8 (64kB)
LoRa.menu.pnum.ELEKTOR_F072C8.upload.maximum_data_size=16384
LoRa.menu.pnum.ELEKTOR_F072C8.upload.maximum_size=65536
LoRa.menu.pnum.ELEKTOR_F072C8.build.mcu=cortex-m0
LoRa.menu.pnum.ELEKTOR_F072C8.build.board=ELEKTOR_F072C8
LoRa.menu.pnum.ELEKTOR_F072C8.build.series=STM32F0xx
LoRa.menu.pnum.ELEKTOR_F072C8.build.product_line=STM32F072xB
LoRa.menu.pnum.ELEKTOR_F072C8.build.variant=STM32F0xx/F072C8(T-U)_F072CB(T-U-Y)
LoRa.menu.pnum.ELEKTOR_F072C8.build.variant_h=variant_ELEKTOR_F072Cx.h
LoRa.menu.pnum.ELEKTOR_F072C8.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
LoRa.menu.pnum.ELEKTOR_F072C8.build.st_extra_flags=-D{build.product_line} {build.xSerial}
LoRa.menu.pnum.ELEKTOR_F072C8.openocd.target=stm32f0x
LoRa.menu.pnum.ELEKTOR_F072C8.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F0xx/STM32F0x2.svd

# ELEKTOR_F072CB
LoRa.menu.pnum.ELEKTOR_F072CB=Elektor LoRa Node Core F072CB (128kB)
LoRa.menu.pnum.ELEKTOR_F072CB.upload.maximum_data_size=16384
LoRa.menu.pnum.ELEKTOR_F072CB.upload.maximum_size=131072
LoRa.menu.pnum.ELEKTOR_F072CB.build.mcu=cortex-m0
LoRa.menu.pnum.ELEKTOR_F072CB.build.board=ELEKTOR_F072CB
LoRa.menu.pnum.ELEKTOR_F072CB.build.series=STM32F0xx
LoRa.menu.pnum.ELEKTOR_F072CB.build.product_line=STM32F072xB
LoRa.menu.pnum.ELEKTOR_F072CB.build.variant=STM32F0xx/F072C8(T-U)_F072CB(T-U-Y)
LoRa.menu.pnum.ELEKTOR_F072CB.build.variant_h=variant_ELEKTOR_F072Cx.h
LoRa.menu.pnum.ELEKTOR_F072CB.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
LoRa.menu.pnum.ELEKTOR_F072CB.build.st_extra_flags=-D{build.product_line} {build.xSerial}
LoRa.menu.pnum.ELEKTOR_F072CB.openocd.target=stm32f0x
LoRa.menu.pnum.ELEKTOR_F072CB.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F0xx/STM32F0x2.svd

# Oceanus-I Module
LoRa.menu.pnum.WE_OCEANUS1=Oceanus-I Module
LoRa.menu.pnum.WE_OCEANUS1.upload.maximum_size=262144
LoRa.menu.pnum.WE_OCEANUS1.upload.maximum_data_size=65536
LoRa.menu.pnum.WE_OCEANUS1.build.mcu=cortex-m4
LoRa.menu.pnum.WE_OCEANUS1.build.board=WE_OCEANUS1
LoRa.menu.pnum.WE_OCEANUS1.build.series=STM32WLxx
LoRa.menu.pnum.WE_OCEANUS1.build.product_line=STM32WLE5xx
LoRa.menu.pnum.WE_OCEANUS1.build.variant=STM32WLxx/WL54CCU_WL55CCU_WLE4C(8-B-C)U_WLE5C(8-B-C)U
LoRa.menu.pnum.WE_OCEANUS1.build.variant_h=variant_WE_OCEANUS1.h
LoRa.menu.pnum.WE_OCEANUS1.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
LoRa.menu.pnum.WE_OCEANUS1.openocd.target=stm32wlx
LoRa.menu.pnum.WE_OCEANUS1.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32WLxx/STM32WLE5_CM4.svd

# Oceanus-I EV
LoRa.menu.pnum.WE_OCEANUS1_EV=Oceanus-I EV
LoRa.menu.pnum.WE_OCEANUS1_EV.upload.maximum_size=262144
LoRa.menu.pnum.WE_OCEANUS1_EV.upload.maximum_data_size=65536
LoRa.menu.pnum.WE_OCEANUS1_EV.build.mcu=cortex-m4
LoRa.menu.pnum.WE_OCEANUS1_EV.build.board=WE_OCEANUS1_EV
LoRa.menu.pnum.WE_OCEANUS1_EV.build.series=STM32WLxx
LoRa.menu.pnum.WE_OCEANUS1_EV.build.product_line=STM32WLE5xx
LoRa.menu.pnum.WE_OCEANUS1_EV.build.variant=STM32WLxx/WL54CCU_WL55CCU_WLE4C(8-B-C)U_WLE5C(8-B-C)U
LoRa.menu.pnum.WE_OCEANUS1_EV.build.variant_h=variant_WE_OCEANUS1_EV.h
LoRa.menu.pnum.WE_OCEANUS1_EV.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
LoRa.menu.pnum.WE_OCEANUS1_EV.openocd.target=stm32wlx
LoRa.menu.pnum.WE_OCEANUS1_EV.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32WLxx/STM32WLE5_CM4.svd

# Upload menu
LoRa.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
LoRa.menu.upload_method.swdMethod.upload.protocol=swd
LoRa.menu.upload_method.swdMethod.upload.options=
LoRa.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

LoRa.menu.upload_method.jlinkMethod=STM32CubeProgrammer (J-Link)
LoRa.menu.upload_method.jlinkMethod.upload.protocol=jlink
LoRa.menu.upload_method.jlinkMethod.upload.options=
LoRa.menu.upload_method.jlinkMethod.upload.tool=stm32CubeProg

