stm32duino/Arduino_Core_STM32/boards.txt
LoRa.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
LoRa.menu.upload_method.serialMethod.upload.protocol=serial
LoRa.menu.upload_method.serialMethod.upload.options=-c {serial.port.file}
LoRa.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

LoRa.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
LoRa.menu.upload_method.dfuMethod.upload.protocol=dfu
LoRa.menu.upload_method.dfuMethod.upload.options=-v {upload.vid} -p {upload.pid}
LoRa.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

LoRa.menu.upload_method.bmpMethod=BMP (Black Magic Probe)
LoRa.menu.upload_method.bmpMethod.upload.protocol=gdb_bmp
LoRa.menu.upload_method.bmpMethod.upload.tool=bmp_upload

LoRa.menu.upload_method.OpenOCDSTLink=OpenOCD STLink (SWD)
LoRa.menu.upload_method.OpenOCDSTLink.upload.protocol=stlink
LoRa.menu.upload_method.OpenOCDSTLink.upload.tool=openocd_upload

LoRa.menu.upload_method.OpenOCDDapLink=OpenOCD DapLink (SWD)
LoRa.menu.upload_method.OpenOCDDapLink.upload.protocol=cmsis-dap
LoRa.menu.upload_method.OpenOCDDapLink.upload.tool=openocd_upload

################################################################################
# Midatronics boards

Midatronics.name=Midatronics boards

Midatronics.build.core=arduino
Midatronics.build.board=Midatronics
Midatronics.build.variant_h=variant_{build.board}.h
Midatronics.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
Midatronics.build.flash_offset=0x0
Midatronics.upload.maximum_size=0
Midatronics.upload.maximum_data_size=0
Midatronics.vid.0=0x0483
Midatronics.pid.0=0x5740

# MKR_SHARKY board
Midatronics.menu.pnum.MKR_SHARKY=MKR Sharky
Midatronics.menu.pnum.MKR_SHARKY.node=NODE_WB55CE
Midatronics.menu.pnum.MKR_SHARKY.upload.maximum_size=262144
Midatronics.menu.pnum.MKR_SHARKY.upload.maximum_data_size=196608
Midatronics.menu.pnum.MKR_SHARKY.build.mcu=cortex-m4
Midatronics.menu.pnum.MKR_SHARKY.build.fpu=-mfpu=fpv4-sp-d16
Midatronics.menu.pnum.MKR_SHARKY.build.float-abi=-mfloat-abi=hard
Midatronics.menu.pnum.MKR_SHARKY.build.board=MKR_SHARKY
Midatronics.menu.pnum.MKR_SHARKY.build.series=STM32WBxx
Midatronics.menu.pnum.MKR_SHARKY.build.product_line=STM32WB55xx
Midatronics.menu.pnum.MKR_SHARKY.build.variant=STM32WBxx/WB35C(C-E)UxA_WB55C(C-E-G)U
Midatronics.menu.pnum.MKR_SHARKY.openocd.target=stm32wbx
Midatronics.menu.pnum.MKR_SHARKY.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32WBxx/STM32WB55_CM4.svd

# Upload menu
Midatronics.menu.upload_method.MassStorage=Mass Storage
Midatronics.menu.upload_method.MassStorage.upload.protocol=
Midatronics.menu.upload_method.MassStorage.upload.tool=massStorageCopy

Midatronics.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
Midatronics.menu.upload_method.swdMethod.upload.protocol=swd
Midatronics.menu.upload_method.swdMethod.upload.options=
Midatronics.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

Midatronics.menu.upload_method.jlinkMethod=STM32CubeProgrammer (J-Link)
Midatronics.menu.upload_method.jlinkMethod.upload.protocol=jlink
Midatronics.menu.upload_method.jlinkMethod.upload.options=
Midatronics.menu.upload_method.jlinkMethod.upload.tool=stm32CubeProg

Midatronics.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
Midatronics.menu.upload_method.serialMethod.upload.protocol=serial
Midatronics.menu.upload_method.serialMethod.upload.options=-c {serial.port.file}
Midatronics.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

Midatronics.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
Midatronics.menu.upload_method.dfuMethod.upload.protocol=dfu
Midatronics.menu.upload_method.dfuMethod.upload.options=-v {upload.vid} -p {upload.pid}
Midatronics.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

Midatronics.menu.upload_method.bmpMethod=BMP (Black Magic Probe)
Midatronics.menu.upload_method.bmpMethod.upload.protocol=gdb_bmp
Midatronics.menu.upload_method.bmpMethod.upload.tool=bmp_upload

Midatronics.menu.upload_method.OpenOCDSTLink=OpenOCD STLink (SWD)
Midatronics.menu.upload_method.OpenOCDSTLink.upload.protocol=stlink
Midatronics.menu.upload_method.OpenOCDSTLink.upload.tool=openocd_upload

Midatronics.menu.upload_method.OpenOCDDapLink=OpenOCD DapLink (SWD)
Midatronics.menu.upload_method.OpenOCDDapLink.upload.protocol=cmsis-dap
Midatronics.menu.upload_method.OpenOCDDapLink.upload.tool=openocd_upload

################################################################################
# SparkFun Boards

SparkFun.name=SparkFun Boards

SparkFun.build.core=arduino
SparkFun.build.board=SparkFun
SparkFun.build.variant_h=variant_{build.board}.h
SparkFun.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
SparkFun.build.flash_offset=0x0
SparkFun.upload.maximum_size=0
SparkFun.upload.maximum_data_size=0
SparkFun.vid.0=0x0483
SparkFun.pid.0=0x5740

# SFE_MMPB_STM32WB5MMG board
SparkFun.menu.pnum.SFE_MMPB_STM32WB5MMG=SparkFun MicroMod STM32WB5MMG
SparkFun.menu.pnum.SFE_MMPB_STM32WB5MMG.upload.maximum_size=827392
SparkFun.menu.pnum.SFE_MMPB_STM32WB5MMG.upload.maximum_data_size=196608
SparkFun.menu.pnum.SFE_MMPB_STM32WB5MMG.build.mcu=cortex-m4
SparkFun.menu.pnum.SFE_MMPB_STM32WB5MMG.build.fpu=-mfpu=fpv4-sp-d16
SparkFun.menu.pnum.SFE_MMPB_STM32WB5MMG.build.float-abi=-mfloat-abi=hard
SparkFun.menu.pnum.SFE_MMPB_STM32WB5MMG.build.board=SFE_MMPB_STM32WB5MMG
SparkFun.menu.pnum.SFE_MMPB_STM32WB5MMG.build.series=STM32WBxx
SparkFun.menu.pnum.SFE_MMPB_STM32WB5MMG.build.product_line=STM32WB5Mxx
SparkFun.menu.pnum.SFE_MMPB_STM32WB5MMG.build.variant=STM32WBxx/WB5MMGH
SparkFun.menu.pnum.SFE_MMPB_STM32WB5MMG.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
SparkFun.menu.pnum.SFE_MMPB_STM32WB5MMG.vid.0=0x1B4F
SparkFun.menu.pnum.SFE_MMPB_STM32WB5MMG.pid.0=0x0034
SparkFun.menu.pnum.SFE_MMPB_STM32WB5MMG.openocd.target=stm32wbx
SparkFun.menu.pnum.SFE_MMPB_STM32WB5MMG.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32WBxx/STM32WB55_CM4.svd

# SparkFun MicroMod STM32F405 Board
SparkFun.menu.pnum.MICROMOD_F405=SparkFun MicroMod STM32F405
SparkFun.menu.pnum.MICROMOD_F405.upload.maximum_size=1048576
SparkFun.menu.pnum.MICROMOD_F405.upload.maximum_data_size=131072
SparkFun.menu.pnum.MICROMOD_F405.build.mcu=cortex-m4
SparkFun.menu.pnum.MICROMOD_F405.build.fpu=-mfpu=fpv4-sp-d16
SparkFun.menu.pnum.MICROMOD_F405.build.float-abi=-mfloat-abi=hard
SparkFun.menu.pnum.MICROMOD_F405.build.board=MICROMOD_F405
SparkFun.menu.pnum.MICROMOD_F405.build.series=STM32F4xx
SparkFun.menu.pnum.MICROMOD_F405.build.product_line=STM32F405xx
SparkFun.menu.pnum.MICROMOD_F405.build.variant_h=variant_{build.board}.h
SparkFun.menu.pnum.MICROMOD_F405.build.variant=STM32F4xx/F405RGT_F415RGT
SparkFun.menu.pnum.MICROMOD_F405.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
SparkFun.menu.pnum.MICROMOD_F405.vid.0=0x1B4F
SparkFun.menu.pnum.MICROMOD_F405.pid.0=0x0029
SparkFun.menu.pnum.MICROMOD_F405.openocd.target=stm32f4x
SparkFun.menu.pnum.MICROMOD_F405.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F4xx/STM32F405.svd

# Upload menu
SparkFun.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
SparkFun.menu.upload_method.swdMethod.upload.protocol=swd
SparkFun.menu.upload_method.swdMethod.upload.options=
SparkFun.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

SparkFun.menu.upload_method.jlinkMethod=STM32CubeProgrammer (J-Link)
SparkFun.menu.upload_method.jlinkMethod.upload.protocol=jlink
SparkFun.menu.upload_method.jlinkMethod.upload.options=
SparkFun.menu.upload_method.jlinkMethod.upload.tool=stm32CubeProg

SparkFun.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
SparkFun.menu.upload_method.serialMethod.upload.protocol=serial
SparkFun.menu.upload_method.serialMethod.upload.options=-c {serial.port.file}
SparkFun.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

