stm32duino/Arduino_Core_STM32/boards.txt
GenL0.menu.opt.osstd=Smallest (-Os default)
GenL0.menu.opt.oslto=Smallest (-Os) with LTO
GenL0.menu.opt.oslto.build.flags.optimize=-Os -flto
GenL0.menu.opt.o1std=Fast (-O1)
GenL0.menu.opt.o1std.build.flags.optimize=-O1
GenL0.menu.opt.o1lto=Fast (-O1) with LTO
GenL0.menu.opt.o1lto.build.flags.optimize=-O1 -flto
GenL0.menu.opt.o2std=Faster (-O2)
GenL0.menu.opt.o2std.build.flags.optimize=-O2
GenL0.menu.opt.o2lto=Faster (-O2) with LTO
GenL0.menu.opt.o2lto.build.flags.optimize=-O2 -flto
GenL0.menu.opt.o3std=Fastest (-O3)
GenL0.menu.opt.o3std.build.flags.optimize=-O3
GenL0.menu.opt.o3lto=Fastest (-O3) with LTO
GenL0.menu.opt.o3lto.build.flags.optimize=-O3 -flto
GenL0.menu.opt.ogstd=Debug (-Og)
GenL0.menu.opt.ogstd.build.flags.optimize=-Og
GenL0.menu.opt.o0std=No Optimization (-O0)
GenL0.menu.opt.o0std.build.flags.optimize=-O0

GenL1.menu.opt.osstd=Smallest (-Os default)
GenL1.menu.opt.oslto=Smallest (-Os) with LTO
GenL1.menu.opt.oslto.build.flags.optimize=-Os -flto
GenL1.menu.opt.o1std=Fast (-O1)
GenL1.menu.opt.o1std.build.flags.optimize=-O1
GenL1.menu.opt.o1lto=Fast (-O1) with LTO
GenL1.menu.opt.o1lto.build.flags.optimize=-O1 -flto
GenL1.menu.opt.o2std=Faster (-O2)
GenL1.menu.opt.o2std.build.flags.optimize=-O2
GenL1.menu.opt.o2lto=Faster (-O2) with LTO
GenL1.menu.opt.o2lto.build.flags.optimize=-O2 -flto
GenL1.menu.opt.o3std=Fastest (-O3)
GenL1.menu.opt.o3std.build.flags.optimize=-O3
GenL1.menu.opt.o3lto=Fastest (-O3) with LTO
GenL1.menu.opt.o3lto.build.flags.optimize=-O3 -flto
GenL1.menu.opt.ogstd=Debug (-Og)
GenL1.menu.opt.ogstd.build.flags.optimize=-Og
GenL1.menu.opt.o0std=No Optimization (-O0)
GenL1.menu.opt.o0std.build.flags.optimize=-O0

GenL4.menu.opt.osstd=Smallest (-Os default)
GenL4.menu.opt.oslto=Smallest (-Os) with LTO
GenL4.menu.opt.oslto.build.flags.optimize=-Os -flto
GenL4.menu.opt.o1std=Fast (-O1)
GenL4.menu.opt.o1std.build.flags.optimize=-O1
GenL4.menu.opt.o1lto=Fast (-O1) with LTO
GenL4.menu.opt.o1lto.build.flags.optimize=-O1 -flto
GenL4.menu.opt.o2std=Faster (-O2)
GenL4.menu.opt.o2std.build.flags.optimize=-O2
GenL4.menu.opt.o2lto=Faster (-O2) with LTO
GenL4.menu.opt.o2lto.build.flags.optimize=-O2 -flto
GenL4.menu.opt.o3std=Fastest (-O3)
GenL4.menu.opt.o3std.build.flags.optimize=-O3
GenL4.menu.opt.o3lto=Fastest (-O3) with LTO
GenL4.menu.opt.o3lto.build.flags.optimize=-O3 -flto
GenL4.menu.opt.ogstd=Debug (-Og)
GenL4.menu.opt.ogstd.build.flags.optimize=-Og
GenL4.menu.opt.o0std=No Optimization (-O0)
GenL4.menu.opt.o0std.build.flags.optimize=-O0

GenL5.menu.opt.osstd=Smallest (-Os default)
GenL5.menu.opt.oslto=Smallest (-Os) with LTO
GenL5.menu.opt.oslto.build.flags.optimize=-Os -flto
GenL5.menu.opt.o1std=Fast (-O1)
GenL5.menu.opt.o1std.build.flags.optimize=-O1
GenL5.menu.opt.o1lto=Fast (-O1) with LTO
GenL5.menu.opt.o1lto.build.flags.optimize=-O1 -flto
GenL5.menu.opt.o2std=Faster (-O2)
GenL5.menu.opt.o2std.build.flags.optimize=-O2
GenL5.menu.opt.o2lto=Faster (-O2) with LTO
GenL5.menu.opt.o2lto.build.flags.optimize=-O2 -flto
GenL5.menu.opt.o3std=Fastest (-O3)
GenL5.menu.opt.o3std.build.flags.optimize=-O3
GenL5.menu.opt.o3lto=Fastest (-O3) with LTO
GenL5.menu.opt.o3lto.build.flags.optimize=-O3 -flto
GenL5.menu.opt.ogstd=Debug (-Og)
GenL5.menu.opt.ogstd.build.flags.optimize=-Og
GenL5.menu.opt.o0std=No Optimization (-O0)
GenL5.menu.opt.o0std.build.flags.optimize=-O0

GenU0.menu.opt.osstd=Smallest (-Os default)
GenU0.menu.opt.osstd.build.flags.optimize=-Os
GenU0.menu.opt.oslto=Smallest (-Os) with LTO
GenU0.menu.opt.oslto.build.flags.optimize=-Os -flto
GenU0.menu.opt.o1std=Fast (-O1)
GenU0.menu.opt.o1std.build.flags.optimize=-O1
GenU0.menu.opt.o1lto=Fast (-O1) with LTO
GenU0.menu.opt.o1lto.build.flags.optimize=-O1 -flto
GenU0.menu.opt.o2std=Faster (-O2)
GenU0.menu.opt.o2std.build.flags.optimize=-O2
GenU0.menu.opt.o2lto=Faster (-O2) with LTO
GenU0.menu.opt.o2lto.build.flags.optimize=-O2 -flto
GenU0.menu.opt.o3std=Fastest (-O3)
GenU0.menu.opt.o3std.build.flags.optimize=-O3
GenU0.menu.opt.o3lto=Fastest (-O3) with LTO
GenU0.menu.opt.o3lto.build.flags.optimize=-O3 -flto
GenU0.menu.opt.ogstd=Debug (-Og)
GenU0.menu.opt.ogstd.build.flags.optimize=-Og
GenU0.menu.opt.o0std=No Optimization (-O0)
GenU0.menu.opt.o0std.build.flags.optimize=-O0

GenU3.menu.opt.osstd=Smallest (-Os default)
GenU3.menu.opt.osstd.build.flags.optimize=-Os
GenU3.menu.opt.oslto=Smallest (-Os) with LTO
GenU3.menu.opt.oslto.build.flags.optimize=-Os -flto
GenU3.menu.opt.o1std=Fast (-O1)
GenU3.menu.opt.o1std.build.flags.optimize=-O1
GenU3.menu.opt.o1lto=Fast (-O1) with LTO
GenU3.menu.opt.o1lto.build.flags.optimize=-O1 -flto
GenU3.menu.opt.o2std=Faster (-O2)
GenU3.menu.opt.o2std.build.flags.optimize=-O2
GenU3.menu.opt.o2lto=Faster (-O2) with LTO
GenU3.menu.opt.o2lto.build.flags.optimize=-O2 -flto
GenU3.menu.opt.o3std=Fastest (-O3)
GenU3.menu.opt.o3std.build.flags.optimize=-O3
GenU3.menu.opt.o3lto=Fastest (-O3) with LTO
GenU3.menu.opt.o3lto.build.flags.optimize=-O3 -flto
GenU3.menu.opt.ogstd=Debug (-Og)
GenU3.menu.opt.ogstd.build.flags.optimize=-Og
GenU3.menu.opt.o0std=No Optimization (-O0)
GenU3.menu.opt.o0std.build.flags.optimize=-O0

GenU5.menu.opt.osstd=Smallest (-Os default)
GenU5.menu.opt.osstd.build.flags.optimize=-Os
GenU5.menu.opt.oslto=Smallest (-Os) with LTO
GenU5.menu.opt.oslto.build.flags.optimize=-Os -flto
GenU5.menu.opt.o1std=Fast (-O1)
GenU5.menu.opt.o1std.build.flags.optimize=-O1
GenU5.menu.opt.o1lto=Fast (-O1) with LTO
GenU5.menu.opt.o1lto.build.flags.optimize=-O1 -flto
GenU5.menu.opt.o2std=Faster (-O2)
GenU5.menu.opt.o2std.build.flags.optimize=-O2
GenU5.menu.opt.o2lto=Faster (-O2) with LTO
GenU5.menu.opt.o2lto.build.flags.optimize=-O2 -flto
GenU5.menu.opt.o3std=Fastest (-O3)
GenU5.menu.opt.o3std.build.flags.optimize=-O3
GenU5.menu.opt.o3lto=Fastest (-O3) with LTO
GenU5.menu.opt.o3lto.build.flags.optimize=-O3 -flto
GenU5.menu.opt.ogstd=Debug (-Og)
GenU5.menu.opt.ogstd.build.flags.optimize=-Og
GenU5.menu.opt.o0std=No Optimization (-O0)
GenU5.menu.opt.o0std.build.flags.optimize=-O0

GenWB.menu.opt.osstd=Smallest (-Os default)
GenWB.menu.opt.oslto=Smallest (-Os) with LTO
GenWB.menu.opt.oslto.build.flags.optimize=-Os -flto
GenWB.menu.opt.o1std=Fast (-O1)
GenWB.menu.opt.o1std.build.flags.optimize=-O1
GenWB.menu.opt.o1lto=Fast (-O1) with LTO
GenWB.menu.opt.o1lto.build.flags.optimize=-O1 -flto
GenWB.menu.opt.o2std=Faster (-O2)
GenWB.menu.opt.o2std.build.flags.optimize=-O2
GenWB.menu.opt.o2lto=Faster (-O2) with LTO
GenWB.menu.opt.o2lto.build.flags.optimize=-O2 -flto
GenWB.menu.opt.o3std=Fastest (-O3)
GenWB.menu.opt.o3std.build.flags.optimize=-O3
GenWB.menu.opt.o3lto=Fastest (-O3) with LTO
GenWB.menu.opt.o3lto.build.flags.optimize=-O3 -flto
GenWB.menu.opt.ogstd=Debug (-Og)
GenWB.menu.opt.ogstd.build.flags.optimize=-Og
GenWB.menu.opt.o0std=No Optimization (-O0)
GenWB.menu.opt.o0std.build.flags.optimize=-O0

