stm32duino/Arduino_Core_STM32/boards.txt
GenWB0.menu.opt.osstd=Smallest (-Os default)
GenWB0.menu.opt.oslto=Smallest (-Os) with LTO
GenWB0.menu.opt.oslto.build.flags.optimize=-Os -flto
GenWB0.menu.opt.o1std=Fast (-O1)
GenWB0.menu.opt.o1std.build.flags.optimize=-O1
GenWB0.menu.opt.o1lto=Fast (-O1) with LTO
GenWB0.menu.opt.o1lto.build.flags.optimize=-O1 -flto
GenWB0.menu.opt.o2std=Faster (-O2)
GenWB0.menu.opt.o2std.build.flags.optimize=-O2
GenWB0.menu.opt.o2lto=Faster (-O2) with LTO
GenWB0.menu.opt.o2lto.build.flags.optimize=-O2 -flto
GenWB0.menu.opt.o3std=Fastest (-O3)
GenWB0.menu.opt.o3std.build.flags.optimize=-O3
GenWB0.menu.opt.o3lto=Fastest (-O3) with LTO
GenWB0.menu.opt.o3lto.build.flags.optimize=-O3 -flto
GenWB0.menu.opt.ogstd=Debug (-Og)
GenWB0.menu.opt.ogstd.build.flags.optimize=-Og
GenWB0.menu.opt.o0std=No Optimization (-O0)
GenWB0.menu.opt.o0std.build.flags.optimize=-O0

GenWBA.menu.opt.osstd=Smallest (-Os default)
GenWBA.menu.opt.oslto=Smallest (-Os) with LTO
GenWBA.menu.opt.oslto.build.flags.optimize=-Os -flto
GenWBA.menu.opt.o1std=Fast (-O1)
GenWBA.menu.opt.o1std.build.flags.optimize=-O1
GenWBA.menu.opt.o1lto=Fast (-O1) with LTO
GenWBA.menu.opt.o1lto.build.flags.optimize=-O1 -flto
GenWBA.menu.opt.o2std=Faster (-O2)
GenWBA.menu.opt.o2std.build.flags.optimize=-O2
GenWBA.menu.opt.o2lto=Faster (-O2) with LTO
GenWBA.menu.opt.o2lto.build.flags.optimize=-O2 -flto
GenWBA.menu.opt.o3std=Fastest (-O3)
GenWBA.menu.opt.o3std.build.flags.optimize=-O3
GenWBA.menu.opt.o3lto=Fastest (-O3) with LTO
GenWBA.menu.opt.o3lto.build.flags.optimize=-O3 -flto
GenWBA.menu.opt.ogstd=Debug (-Og)
GenWBA.menu.opt.ogstd.build.flags.optimize=-Og
GenWBA.menu.opt.o0std=No Optimization (-O0)
GenWBA.menu.opt.o0std.build.flags.optimize=-O0

GenWL.menu.opt.osstd=Smallest (-Os default)
GenWL.menu.opt.oslto=Smallest (-Os) with LTO
GenWL.menu.opt.oslto.build.flags.optimize=-Os -flto
GenWL.menu.opt.o1std=Fast (-O1)
GenWL.menu.opt.o1std.build.flags.optimize=-O1
GenWL.menu.opt.o1lto=Fast (-O1) with LTO
GenWL.menu.opt.o1lto.build.flags.optimize=-O1 -flto
GenWL.menu.opt.o2std=Faster (-O2)
GenWL.menu.opt.o2std.build.flags.optimize=-O2
GenWL.menu.opt.o2lto=Faster (-O2) with LTO
GenWL.menu.opt.o2lto.build.flags.optimize=-O2 -flto
GenWL.menu.opt.o3std=Fastest (-O3)
GenWL.menu.opt.o3std.build.flags.optimize=-O3
GenWL.menu.opt.o3lto=Fastest (-O3) with LTO
GenWL.menu.opt.o3lto.build.flags.optimize=-O3 -flto
GenWL.menu.opt.ogstd=Debug (-Og)
GenWL.menu.opt.ogstd.build.flags.optimize=-Og
GenWL.menu.opt.o0std=No Optimization (-O0)
GenWL.menu.opt.o0std.build.flags.optimize=-O0

3dprinter.menu.opt.osstd=Smallest (-Os default)
3dprinter.menu.opt.oslto=Smallest (-Os) with LTO
3dprinter.menu.opt.oslto.build.flags.optimize=-Os -flto
3dprinter.menu.opt.o1std=Fast (-O1)
3dprinter.menu.opt.o1std.build.flags.optimize=-O1
3dprinter.menu.opt.o1lto=Fast (-O1) with LTO
3dprinter.menu.opt.o1lto.build.flags.optimize=-O1 -flto
3dprinter.menu.opt.o2std=Faster (-O2)
3dprinter.menu.opt.o2std.build.flags.optimize=-O2
3dprinter.menu.opt.o2lto=Faster (-O2) with LTO
3dprinter.menu.opt.o2lto.build.flags.optimize=-O2 -flto
3dprinter.menu.opt.o3std=Fastest (-O3)
3dprinter.menu.opt.o3std.build.flags.optimize=-O3
3dprinter.menu.opt.o3lto=Fastest (-O3) with LTO
3dprinter.menu.opt.o3lto.build.flags.optimize=-O3 -flto
3dprinter.menu.opt.ogstd=Debug (-Og)
3dprinter.menu.opt.ogstd.build.flags.optimize=-Og
3dprinter.menu.opt.o0std=No Optimization (-O0)
3dprinter.menu.opt.o0std.build.flags.optimize=-O0

Blues.menu.opt.osstd=Smallest (-Os default)
Blues.menu.opt.oslto=Smallest (-Os) with LTO
Blues.menu.opt.oslto.build.flags.optimize=-Os -flto
Blues.menu.opt.o1std=Fast (-O1)
Blues.menu.opt.o1std.build.flags.optimize=-O1
Blues.menu.opt.o1lto=Fast (-O1) with LTO
Blues.menu.opt.o1lto.build.flags.optimize=-O1 -flto
Blues.menu.opt.o2std=Faster (-O2)
Blues.menu.opt.o2std.build.flags.optimize=-O2
Blues.menu.opt.o2lto=Faster (-O2) with LTO
Blues.menu.opt.o2lto.build.flags.optimize=-O2 -flto
Blues.menu.opt.o3std=Fastest (-O3)
Blues.menu.opt.o3std.build.flags.optimize=-O3
Blues.menu.opt.o3lto=Fastest (-O3) with LTO
Blues.menu.opt.o3lto.build.flags.optimize=-O3 -flto
Blues.menu.opt.ogstd=Debug (-Og)
Blues.menu.opt.ogstd.build.flags.optimize=-Og
Blues.menu.opt.o0std=No Optimization (-O0)
Blues.menu.opt.o0std.build.flags.optimize=-O0

Elecgator.menu.opt.osstd=Smallest (-Os default)
Elecgator.menu.opt.oslto=Smallest (-Os) with LTO
Elecgator.menu.opt.oslto.build.flags.optimize=-Os -flto
Elecgator.menu.opt.o1std=Fast (-O1)
Elecgator.menu.opt.o1std.build.flags.optimize=-O1
Elecgator.menu.opt.o1lto=Fast (-O1) with LTO
Elecgator.menu.opt.o1lto.build.flags.optimize=-O1 -flto
Elecgator.menu.opt.o2std=Faster (-O2)
Elecgator.menu.opt.o2std.build.flags.optimize=-O2
Elecgator.menu.opt.o2lto=Faster (-O2) with LTO
Elecgator.menu.opt.o2lto.build.flags.optimize=-O2 -flto
Elecgator.menu.opt.o3std=Fastest (-O3)
Elecgator.menu.opt.o3std.build.flags.optimize=-O3
Elecgator.menu.opt.o3lto=Fastest (-O3) with LTO
Elecgator.menu.opt.o3lto.build.flags.optimize=-O3 -flto
Elecgator.menu.opt.ogstd=Debug (-Og)
Elecgator.menu.opt.ogstd.build.flags.optimize=-Og
Elecgator.menu.opt.o0std=No Optimization (-O0)
Elecgator.menu.opt.o0std.build.flags.optimize=-O0

ESC_board.menu.opt.osstd=Smallest (-Os default)
ESC_board.menu.opt.oslto=Smallest (-Os) with LTO
ESC_board.menu.opt.oslto.build.flags.optimize=-Os -flto
ESC_board.menu.opt.o1std=Fast (-O1)
ESC_board.menu.opt.o1std.build.flags.optimize=-O1
ESC_board.menu.opt.o1lto=Fast (-O1) with LTO
ESC_board.menu.opt.o1lto.build.flags.optimize=-O1 -flto
ESC_board.menu.opt.o2std=Faster (-O2)
ESC_board.menu.opt.o2std.build.flags.optimize=-O2
ESC_board.menu.opt.o2lto=Faster (-O2) with LTO
ESC_board.menu.opt.o2lto.build.flags.optimize=-O2 -flto
ESC_board.menu.opt.o3std=Fastest (-O3)
ESC_board.menu.opt.o3std.build.flags.optimize=-O3
ESC_board.menu.opt.o3lto=Fastest (-O3) with LTO
ESC_board.menu.opt.o3lto.build.flags.optimize=-O3 -flto
ESC_board.menu.opt.ogstd=Debug (-Og)
ESC_board.menu.opt.ogstd.build.flags.optimize=-Og
ESC_board.menu.opt.o0std=No Optimization (-O0)
ESC_board.menu.opt.o0std.build.flags.optimize=-O0

Garatronic.menu.opt.osstd=Smallest (-Os default)
Garatronic.menu.opt.oslto=Smallest (-Os) with LTO
Garatronic.menu.opt.oslto.build.flags.optimize=-Os -flto
Garatronic.menu.opt.o1std=Fast (-O1)
Garatronic.menu.opt.o1std.build.flags.optimize=-O1
Garatronic.menu.opt.o1lto=Fast (-O1) with LTO
Garatronic.menu.opt.o1lto.build.flags.optimize=-O1 -flto
Garatronic.menu.opt.o2std=Faster (-O2)
Garatronic.menu.opt.o2std.build.flags.optimize=-O2
Garatronic.menu.opt.o2lto=Faster (-O2) with LTO
Garatronic.menu.opt.o2lto.build.flags.optimize=-O2 -flto
Garatronic.menu.opt.o3std=Fastest (-O3)
Garatronic.menu.opt.o3std.build.flags.optimize=-O3
Garatronic.menu.opt.o3lto=Fastest (-O3) with LTO
Garatronic.menu.opt.o3lto.build.flags.optimize=-O3 -flto
Garatronic.menu.opt.ogstd=Debug (-Og)
Garatronic.menu.opt.ogstd.build.flags.optimize=-Og
Garatronic.menu.opt.o0std=No Optimization (-O0)
Garatronic.menu.opt.o0std.build.flags.optimize=-O0

