stm32duino/Arduino_Core_STM32/boards.txt
GenFlight.menu.opt.osstd=Smallest (-Os default)
GenFlight.menu.opt.oslto=Smallest (-Os) with LTO
GenFlight.menu.opt.oslto.build.flags.optimize=-Os -flto
GenFlight.menu.opt.o1std=Fast (-O1)
GenFlight.menu.opt.o1std.build.flags.optimize=-O1
GenFlight.menu.opt.o1lto=Fast (-O1) with LTO
GenFlight.menu.opt.o1lto.build.flags.optimize=-O1 -flto
GenFlight.menu.opt.o2std=Faster (-O2)
GenFlight.menu.opt.o2std.build.flags.optimize=-O2
GenFlight.menu.opt.o2lto=Faster (-O2) with LTO
GenFlight.menu.opt.o2lto.build.flags.optimize=-O2 -flto
GenFlight.menu.opt.o3std=Fastest (-O3)
GenFlight.menu.opt.o3std.build.flags.optimize=-O3
GenFlight.menu.opt.o3lto=Fastest (-O3) with LTO
GenFlight.menu.opt.o3lto.build.flags.optimize=-O3 -flto
GenFlight.menu.opt.ogstd=Debug (-Og)
GenFlight.menu.opt.ogstd.build.flags.optimize=-Og
GenFlight.menu.opt.o0std=No Optimization (-O0)
GenFlight.menu.opt.o0std.build.flags.optimize=-O0

IotContinuum.menu.opt.osstd=Smallest (-Os default)
IotContinuum.menu.opt.oslto=Smallest (-Os) with LTO
IotContinuum.menu.opt.oslto.build.flags.optimize=-Os -flto
IotContinuum.menu.opt.o1std=Fast (-O1)
IotContinuum.menu.opt.o1std.build.flags.optimize=-O1
IotContinuum.menu.opt.o1lto=Fast (-O1) with LTO
IotContinuum.menu.opt.o1lto.build.flags.optimize=-O1 -flto
IotContinuum.menu.opt.o2std=Faster (-O2)
IotContinuum.menu.opt.o2std.build.flags.optimize=-O2
IotContinuum.menu.opt.o2lto=Faster (-O2) with LTO
IotContinuum.menu.opt.o2lto.build.flags.optimize=-O2 -flto
IotContinuum.menu.opt.o3std=Fastest (-O3)
IotContinuum.menu.opt.o3std.build.flags.optimize=-O3
IotContinuum.menu.opt.o3lto=Fastest (-O3) with LTO
IotContinuum.menu.opt.o3lto.build.flags.optimize=-O3 -flto
IotContinuum.menu.opt.ogstd=Debug (-Og)
IotContinuum.menu.opt.ogstd.build.flags.optimize=-Og
IotContinuum.menu.opt.o0std=No Optimization (-O0)
IotContinuum.menu.opt.o0std.build.flags.optimize=-O0

LoRa.menu.opt.osstd=Smallest (-Os default)
LoRa.menu.opt.oslto=Smallest (-Os) with LTO
LoRa.menu.opt.oslto.build.flags.optimize=-Os -flto
LoRa.menu.opt.o1std=Fast (-O1)
LoRa.menu.opt.o1std.build.flags.optimize=-O1
LoRa.menu.opt.o1lto=Fast (-O1) with LTO
LoRa.menu.opt.o1lto.build.flags.optimize=-O1 -flto
LoRa.menu.opt.o2std=Faster (-O2)
LoRa.menu.opt.o2std.build.flags.optimize=-O2
LoRa.menu.opt.o2lto=Faster (-O2) with LTO
LoRa.menu.opt.o2lto.build.flags.optimize=-O2 -flto
LoRa.menu.opt.o3std=Fastest (-O3)
LoRa.menu.opt.o3std.build.flags.optimize=-O3
LoRa.menu.opt.o3lto=Fastest (-O3) with LTO
LoRa.menu.opt.o3lto.build.flags.optimize=-O3 -flto
LoRa.menu.opt.ogstd=Debug (-Og)
LoRa.menu.opt.ogstd.build.flags.optimize=-Og
LoRa.menu.opt.o0std=No Optimization (-O0)
LoRa.menu.opt.o0std.build.flags.optimize=-O0

Midatronics.menu.opt.osstd=Smallest (-Os default)
Midatronics.menu.opt.oslto=Smallest (-Os) with LTO
Midatronics.menu.opt.oslto.build.flags.optimize=-Os -flto
Midatronics.menu.opt.o1std=Fast (-O1)
Midatronics.menu.opt.o1std.build.flags.optimize=-O1
Midatronics.menu.opt.o1lto=Fast (-O1) with LTO
Midatronics.menu.opt.o1lto.build.flags.optimize=-O1 -flto
Midatronics.menu.opt.o2std=Faster (-O2)
Midatronics.menu.opt.o2std.build.flags.optimize=-O2
Midatronics.menu.opt.o2lto=Faster (-O2) with LTO
Midatronics.menu.opt.o2lto.build.flags.optimize=-O2 -flto
Midatronics.menu.opt.o3std=Fastest (-O3)
Midatronics.menu.opt.o3std.build.flags.optimize=-O3
Midatronics.menu.opt.o3lto=Fastest (-O3) with LTO
Midatronics.menu.opt.o3lto.build.flags.optimize=-O3 -flto
Midatronics.menu.opt.ogstd=Debug (-Og)
Midatronics.menu.opt.ogstd.build.flags.optimize=-Og
Midatronics.menu.opt.o0std=No Optimization (-O0)
Midatronics.menu.opt.o0std.build.flags.optimize=-O0

SparkFun.menu.opt.osstd=Smallest (-Os default)
SparkFun.menu.opt.oslto=Smallest (-Os) with LTO
SparkFun.menu.opt.oslto.build.flags.optimize=-Os -flto
SparkFun.menu.opt.o1std=Fast (-O1)
SparkFun.menu.opt.o1std.build.flags.optimize=-O1
SparkFun.menu.opt.o1lto=Fast (-O1) with LTO
SparkFun.menu.opt.o1lto.build.flags.optimize=-O1 -flto
SparkFun.menu.opt.o2std=Faster (-O2)
SparkFun.menu.opt.o2std.build.flags.optimize=-O2
SparkFun.menu.opt.o2lto=Faster (-O2) with LTO
SparkFun.menu.opt.o2lto.build.flags.optimize=-O2 -flto
SparkFun.menu.opt.o3std=Fastest (-O3)
SparkFun.menu.opt.o3std.build.flags.optimize=-O3
SparkFun.menu.opt.o3lto=Fastest (-O3) with LTO
SparkFun.menu.opt.o3lto.build.flags.optimize=-O3 -flto
SparkFun.menu.opt.ogstd=Debug (-Og)
SparkFun.menu.opt.ogstd.build.flags.optimize=-Og
SparkFun.menu.opt.o0std=No Optimization (-O0)
SparkFun.menu.opt.o0std.build.flags.optimize=-O0

ELV_Modular_System.menu.opt.osstd=Smallest (-Os default)
ELV_Modular_System.menu.opt.oslto=Smallest (-Os) with LTO
ELV_Modular_System.menu.opt.oslto.build.flags.optimize=-Os -flto
ELV_Modular_System.menu.opt.o1std=Fast (-O1)
ELV_Modular_System.menu.opt.o1std.build.flags.optimize=-O1
ELV_Modular_System.menu.opt.o1lto=Fast (-O1) with LTO
ELV_Modular_System.menu.opt.o1lto.build.flags.optimize=-O1 -flto
ELV_Modular_System.menu.opt.o2std=Faster (-O2)
ELV_Modular_System.menu.opt.o2std.build.flags.optimize=-O2
ELV_Modular_System.menu.opt.o2lto=Faster (-O2) with LTO
ELV_Modular_System.menu.opt.o2lto.build.flags.optimize=-O2 -flto
ELV_Modular_System.menu.opt.o3std=Fastest (-O3)
ELV_Modular_System.menu.opt.o3std.build.flags.optimize=-O3
ELV_Modular_System.menu.opt.o3lto=Fastest (-O3) with LTO
ELV_Modular_System.menu.opt.o3lto.build.flags.optimize=-O3 -flto
ELV_Modular_System.menu.opt.ogstd=Debug (-Og)
ELV_Modular_System.menu.opt.ogstd.build.flags.optimize=-Og
ELV_Modular_System.menu.opt.o0std=No Optimization (-O0)
ELV_Modular_System.menu.opt.o0std.build.flags.optimize=-O0

STeaMi.menu.opt.osstd=Smallest (-Os default)
STeaMi.menu.opt.oslto=Smallest (-Os) with LTO
STeaMi.menu.opt.oslto.build.flags.optimize=-Os -flto
STeaMi.menu.opt.o1std=Fast (-O1)
STeaMi.menu.opt.o1std.build.flags.optimize=-O1
STeaMi.menu.opt.o1lto=Fast (-O1) with LTO
STeaMi.menu.opt.o1lto.build.flags.optimize=-O1 -flto
STeaMi.menu.opt.o2std=Faster (-O2)
STeaMi.menu.opt.o2std.build.flags.optimize=-O2
STeaMi.menu.opt.o2lto=Faster (-O2) with LTO
STeaMi.menu.opt.o2lto.build.flags.optimize=-O2 -flto
STeaMi.menu.opt.o3std=Fastest (-O3)
STeaMi.menu.opt.o3std.build.flags.optimize=-O3
STeaMi.menu.opt.o3lto=Fastest (-O3) with LTO
STeaMi.menu.opt.o3lto.build.flags.optimize=-O3 -flto
STeaMi.menu.opt.ogstd=Debug (-Og)
STeaMi.menu.opt.ogstd.build.flags.optimize=-Og
STeaMi.menu.opt.o0std=No Optimization (-O0)
STeaMi.menu.opt.o0std.build.flags.optimize=-O0

# Debug information
Nucleo_144.menu.dbg.none=None
Nucleo_144.menu.dbg.enable_sym=Symbols Enabled (-g)
Nucleo_144.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
Nucleo_144.menu.dbg.enable_log=Core logs Enabled
Nucleo_144.menu.dbg.enable_log.build.flags.debug=
Nucleo_144.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
Nucleo_144.menu.dbg.enable_all.build.flags.debug=-g

Nucleo_64.menu.dbg.none=None
Nucleo_64.menu.dbg.enable_sym=Symbols Enabled (-g)
Nucleo_64.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
Nucleo_64.menu.dbg.enable_log=Core logs Enabled
Nucleo_64.menu.dbg.enable_log.build.flags.debug=
Nucleo_64.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
Nucleo_64.menu.dbg.enable_all.build.flags.debug=-g

Nucleo_32.menu.dbg.none=None
Nucleo_32.menu.dbg.enable_sym=Symbols Enabled (-g)
Nucleo_32.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
Nucleo_32.menu.dbg.enable_log=Core logs Enabled
Nucleo_32.menu.dbg.enable_log.build.flags.debug=
Nucleo_32.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
Nucleo_32.menu.dbg.enable_all.build.flags.debug=-g

Disco.menu.dbg.none=None
Disco.menu.dbg.enable_sym=Symbols Enabled (-g)
Disco.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
Disco.menu.dbg.enable_log=Core logs Enabled
Disco.menu.dbg.enable_log.build.flags.debug=
Disco.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
Disco.menu.dbg.enable_all.build.flags.debug=-g

Eval.menu.dbg.none=None
Eval.menu.dbg.enable_sym=Symbols Enabled (-g)
Eval.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
Eval.menu.dbg.enable_log=Core logs Enabled
Eval.menu.dbg.enable_log.build.flags.debug=
Eval.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
Eval.menu.dbg.enable_all.build.flags.debug=-g

STM32MP1.menu.dbg.none=None
STM32MP1.menu.dbg.enable_sym=Symbols Enabled (-g)
STM32MP1.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
STM32MP1.menu.dbg.enable_log=Core logs Enabled
STM32MP1.menu.dbg.enable_log.build.flags.debug=
STM32MP1.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
STM32MP1.menu.dbg.enable_all.build.flags.debug=-g

