stm32duino/Arduino_Core_STM32/boards.txt
GenWL.menu.dbg.none=None
GenWL.menu.dbg.enable_sym=Symbols Enabled (-g)
GenWL.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
GenWL.menu.dbg.enable_log=Core logs Enabled
GenWL.menu.dbg.enable_log.build.flags.debug=
GenWL.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
GenWL.menu.dbg.enable_all.build.flags.debug=-g

3dprinter.menu.dbg.none=None
3dprinter.menu.dbg.enable_sym=Symbols Enabled (-g)
3dprinter.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
3dprinter.menu.dbg.enable_log=Core logs Enabled
3dprinter.menu.dbg.enable_log.build.flags.debug=
3dprinter.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
3dprinter.menu.dbg.enable_all.build.flags.debug=-g

Blues.menu.dbg.none=None
Blues.menu.dbg.enable_sym=Symbols Enabled (-g)
Blues.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
Blues.menu.dbg.enable_log=Core logs Enabled
Blues.menu.dbg.enable_log.build.flags.debug=
Blues.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
Blues.menu.dbg.enable_all.build.flags.debug=-g

Elecgator.menu.dbg.none=None
Elecgator.menu.dbg.enable_sym=Symbols Enabled (-g)
Elecgator.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
Elecgator.menu.dbg.enable_log=Core logs Enabled
Elecgator.menu.dbg.enable_log.build.flags.debug=
Elecgator.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
Elecgator.menu.dbg.enable_all.build.flags.debug=-g

ESC_board.menu.dbg.none=None
ESC_board.menu.dbg.enable_sym=Symbols Enabled (-g)
ESC_board.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
ESC_board.menu.dbg.enable_log=Core logs Enabled
ESC_board.menu.dbg.enable_log.build.flags.debug=
ESC_board.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
ESC_board.menu.dbg.enable_all.build.flags.debug=-g

Garatronic.menu.dbg.none=None
Garatronic.menu.dbg.enable_sym=Symbols Enabled (-g)
Garatronic.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
Garatronic.menu.dbg.enable_log=Core logs Enabled
Garatronic.menu.dbg.enable_log.build.flags.debug=
Garatronic.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
Garatronic.menu.dbg.enable_all.build.flags.debug=-g

GenFlight.menu.dbg.none=None
GenFlight.menu.dbg.enable_sym=Symbols Enabled (-g)
GenFlight.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
GenFlight.menu.dbg.enable_log=Core logs Enabled
GenFlight.menu.dbg.enable_log.build.flags.debug=
GenFlight.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
GenFlight.menu.dbg.enable_all.build.flags.debug=-g

IotContinuum.menu.dbg.none=None
IotContinuum.menu.dbg.enable_sym=Symbols Enabled (-g)
IotContinuum.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
IotContinuum.menu.dbg.enable_log=Core logs Enabled
IotContinuum.menu.dbg.enable_log.build.flags.debug=
IotContinuum.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
IotContinuum.menu.dbg.enable_all.build.flags.debug=-g

LoRa.menu.dbg.none=None
LoRa.menu.dbg.enable_sym=Symbols Enabled (-g)
LoRa.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
LoRa.menu.dbg.enable_log=Core logs Enabled
LoRa.menu.dbg.enable_log.build.flags.debug=
LoRa.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
LoRa.menu.dbg.enable_all.build.flags.debug=-g

Midatronics.menu.dbg.none=None
Midatronics.menu.dbg.enable_sym=Symbols Enabled (-g)
Midatronics.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
Midatronics.menu.dbg.enable_log=Core logs Enabled
Midatronics.menu.dbg.enable_log.build.flags.debug=
Midatronics.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
Midatronics.menu.dbg.enable_all.build.flags.debug=-g

SparkFun.menu.dbg.none=None
SparkFun.menu.dbg.enable_sym=Symbols Enabled (-g)
SparkFun.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
SparkFun.menu.dbg.enable_log=Core logs Enabled
SparkFun.menu.dbg.enable_log.build.flags.debug=
SparkFun.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
SparkFun.menu.dbg.enable_all.build.flags.debug=-g

ELV_Modular_System.menu.dbg.none=None
ELV_Modular_System.menu.dbg.enable_sym=Symbols Enabled (-g)
ELV_Modular_System.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
ELV_Modular_System.menu.dbg.enable_log=Core logs Enabled
ELV_Modular_System.menu.dbg.enable_log.build.flags.debug=
ELV_Modular_System.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
ELV_Modular_System.menu.dbg.enable_all.build.flags.debug=-g

STeaMi.menu.dbg.none=None
STeaMi.menu.dbg.enable_sym=Symbols Enabled (-g)
STeaMi.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
STeaMi.menu.dbg.enable_log=Core logs Enabled
STeaMi.menu.dbg.enable_log.build.flags.debug=
STeaMi.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
STeaMi.menu.dbg.enable_all.build.flags.debug=-g

# C Runtime Library
Nucleo_144.menu.rtlib.nano=Newlib Nano (default)
Nucleo_144.menu.rtlib.nanofp=Newlib Nano + Float Printf
Nucleo_144.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
Nucleo_144.menu.rtlib.nanofs=Newlib Nano + Float Scanf
Nucleo_144.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
Nucleo_144.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
Nucleo_144.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
Nucleo_144.menu.rtlib.full=Newlib Standard
Nucleo_144.menu.rtlib.full.build.flags.ldspecs=

Nucleo_64.menu.rtlib.nano=Newlib Nano (default)
Nucleo_64.menu.rtlib.nanofp=Newlib Nano + Float Printf
Nucleo_64.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
Nucleo_64.menu.rtlib.nanofs=Newlib Nano + Float Scanf
Nucleo_64.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
Nucleo_64.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
Nucleo_64.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
Nucleo_64.menu.rtlib.full=Newlib Standard
Nucleo_64.menu.rtlib.full.build.flags.ldspecs=

Nucleo_32.menu.rtlib.nano=Newlib Nano (default)
Nucleo_32.menu.rtlib.nanofp=Newlib Nano + Float Printf
Nucleo_32.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
Nucleo_32.menu.rtlib.nanofs=Newlib Nano + Float Scanf
Nucleo_32.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
Nucleo_32.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
Nucleo_32.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
Nucleo_32.menu.rtlib.full=Newlib Standard
Nucleo_32.menu.rtlib.full.build.flags.ldspecs=

