stm32duino/Arduino_Core_STM32/boards.txt
GenL0.menu.rtlib.nano=Newlib Nano (default)
GenL0.menu.rtlib.nanofp=Newlib Nano + Float Printf
GenL0.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
GenL0.menu.rtlib.nanofs=Newlib Nano + Float Scanf
GenL0.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
GenL0.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
GenL0.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
GenL0.menu.rtlib.full=Newlib Standard
GenL0.menu.rtlib.full.build.flags.ldspecs=

GenL1.menu.rtlib.nano=Newlib Nano (default)
GenL1.menu.rtlib.nanofp=Newlib Nano + Float Printf
GenL1.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
GenL1.menu.rtlib.nanofs=Newlib Nano + Float Scanf
GenL1.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
GenL1.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
GenL1.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
GenL1.menu.rtlib.full=Newlib Standard
GenL1.menu.rtlib.full.build.flags.ldspecs=

GenL4.menu.rtlib.nano=Newlib Nano (default)
GenL4.menu.rtlib.nanofp=Newlib Nano + Float Printf
GenL4.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
GenL4.menu.rtlib.nanofs=Newlib Nano + Float Scanf
GenL4.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
GenL4.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
GenL4.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
GenL4.menu.rtlib.full=Newlib Standard
GenL4.menu.rtlib.full.build.flags.ldspecs=

GenL5.menu.rtlib.nano=Newlib Nano (default)
GenL5.menu.rtlib.nanofp=Newlib Nano + Float Printf
GenL5.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
GenL5.menu.rtlib.nanofs=Newlib Nano + Float Scanf
GenL5.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
GenL5.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
GenL5.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
GenL5.menu.rtlib.full=Newlib Standard
GenL5.menu.rtlib.full.build.flags.ldspecs=

GenU0.menu.rtlib.nano=Newlib Nano (default)
GenU0.menu.rtlib.nanofp=Newlib Nano + Float Printf
GenU0.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
GenU0.menu.rtlib.nanofs=Newlib Nano + Float Scanf
GenU0.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
GenU0.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
GenU0.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
GenU0.menu.rtlib.full=Newlib Standard
GenU0.menu.rtlib.full.build.flags.ldspecs=

GenU3.menu.rtlib.nano=Newlib Nano (default)
GenU3.menu.rtlib.nanofp=Newlib Nano + Float Printf
GenU3.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
GenU3.menu.rtlib.nanofs=Newlib Nano + Float Scanf
GenU3.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
GenU3.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
GenU3.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
GenU3.menu.rtlib.full=Newlib Standard
GenU3.menu.rtlib.full.build.flags.ldspecs=

GenU5.menu.rtlib.nano=Newlib Nano (default)
GenU5.menu.rtlib.nanofp=Newlib Nano + Float Printf
GenU5.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
GenU5.menu.rtlib.nanofs=Newlib Nano + Float Scanf
GenU5.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
GenU5.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
GenU5.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
GenU5.menu.rtlib.full=Newlib Standard
GenU5.menu.rtlib.full.build.flags.ldspecs=

GenWB.menu.rtlib.nano=Newlib Nano (default)
GenWB.menu.rtlib.nanofp=Newlib Nano + Float Printf
GenWB.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
GenWB.menu.rtlib.nanofs=Newlib Nano + Float Scanf
GenWB.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
GenWB.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
GenWB.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
GenWB.menu.rtlib.full=Newlib Standard
GenWB.menu.rtlib.full.build.flags.ldspecs=

GenWB0.menu.rtlib.nano=Newlib Nano (default)
GenWB0.menu.rtlib.nanofp=Newlib Nano + Float Printf
GenWB0.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
GenWB0.menu.rtlib.nanofs=Newlib Nano + Float Scanf
GenWB0.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
GenWB0.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
GenWB0.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
GenWB0.menu.rtlib.full=Newlib Standard
GenWB0.menu.rtlib.full.build.flags.ldspecs=

GenWBA.menu.rtlib.nano=Newlib Nano (default)
GenWBA.menu.rtlib.nanofp=Newlib Nano + Float Printf
GenWBA.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
GenWBA.menu.rtlib.nanofs=Newlib Nano + Float Scanf
GenWBA.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
GenWBA.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
GenWBA.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
GenWBA.menu.rtlib.full=Newlib Standard
GenWBA.menu.rtlib.full.build.flags.ldspecs=

GenWL.menu.rtlib.nano=Newlib Nano (default)
GenWL.menu.rtlib.nanofp=Newlib Nano + Float Printf
GenWL.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
GenWL.menu.rtlib.nanofs=Newlib Nano + Float Scanf
GenWL.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
GenWL.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
GenWL.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
GenWL.menu.rtlib.full=Newlib Standard
GenWL.menu.rtlib.full.build.flags.ldspecs=

3dprinter.menu.rtlib.nano=Newlib Nano (default)
3dprinter.menu.rtlib.nanofp=Newlib Nano + Float Printf
3dprinter.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
3dprinter.menu.rtlib.nanofs=Newlib Nano + Float Scanf
3dprinter.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
3dprinter.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
3dprinter.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
3dprinter.menu.rtlib.full=Newlib Standard
3dprinter.menu.rtlib.full.build.flags.ldspecs=

Blues.menu.rtlib.nano=Newlib Nano (default)
Blues.menu.rtlib.nanofp=Newlib Nano + Float Printf
Blues.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
Blues.menu.rtlib.nanofs=Newlib Nano + Float Scanf
Blues.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
Blues.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
Blues.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
Blues.menu.rtlib.full=Newlib Standard
Blues.menu.rtlib.full.build.flags.ldspecs=

Elecgator.menu.rtlib.nano=Newlib Nano (default)
Elecgator.menu.rtlib.nanofp=Newlib Nano + Float Printf
Elecgator.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
Elecgator.menu.rtlib.nanofs=Newlib Nano + Float Scanf
Elecgator.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
Elecgator.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
Elecgator.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
Elecgator.menu.rtlib.full=Newlib Standard
Elecgator.menu.rtlib.full.build.flags.ldspecs=

ESC_board.menu.rtlib.nano=Newlib Nano (default)
ESC_board.menu.rtlib.nanofp=Newlib Nano + Float Printf
ESC_board.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
ESC_board.menu.rtlib.nanofs=Newlib Nano + Float Scanf
ESC_board.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
ESC_board.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
ESC_board.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
ESC_board.menu.rtlib.full=Newlib Standard
ESC_board.menu.rtlib.full.build.flags.ldspecs=

Garatronic.menu.rtlib.nano=Newlib Nano (default)
Garatronic.menu.rtlib.nanofp=Newlib Nano + Float Printf
Garatronic.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
Garatronic.menu.rtlib.nanofs=Newlib Nano + Float Scanf
Garatronic.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
Garatronic.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
Garatronic.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
Garatronic.menu.rtlib.full=Newlib Standard
Garatronic.menu.rtlib.full.build.flags.ldspecs=

